[
    {
        "postid": 0,
        "date": "May 16, 2022",
        "title": "Binance CEO Changpeng Zhao Doubts Terra’s Plans for a Fork",
        "url": "https://www.coinbureau.com/news/binance-ceo-changpeng-zhao-doubts-terras-plans-for-a-fork/",
        "article": " Changpeng Zhao (CZ), CEO of , has voiced his opinion on Terra’s proposal to fork its blockchain and attempt a recovery. Following the collapse of both  and UST, Terraform Labs founder Do Kwon endorsed the idea of forking Terra to “make the ecosystem whole from the UST depegging event.” “We’ve built up one of the largest and most vibrant developer ecosystems in crypto, with some of the smartest minds in the world working on products with the best UI/UX,” Kwon said, while suggesting that the network be reset with a supply of 1 billion LUNA and a redistribution plan for LUNA holders, UST holders, and the community pool. Some Terra community members are in  to hard fork Terra to “TERRA2”, snapshot the holdings before the collapse, provide HODLers with a new coin (“LUNA2″), create a new chain with a new coin and version of UST, and then start a pool to repay the old UST peg. Image via Shutterstock Of the potential recovery plans, CZ : “Personal opinion. NFA. This won’t work.– forking does not give the new fork any value. That’s wishful thinking.– one cannot void all transactions after an old snapshot, both on-chain and off-chain (exchanges). Where is all the BTC that was supposed to be used as reserves?” In another , CZ first denied rumours that Binance Labs had invested in UST, clarifying that in 2018, the exchange’s venture capital arm only invested $3 million USD into Terra. He then gave some thoughts on Terra’s response to the debacle and the proposal of a fork. “Minting, forking, don’t create value. Buying back, burning does, but requires funds. Funds that the project team may not have. In this regard, I would like to see more transparency from [Terra]. Much more! Including specific on-chain transactions (txids) of all the funds. Relying on 3rd party analysis is not sufficient or accurate. This is the first thing that should have happened… I am not always right, but my perspective is: Failures can/will happen. But when they do, transparency, speedy communication and owning responsibility to the community is extremely important.” I am just hoping that the project teams can rise from the ashes and rebuild in a proper and sensible way.” ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "2 min read",
            "category": "News"
        }
    },
    {
        "postid": 1,
        "date": "May 16, 2022",
        "title": "UK To Go Ahead With Stablecoin Regulations After Queen’s Approval",
        "url": "https://www.coinbureau.com/news/uk-to-go-ahead-with-stablecoin-regulations-after-queens-approval/",
        "article": " Less than a week after Terra’s $50 billion collapse, UK officials are moving forward with legalizing and regulating . The UK’s Treasury Department said it would be including plans to regulate the crypto sector as a payment mechanism in new financial legislation announced by the Queen. Algorithmic stablecoins like UST will not be included in the new laws, as the Treasury has said they don’t guarantee stability the same way as traditional reserve-backed stablecoins. “Legislation to regulate stablecoins, where used as a means of payment, will be part of the Financial Services and Markets Bill which was announced in the Queen’s Speech,” a Treasury spokesman . “This will create the conditions for issuers and service providers to operate and grow in the UK, whilst ensuring financial stability and high regulatory standards so that these new technologies can be used reliably and safely. The Government has been clear that certain stablecoins are not suitable for payment purposes as they share characteristics with unbacked crypto assets. We will continue to monitor the wider crypto asset market and stand ready to take further regulatory action if required.” Image via Shutterstock Last month, the UK announced plans to write new regulations for stabelcoins and the release of a “” on a non-fungible token (NFT). Rishi Sunak, Chancellor of the Exchequer said it was his ambition to make the UK a “global hub for crypto asset technology,” adding that the legislative plans were aimed at helping crypto firms to “invest, innovate and scale up” in the country. “We want to see the businesses of tomorrow – and the jobs they create – here in the UK, and by regulating effectively we can give them the confidence they need to think and invest long-term,” he said. “This is part of our plan to ensure the UK financial services industry is always at the forefront of technology and innovation.” Stablecoins have come under scrutiny following the implosion of both LUNA and UST. US Treasury Secretary Janet Yellen  last week that the debacle “simply illustrates that this is a rapidly growing product and there are rapidly growing risks.” She urged for new regulations on the sector by the end of this year. ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "2 min read",
            "category": "News"
        }
    },
    {
        "postid": 2,
        "date": "May 13, 2022",
        "title": "Coin Bureau Conference 2022 Recap",
        "url": "https://www.coinbureau.com/review/coin-bureau-conference-2022-recap/",
        "article": " There are some key monumental dates of epic historical significance in the crypto industry. These events will go down in history as pivotal moments for Bitcoin and all of Cryptocurrency, events that will be remembered and celebrated throughout the ages. Let’s look back on some of the occasions that solidified cryptocurrencies and contributed to the industry that we all love and helped to make it what it is today: October 31, 2008– Satoshi Nakamoto first released the Bitcoin whitepaper. January 12, 2009– The first ever Bitcoin transaction, sent by Hal Finney for 100 BTC. May 22, 2010– Laszlo Hanyecz purchased two Papa John’s Pizzas for 10,000 BTC, sparking the tradition of the annual Bitcoin Pizza Day. December 18, 2014– The world was gifted with the first use of the word HODL. July 30, 2015– Ethereum was born. February 8, 2021– Elon Musk Announces Tesla would purchase $1.5 billion in BTC. September 7, 2021– El Salvador becomes the first country to adopt Bitcoin as legal tender. May 7, 2022– The Coin Bureau hosts the first-ever Coin Bureau Conference. The first of many may I add. Okay fine… maybe some mentions on that list are more monumental than others but hey, it was a big day for us! We could not be prouder of the outcome, nor could we be more grateful and thankful to our incredible community, partners, and sponsors who supported us, attended the event, and made the whole thing possible.  If you were fortunate enough to be there in person, I hope that you enjoyed attending the event as much as we enjoyed hosting it, and enjoyed meeting the Coin Bureau team as much as we enjoyed meeting many of you. If you were not able to make it there in person, we did broadcast the event virtually and posted the recordings to our Coin Bureau Clips channel. Here is part one: And here is part two: If you were not able to attend the event, don’t fret. Mark your calendars and we hope to see you there next year. This article will cover exactly what went down, and why we chose to host the event in the first place. Page Contents 👉 [] I know every YouTube channel makes this claim, but we honestly believe that we have the best community in all of crypto. We have the largest crypto YouTube channel and the largest crypto community spanning across Telegram, Twitter, TikTok, Instagram, and our blogs and articles are enjoyed by thousands of readers each month. The reason we chose to host an event was simply that we wanted to give something back to our incredibly supportive, kind, and generous community, as well as the many friends we have made in the crypto space.  We live in a strange era where much of our time is spent interacting with one another through computers and mobile devices. We wanted to host an event to get the chance to have real face-to-face interactions with many of you that we have gotten to know so well over the years and take some time to forget about the markets, forget about price, and just have a chat and a laugh, network, and make new friends. Having a meet and greet with our community was something we had thought about doing for a while. When we decided to put it to our community for a vote on whether or not a Coin Bureau Conference would be something that our viewers would be interested in, we had about: We ended up putting the decision to a vote on Twitter to see how many people would be interested in an event, and with the majority saying yes, we knew we had a green light to go.  Once we received feedback that a Coin Bureau event was something our community would be interested in, we started pushing the information to our other socials groups, received more positive feedback, and it was pretty clear what needed to be done. It isn’t just our community who supported this idea, you don’t become the biggest crypto YouTube channel in the world without making some friends in high places. We ran the idea past our friends at FTX, LunarCrush, Celsius, Swissborg, and MegaFans, who also thought it was a good idea, and the next thing you know, a plan was being formed. Once we announced to our community that tickets were available for sale, we were delighted, albeit, slightly surprised to find out the event sold out in a matter of days. Guess we will need to find a bigger venue for the next one.  We wanted the event to be free, but were also aware that as soon as you offer a free event, a lot of tickets would be picked up by people who likely wouldn’t attend, so we put a price on for 5 GBP to ensure we were attracting folks who genuinely wanted to be there. Upon entrance, attendees received a free drink voucher, barista-made speciality coffees, and a pretty nifty swag bag, so they definitely got their money’s worth within minutes of entering the venue. Roll out the red carpet, polish the chandeliers, and dust off the tuxedo because we managed to secure one of the fanciest venues in London, the De Vere Grand Connaught Rooms. I’ll bet that a place this swanky has never seen the likes of us crypto folk before. I will admit that it felt a bit upscale for a load of crypto crusaders and DeFi degenerates like ourselves, but hey, just because my screensaver is a picture of Vitalik riding a unicorn on a rainbow, that doesn’t mean that I can’t enjoy the finer things in life, so we went with it. Here is how the venue looked as advertised: Pretty Swanky Right? Image via And this is what it looked like after we gave it the crypto makeover:  And just so you don’t need to worry about a dress code for the next event, I will say that I did not see a single attendee show up in a tuxedo, top hat, nor monocle, so I think it is safe to say we upped the “cool-factor” and brought down the stuffiness of the place. There were some legendary crypto t-shirts that I saw, I always love the quirkiness of the crypto community. When we reached out to our network and let them know that we were going to be hosting our first Coin Bureau event, I must say that we felt like the popular kid in high school leading up to the prom and had no shortage of “suitors.” The amount of support, advice and kind words of encouragement from our network of friends and partners gave us the reassurance we needed to know that this was going to be a great event. In order to make the event possible, we partnered with  who helped out immensely; we could not be more grateful to them for the support as we could not have done it without them. 🙏 Image via LunarCrush is a social intelligence platform for cryptocurrencies. They collect activity across various social media platforms to help crypto traders and investors perform in-depth sentiment analysis and have seen a huge uptick in popularity and adoption since their launch. They were a fantastic partner and ally for the conference and were a pleasure to have on stage to discuss a multitude of topics. For Sponsors, we had , , , MegaFans, Cudos, Juno,  and Unique Network.  Some of our sponsors sent members from their teams to give talks, run events, and engage with the attendees from branded booths, makings some valuable contacts and connections while meeting some interesting members of our community. The event kicked off at noon with a welcome speech from Guy and Macey, then a quick chat from Guy about the importance of crypto, the failure of the traditional financial system, and why we need crypto now more than ever. Guy and Macey, Classy as Ever on Stage The event was broken into two parts, the morning session looked something like this: Morning Session Schedule Following Guy’s introduction, we had our first Fireside chat with LunarCrush’s Chief Product Officer and Co-Founder Jon Farjo, along with the Chief Partnership Officer for SwissBorg, Alex Fazel. They had a great session on how LunarCrush helps with sentiment analysis, then a chat about the importance of the crypto community. Following that, we had the Head of Brand for LunarCrush, Norman Rabinovich, give a talk about the significance of brand then he welcomed Ben Livshitz, CEO of  on stage to discuss brand, Web3, blockchain, and the journey of Zilliqa. After that, it was time for Guy to come back out on stage and welcome our friends and YouTube stars over at  and  to have the first breakout session panel discussion about the evolution of Altcoins. Guy Chatting Altcoins with CryptoBusy and Coin Club Japan Following the Altcoin chat, we had Irina Karagyaur of the . After securing a Polkadot Parachain Slot (congratulations!), Irina came to the event to give us an incredible talk about the Metaverse, the next generation of NFTs, and future developments in the NFT and Metaverse space. That conversation was the perfect Segway for Luke Gniwecki of the  to talk about how the Cudos network is building out their layer 1 blockchain which will support web3-enabled cloud computing and a decentralized community-governed and permissionless compute network. After all that excitement, there was a P2E live gaming tournament hosted by  where there was $5,000 in BTC up for grabs, followed by some free time to mingle, network and discuss all things crypto. The evening session then kicked off at 5 pm and had a schedule that looked like this: Evening Session Schedule Guy kicked off the start of the second session with a bit of much-needed hopium, briefly discussing all the developments happening in the space that isn’t reflected in price and went on to talk about how there is a shortage of developers before bringing on a member of the  team. Shortly after that, Guy brought on YouTuber and friend of the Coin Bureau, Rob, from  to discuss his journey into the crypto space, taxes, relocating, and the current state of crypto investing. Directly after Rob, we were joined by  to tell us all about content creation and the importance of having a social media strategy. Maren Altman Discusses Social Media Strategy This brought us to the second Fireside chat of the day with Joe Vezzani, the CEO and Co-Founder of LunarCrush, and industry veteran and Managing Director at , Maja Vujinovic, discussing what brought her into crypto, the impact that blockchain technology can have in developing countries, and why it is important to be optimistic about the future and why we need to take chances. Joe Vezzani of LunarCrush and Maja Vujinovic of OGroup Discussing Blockchain’s Impact on Developing Nations and the Importance of Optimism for the Future Following the Fireside chat, we had a panel discussion with Guy, our head of research Dan Krupka, and , to cover all things DeFi related, and wow, do they get into some fascinating topics. They discuss topics such as what makes a good DeFi project, the best way to optimally utilize DeFi in a bear market, and how to safely navigate the whacky world of DeFi. Guy, Dan, and DeFi Dad via Virtual Call Discuss all things DeFi The final chat of the evening was titled DAO or DIE, where Guy and Dan discuss all things DAO related with Max Schneider of , Luke Gniwecki of Cudos Ventures, and Elizabeth Yeung of . After the final discussion, there was another P2E tournament hosted by MegaFans and free time for some networking.  The conference turned out to be quite a success and the CB team along with their partners and sponsors earned a well-deserved pat on the back for pulling it off and creating such a memorable event. The tone was overall very positive, and it was nice to see everyone come together to chat, meet new people, build business connections, network, and make friends. The event was full of entrepreneurs who were keen to promote their business ideas, projects in their early days seeking funding and advice, all the way to people who just wanted to hang out and have a chat with like-minded individuals. For us, we made a lot of very valuable connections with heads of projects that we didn’t even know existed, met with some folks in high places that will go on to be beneficial contacts, and even held one very informal and unexpected job interview on the spot for a potential Coin Bureau candidate. We were quite impressed with the outcome and cannot wait to do it again next year.",
        "metadata": {
            "source": "coinbureau",
            "readtime": "12 min read",
            "category": "Review"
        }
    },
    {
        "postid": 3,
        "date": "May 13, 2022",
        "title": "Blockchain Analytics Firm Chainalysis Valued at $8.6 Billion In Latest Raise",
        "url": "https://www.coinbureau.com/news/blockchain-analytics-firm-chainalysis-valued-at-8-6-billion-in-latest-raise/",
        "article": " Blockchain analytics company Chainalysis has been valued at a hefty $8.6 billion in its latest capital raise led by GIC, Singapore’s sovereign wealth fund. Bank of New York Mellon and Emergence capital also participated in the . Already existing investors such as Accel, Blackstone, Dragoneer, and Fundersclub increased their investment in the company. According to Chainalysis, the funding means the firm is now the largest SaaS firm in the entire cryptocurrency industry. Chainalysis says it will use the new funds to “continue to invest in product innovation and scale its global operations to meet customer demand as the asset class gains mainstream acceptance.” The company said that while governments have always been aware of the value behind blockchain data and analysis, private entities have also begun to take an interest over the last year, mostly from exchanges and  platforms looking for risk management or business intelligence solutions. Image via Shutterstock Chainalysis highlighted three key achievements over the past year: The company also said it had “huge success” in helping authorities tackle criminal activity and seizing funds. “In November 2021, the IRS Criminal Investigations announced that it had seized over $3.5 billion worth of cryptocurrency in 2021 — all from non-tax investigations — representing 93% of all funds seized by the division during that time period. Other successes include the $2.3 million seized from the ransomware group behind the Colonial Pipeline attack, and OFAC’s sanctioning of two Russia-based cryptocurrency services heavily involved in money laundering.” “Over the past year, the cryptocurrency industry crossed into the mainstream with financial institutions entering the space and new technologies like  disrupting traditional markets,” said Michael Gronager, Co-founder and CEO of Chainalysis. “Our partners at GIC understand the power of Chainalysis’ data platform and customer network, the strength of our team of leaders, and the market opportunity before us. I’m thrilled to deepen our relationship with their team, especially as we expand our business in the APAC region.” ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "2 min read",
            "category": "News"
        }
    },
    {
        "postid": 4,
        "date": "May 13, 2022",
        "title": "Terra Halts Blockchain Completely Following Massive Collapse",
        "url": "https://www.coinbureau.com/news/terra-halts-blockchain-completely-following-massive-collapse/",
        "article": " Terra halted its blockchain on Thursday evening after validators decided to try and prevent governance attacks as the severe inflation of LUNA reduced the cost of attack for bad actors. “The Terra blockchain was officially halted at a block height of 7603700,” TerraUSD said in a . “Validators are applying a patch to disable further delegations, and they will coordinate to restart the network in a few minutes,”  Terra’s official page. In what is believed to be a coordinated attack on the Terra ecosystem, LUNA crashed to below half a cent on Thursday while UST went severely off its peg. Since holders of UST can redeem 1 UST for $1 worth of LUNA, arbitrageurs have been repeatedly buying $UST at a discount and minting LUNA before selling for the profit on the difference. In four days, LUNA’s supply went from 340,000,000 to over 42,000,000,000 at the time of writing. Image via Shutterstock No specific plan has been announced to rebuild the system, and it isn’t clear whether or not the Terra team wants to abandon either  or UST. On May 11, TerraLabs founder Do Kwon wrote in a thread, “With the current on-chain spread, peg pressure, and UST burn rate, the supply overhang of UST (i.e., bad debt) should continue to decrease until parity is reached and spreads begin healing,” he said. “Naturally, this is at a high cost to UST and LUNA holders, but we will continue to explore various options to bring in more exogenous capital to the ecosystem & reduce supply overhang on UST.” So far, the only official course of action has been to enact Terra community proposal 1164,  increasing the basepool from 50M to 100M SDR, or in other words, raising the system’s minting capacity from $293 million to $1.2 billion. Terra’s blockchain resumed on Thursday evening shortly after it was halted.  The Terra blockchain has resumed block production.Delegations are disabled now that the chain is live with the new code merge. Validators, please check the Discord announcements for the latest patch notes.  ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "2 min read",
            "category": "News"
        }
    },
    {
        "postid": 5,
        "date": "May 12, 2022",
        "title": "Hustling Along with StepN",
        "url": "https://www.coinbureau.com/review/stepn/",
        "article": " Humans are, by nature, active creatures. In the long foregone days of our ancestors, we are almost always on the move. Whether it is foraging for food, building a shelter, or running away from predators, we spend most of our time moving. Doing any activity that expends energy is “used in accordance to the original design”. However, in our modern lifestyle, we are using our body in ways it’s not optimally designed for, like sitting around all day long, which seems to be the default mode of life. While there isn’t a great need for us to return to our ancestor’s way of life, it is also foolish of us to completely discard an active lifestyle.  Enter the fitness industry. This multi-billion dollar industry includes exercise equipment, gyms, personal trainers and coaches, health supplements etc. In all these cases, the industry profits from us paying someone to help us get fit. What if we get paid to exercise instead? That’s pretty much the impetus for , the newest trend to hit the crypto world and the latest attempt at gaining mainstream attention, which might hopefully, transform into adoption. Amongst the slew of dApps seeking to capitalise on this movement,  is far ahead of the pack. Page Contents 👉 [] The app is basically a step counter with extra bells and whistles for the crypto-earning part. Designed as a mobile app, it aims to incentivise users to exercise by offering them the opportunity to earn crypto tokens. These tokens can only be earned through holding a NFT sneaker, available for purchase in the app’s own marketplace. It was the winner of the Solana Ignition Hackathon in the Gaming section. It was also the only mobile game app to win in that category. This win helped it to gain attention and funding from some heavy-duty investors. If you’re interested to find out what all the fuss is about, let’s take a closer look at how it all works. Ready, get set, get StepN! Image via StepN I thought the biggest thing I had to worry about after downloading the StepN app to my phone is getting the sneaker. Boy, was I wrong. After the app is loaded on my phone, I am asked to register with an email address, which is somewhat standard. Then a sign-in code is sent to the email address that needs to be entered into the app. So far so good. The next screen that comes up requires an activation code, which can only be obtained through either an existing user or the Discord channel. Here is where I had my hair-tearing moment that lasted for a few days. I didn’t know anyone initially who has the app, so the first option was out. I joined the Discord server and saw a channel just for activation codes. They have quite a strict policy about it, which you can see below:  Well, getting an activation code is nigh on impossible for me. Here’s what happened: I saw a code posted on the channel, I had to log-in with the email address and wait for the sign-in code first before I could enter the activation code. By the time I entered the code, it’s already been used. Even if I were to glue my eyes to the channel for a code to drop, I’d also have to keep refreshing the app and logging in again and again just so that the activation page can stay current for me to use the code. It was definitely a very frustrating experience. At the time of writing, I noticed that there is a new channel for getting activation codes organised by the team. There’s a bot giving away 10 activation codes every 15 minutes. Glad to see a decent improvement to a very selective system of onboarding people. Meanwhile, there are also bots scraping the channel for codes. So I’d say, try at your own risk. Getting desperate, I asked around in friend circles and finally got one. Shoutout to  for providing me with an activation code.  As you saw in the image above, you can only start earning crypto if you have a NFT sneaker. Else, the app works as a not-fancy-version of your FitBit / GoogleFit / AppleWatch. In the two weeks since I’ve gotten the app, I’ve seen the floor price for the NFT sneaker go up from 12 SOL to 14 SOL. Given that the SOL token has gone from a low 3-digit to about $75 at the time of writing, the sneaker is still worth around 1k. However, which kind of sneaker to get? Well, let’s look at the breakdown of a sneaker. First is sneaker categories: Walker, Jogger, Runner and Trainer. Despite the fact that each type of sneaker gives you a different earning rate, the price of the sneakers are based more on the attributes than their earning capabilities. This means that the floor price of a Runner can be the same as a Walker. Pick the right sneaker for the activity you do the most of Image via StepN Like any NFT, the sneaker also has attributes. The four main attributes for the sneaker are: efficiency, luck, comfort, and resilience. Each of them come with related enhancements. Decide which factor is a priority for you to help you pick the sneaker that works best for you Image via StepN In addition to the sneakers, which are known assets, there are also Shoeboxes, ie mystery boxes containing a sneaker with no known attributes. These go for much more than the sneaker NFT itself because it’s banking on the uncertainty. In this case, it’s basically a gamble. If you get one of them and you open the box, you could end up with a rare sneaker or a basic one. Floor prices for Shoeboxes start at around 18.5 SOL for a common one and upwards to 2000+ SOL for a rare one. At this point, once you have the sneaker you want, you can now tie the laces of your real sneakers and get moving to start earning tokens. Each sneaker gets you 2 energy, which is about 10 mins of actual exercise time. Once your energy is used up, you stop earning. The more sneakers you have, the more energy you get. Currently, the app features the Solo Mode. This is where you run/walk/jog and get GST tokens. Watch out for your GPS signal. If it’s a weak one, you might find yourself in the Moonwalking mode. This is an anti-cheat mechanism in place so that people won’t be able to earn tokens by being on a scooter or letting the dog do the walking for you, for instance. You’re also encouraged to move within the range stipulated with your sneaker. For example, with Runner mode, you need to do between 8 – 20km/h. A pace out of this range will not get you the maximum GST you can earn. You can also get a Mystery Box when you are in Solo mode. This is a random airdrop and it costs a bit of GST to open the box, which also takes time. The box contains Gems that are used to level-up your sneaker. These Gems come in various levels and you’ll have to watch out for the low-level Gems that may not work as intended. The other modes being developed include Marathon mode and Background mode. The former is a chance to pit yourself against other runners and have a crack at the leaderboard. There are weekly and monthly marathons planned. The latter allows you to earn GST tokens even when you’re not moving. This is possible by linking the app to the mobile app’s Health data to count your steps, capped at 3000 daily. The app comes with its own wallet which is used for holding GST, GMT and SOL tokens. There is also a distinction between a Spending account and the Wallet account. Think of it like your checking and savings account. You have the option of creating a new wallet or importing one using the seed phrase. The token first listed for trading at a price of $0.48, which is also its all-time low. Since then, its astronomical rise to an all-time high of almost $10 has elicited much buoyancy amongst its fans. The bag-pumping sentiment, on full display in the Discord server, has remained strong despite its fall to a current price of $2.28 at the time of writing. I find it slightly unusual that an in-game currency gets listed for trading. The fact that these tokens, which can be earned for free, in a way, manages to maintain the price level it has so far, is a testament to the changing nature of in-game currency and how crypto has really opened new possibilities for everyone. Players can actually ignore the exercise / grinding portion and simply buy a sneaker, buy GST to level the sneakers up and sell it to the next willing buyer. 6 billion GMTs were minted on March 9, 2022 to raise funding for the project. The token distribution pattern is as below: GMT is earned through grinding, ie exercising with a sneaker that’s above level 30. However, you would need a minimum of 3 Energy to be eligible. The token is also subject to a halving mechanism that will see the number of tokens earned to be halved every three years. In addition, GMT is also the governance token of the two. Coupled together with the upcoming functionality to allow for GMT to be staked, the longer the staking period, the more voting power you have. This is another way to incentivise holders to not sell. GMT is also burnt in various ways, making it deflationary Image via StepN Similar to the GST’s trajectory, GMT debuted at around $0.1 two months ago in March and rose to great heights, peaking at $4.11 in late April. It, like everything else, succumbed to the recent downward market pressure, currently trading at less than $1, according to CoinGecko. It’s interesting to note, that of the two tokens, GST has managed to retain its value better than GMT. The app is developed by Find Satoshi Lab, based in Adelaide, Australia. Key team members are also Australian-based but the overall staff distribution is fairly universal. One of the co-founders, , graduated from Zhejiang University in China with a Bachelor’s degree in Computer Science in 2008. No blockchain experience in sight but there is mention of experience in Human Resources, Board of Directors and Game Design. The other co-founder, , has a firmer foot in Australia and is more involved in both the Australian and  blockchain scene than his partner. The involvement is usually more of a business and operational capacity. He is also the Business Ambassador for . is the only female featured in the StepN Team page. She is the Chief Strategy Officer for the project. Her resume is also a bit thin too. A graduate of the University of Adelaide with a Master’s in Architecture back in 2010, StepN is almost her first proper corporate job, according to her LinkedIn profile. The key members of the StepN team Image via StepN The team raised about $5 million in seed money from some well-known crypto venture backers such as Sequoia Capital, Alameda Research and Solana Capital. It’s pretty impressive given that the team in general don’t have too much experience in the crypto space and quite flimsy resumes, to be honest. However, given the amount of innovation going on in the space and the availability of capital floating around, having a solid concept is worth something.  Aside from the ability to stake GMT and new game modes as mentioned above, a highly-anticipated feature coming up is sneaker rental. Currently, the only way to earn is to buy a NFT sneaker. Even with the depressed market sending the price of SOL to lows not seen since August 2021, it still costs a few hundred dollars for a sneaker, more than what most people would pay for an actual pair. One of the missions for StepN is to get millions moving with the app with zero entry barrier. I wouldn’t say that is likely, given that you’d still have to pay something to rent the sneaker. However, the cost could be considerably lower and more affordable to the majority. Aside from the rental feature, badges will also be making an appearance sometime this year. These are awarded for completed tasks. The harder the task, the rarer the badge. Not only do you get bragging rights, you can also get other perks such as extra energy in Solo Mode, or lower minting cost for sneakers etc. A preview of the goodies to come  Image via StepN One of the risks of the project is the mere fact that it’s on Solana. Since late last year, Solana network outages has been happening in gradual increasing frequency. In a way, it’s a victim of its own success, much like Ethereum is with the gas fees. Outages on Solana affects all dApps in its ecosystem, which will naturally include StepN. There were announcements in the Discord server letting users know that their assets may not appear in the wallet, or transacting during a Solana outage might cause a delay in funds arriving etc. While this is something that is not in the Solana team’s control, it will nevertheless affect the user experience. Therefore, they have also taken steps to branch themselves out to other blockchains. The next candidate is the Binance Smart Chain. There have been a few teething problems in the beginning so let’s hope things get smoothed out further down the road. The other point that leaves me slightly concerned is the lack of a CTO in the leadership team, especially since the current team members themselves don’t appear to have any solid blockchain development experience. It may not be a big deal but I think it’s worth noting. What makes StepN such a popular app, isn’t just that it’s got first dibs on the Move2Earn trend. The app’s gaming elements are quite strong, offering the possibility of multiple strategies for users to get their kicks out of it. You can choose to best yourself in Solo mode based on your own metrics, beat others in upcoming leaderboard challenges, or have fun analysing what sneakers to get to reap the maximum benefit. They take the term “earn” to the max by offering two ways to do so. You can grind away by putting in the hard yards and get GST tokens. If foot-to-pavement is not your style, just take the NFT-flipping route without having to run a single step and you’d still be able to earn money. It succeeded in appealing to  a wide audience, allowing them to participate in different ways and get their own joy out of it. I wouldn’t go whole hog, Axie Infinity-style, and see it as a way to secure a steady income. However, given the low price of SOL now, it could be worth giving it a shot.",
        "metadata": {
            "source": "coinbureau",
            "readtime": "14 min read",
            "category": "Review"
        }
    },
    {
        "postid": 6,
        "date": "May 12, 2022",
        "title": "Europe’s Largest Economy Announces Tax Break For Bitcoin and Ethereum",
        "url": "https://www.coinbureau.com/news/europes-largest-economy-announces-tax-break-for-bitcoin-and-ethereum/",
        "article": " Germany has decided on a drastic tax break for crypto investors in new  posted by the country’s federal finance ministry (BMF). The BMF released a document Wednesday morning regarding the treatment of income  and other blockchain-related tokens. The 24-page document covers a wide range of topics like the different types of mining, airdrops, staking, and more. What pops out the most though is an update to tax laws that will make Germany one of the most  on earth, at least for long term investors. While the country previously gave tax-free status to all crypto assets that were held for more than 10 years, the new update tweaks that rule to just one year. The BMF’s guidance also clarifies that crypto assets that have been lent out or used by a third party for staking during the one year window will also qualify for tax-free selling. Image via Shutterstock While ruling out the older 10-year rule, Parliamentary State Secretary Katja Hessel said in a statement that the government’s stance on crypto tax was fluid, and that the state was already working on the release of a secondary guidance document. “Of course, the publication of the guidance is not the end of our engagement with the topic, but an interim result,” said Hessel. “The rapid development of the ‘crypto world’ ensures that we do not run out of topics.” Germany will join a list of other countries sought after by crypto investors for their lax taxes, including The Cayman Islands, El Salvador, Malaysia, Malta, Switzerland, and of course, Portugal, where there are no crypto taxes regardless of how long the assets are held. Last month, Germany was deemed as “the most crypto-friendly” country in the world in a report from cryptocurrency insights firm CoinClub. “Germany’s number of Bitcoin nodes is second only to the USA, and its policy towards crypto taxation is progressive even when compared to other leading economies,” . “Germany’s rise to the top is fueled by its unique institutional stance on crypto as a long-term investment for savers, something which most countries have yet to imitate.” ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "2 min read",
            "category": "News"
        }
    },
    {
        "postid": 7,
        "date": "May 12, 2022",
        "title": "The Plan for Terra’s ‘Return to Form’ After Big Collapse, According to Do Kwon",
        "url": "https://www.coinbureau.com/news/the-plan-for-terras-return-to-form-after-big-collapse-according-to-do-kwon/",
        "article": " Following what may go down as the most dramatic crypto catastrophe of all time, Terra Labs founder Do Kwon has laid out the beginnings of a plan for the  ecosystem to recover. Earlier this week, TerraUSD (UST) began to  as sell pressure exceeded what the system’s mint and burning mechanism could keep up with. Since investors can redeem 1 UST for $1 worth of LUNA, problems arise when UST is well under its dollar peg, mainly that traders can buy UST for say $0.70, then redeem for $1 worth of LUNA, and then sell their new LUNA coins for the difference. The arbitrage and sell pressure from panicked investors effectively pushed the price of LUNA to zero on Wednesday, shaving off tens of billions of dollars of market cap within hours. LUNA went as low as $0.70 before a wild 1000% rebound, likely stemming from short covering, then collapsed again, currently sitting at $1.69 while UST is currently 32 cents off its dollar peg at $0.68. Writing in a lengthy , Do Kwon said that he fully intends on the Terra community doing a complete rebuild back to where it was. “Before anything else, the only path forward will be to absorb the stablecoin supply that wants to exit before $UST can start to repeg. There is no way around it,” he said. Kwon said he endorses Terra community , which suggests increasing the basepool from 50M to 100M SDR, or in other words, raising the system’s minting capacity from $293 million to $1.2 billion. Some have referred to this as “Kwontitative easing.” This change would effectively allow UST to be absorbed quicker, according to Kwon. Even though more sell pressure on LUNA is to be expected in the near term, the proposal assumes that eventually, LUNA and the mint and burn mechanism would stabilize. “With the current on-chain spread, peg pressure, and UST burn rate, the supply overhang of UST (i.e., bad debt) should continue to decrease until parity is reached and spreads begin healing,” he said. “Naturally, this is at a high cost to UST and LUNA holders, but we will continue to explore various options to bring in more exogenous capital to the ecosystem & reduce supply overhang on UST.” Image via Shutterstock While no official explanation of what caused the events have been given, a consensus is forming that it was a coordinated attack, rather than an unfortunate bug in the system. Pseudonymous DeFi expert Onchain Wizard suggested in a  that an entity orchestrated the entire thing by borrowing 100,000 BTC, selling it to the Luna Foundation Guard (LFG) to effectively create a short position, and then simultaneously dump large amounts of UST. The overwhelming sell pressure on UST would in turn force LFG to sell off its BTC reserves in order to defend the peg, putting downward pressure on BTC before yet another massive UST dump. “So you have a ~$4.2bn short position built. Over the same time, the attacker builds a $1bn OTC position in $UST. The stage is now set to create a run on the bank and get paid on your BTC short. In anticipation of the 4pool, LFG initially removes $150mm from 3pool liquidity. But this only starts the de-pegging. LFG begins selling $BTC to defend the peg, causing downward pressure on BTC while the run on $UST was just getting started.” As Onchain Wizard says, LFG may have been desperately selling off BTC to restore the peg while the attacker would have been selling all its UST on Binance, causing the exchanges to suspend withdrawals of UST and fueling more bank run panic. Different variations of this scenario have gone around and there may never be an exact explanation, but regulators are already using the episode to discredit decentralized stablecoins and call for government-backed central bank digital currencies (CBDCs). Yesterday when the Terra situation kicked off, Treasury Secretary Janet Yellen  it in a hearing, saying: “A stablecoin known as TerraUSD experienced a run and decline in value. I think that this simply illustrates that this is a rapidly growing product and there are rapidly growing risks.” Yellen added that she thinks it would be” ​​very appropriate” to pass regulation, preferably by the end of this year. ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "4 min read",
            "category": "News"
        }
    },
    {
        "postid": 8,
        "date": "May 11, 2022",
        "title": "Yield Guild Games Southeast Asia (YGG SEA) Review- YGG’s First Regional SubDAO",
        "url": "https://www.coinbureau.com/review/yield-guild-games-southeast-asia-subdao/",
        "article": " At the Coin Bureau, we love great crypto projects and cannot get enough of them. As someone who eats, sleeps and breathes crypto, I often think that I’ve just about seen it all in this crazy crypto world, but then a project comes along from time to time that really excites the team and me. Just like our readers, we too have our favourite projects that we follow quite closely. Blockchain gaming, specifically gaming guilds, is one of those niches that pique our interest. We’ve covered Yield Guild Games in the past as a project that we are bullish on; you can find out more about that in our . In addition, there has been an interesting expansion and addition to the YGG ecosystem in the form of setting up a regional subDAO in Southeast Asia, which is what we will be covering here today. This article will cover a bit about YGG and their decision to expand, what this means for YGG, and go over the nuts and bolts of what you need to know about Yield Guild Games Southeast Asia (YGG SEA). If you are coming across gaming guilds for the first time, be sure to check out Guy’s video on why Crypto Gaming Guilds might be Disclaimer: The Coin Bureau has participated in YGG’s SEA strategic fundraising round.  Page Contents 👉 [] Yield Guild Games is the biggest gaming guild in the blockchain gaming world, focused on blockchain  (P2E) games. It is a community that invests in NFT assets needed for participation in games and lends them out to those unable to or who do not want to purchase the NFTs themselves that are required to unlock gaming worlds and features. YGG connects blockchain gamers and investors around the world. Their goal is to build a network of players and investors who can help each other get started and thrive in the NFT gaming space, providing a mutually beneficial relationship for all participants. Following the success of their global launch and meteoric rise in adoption and popularity, they decided to focus on the expansion and operations into Southeast Asia in November 2021. Since then, they have launched locations in Vietnam, Malaysia, Thailand, and Indonesia, forming the Southeast Asia (SEA) subDAO. YGG’s Announcement of YGG SEA Image via This new venture is part of YGG’s goal of creating an extensive and sustainable Play-to-Earn economy focused on Southeast Asia; YGG SEA is the first regional subDAO of YGG with more planned to roll out. YGG SEA’s mission is to invest locally and grow locally within the Southeast Asian community, building on the amazing work done by YGG in previous P2E markets in countries like the Philippines. A Look at the Different SubDAOs of YGG Image via YGG’s Medium The YGG SEA DAO is a guild “for the people, by the people,” located in the region. YGG SEA is participating in over 30 games, including popular blockchain games , Starsharks, Wasted Lands, Wonderhero and more. Here is a look at YGG SEA’s current Game Partners: YGG SEA Game Partners Image via YGG SEA’s Medium Some pretty exciting looking titles, for sure. The team will undoubtedly be expanding this lineup in the future as well. As a subDAO, YGG SEA will be specialized and localized in the Southeast Asian economy that forms part of the larger YGG economy. The subDAO has the ability for the community to grow their stake in the YGG DAO over time, giving members the chance to run an organization within an organization. The YGG SEA SubDAO is in complete control of its operations in terms of engaging with games and acquiring NFTs to suit the local community while remaining an active contributor to YGG and participating in the YGG community. Blockchain gaming has become a massive phenomenon that has made a huge impact across the crypto, NFT, and gaming sectors and had a mountainous influence on the broader economic global landscape. If you want to learn more about just how big of an impact, I explore this topic further and crunch some numbers in my article about the  if you would like to dive deeper. Here is a look at how P2E gaming dominance looks by country on a global scale according to : Image via DappRadar YGG SEA aims to broaden access and provide localized support throughout SEA. As the region is quickly developing and showing a keen interest in technology and gaming, it is the ideal market that is on the doorstep of entering the metaverse in a major way. YGG SEA wants to ensure that blockchain gaming opportunities are open to all participants, regardless of income, status, location, or background. There are already over 166,000 badge holders in YGG SEA’s community, including more than 4400 scholars, who have shared in nearly 70% of the revenue to date. The barrier to entry for blockchain and Play-to-Earn games can be quite steep, with the initial  needed to get started often costing hundreds or thousands of dollars. As a result, many interested gamers do not have the means to get involved, and more casual gamers may not be willing to put up the capital. Through YGG and their YGG SEA subDAO, players can rent the gaming NFTs they need to unlock games and features and keep a portion of their in-game winnings. At the same time, the DAO also receives a percentage for the lent out NFT asset, benefiting both investors and players. Here are some of the services and features of the gaming guild. Southeast Asia is home to over 700 million people ready to be onboarded into the metaverse. Blockchain gaming has become massively popular in Southeast Asia. The region is known for its lack of employment opportunities and often low wages. Play-to-Earn games have become widely adopted by many, as people realize that they can earn a better income through P2E games than in the local job market. The Southeast Asian nations are classified as lower to middle income. As such, most nations have sufficient infrastructure to ensure a high level of internet availability. At the same time, much of the population remains unbanked. The Southeast Asia Opportunity Image via Southeast Asia is a leader in P2E adoption. YGG SEA believes that combining their platform solutions will allow them to optimize access by working with those who have a deep understanding of the home market’s growth ability and economy. Having local insight and experience is key to capturing first-mover advantage in the region while building something sustainable and suitable for the area. There is potentially unlimited upside for the millions of lives that can be impacted by this growing movement. The Southeast Asia Opportunity Continued Image via YGG SEA Whitepaper It is well known that Southeast Asia is one of the fastest-growing markets for blockchain adoption. As a result, play-to-Earn gaming has become the onboarding mechanism of choice for many emerging nations. The P2E gaming industry has grown to over $40 billion during the pandemic, partially due to massive populations in SEA seeking a form of income in non-traditional ways. According to an  from DappRadar, P2E gaming is one of the most searched and discussed topics in Asia, growing 33% month over month while reaching 1.7 million mentions across Asian media outlets.  Image via In fact, six out of the top ten countries driving P2E traffic come from Asia, with four from Southeast Asia specifically. Image via Dappradar That’s a pretty telling trend, no doubt. One thing I find interesting about crypto trends is that they seem to span across countries and communities, seemingly independent of status or background. For example, what do Portugal’s Madeira, the Central African Republic, and El Salvador have in common? Not much other than they all adopted Bitcoin as legal tender. Looking at the trend above, I cannot think of any metric outside of crypto where Indonesia holds the number one spot and the United States has the number two spot. Look at how the UK and Vietnam are side-by-side; I love it. Crypto is for everyone, and the more these trends play out with signs of global inclusivity, the better. The YGG model has seen incredible success and growth in the Philippines, positively impacting the lives of millions of gamers. YGG SEA aims to expand on that success and bring those life-changing opportunities to the Southeast Asian region. The SEA region has enormous potential. The way YGG SEA is going to tap into this market is by investing locally and growing locally within the community. YGG SEA has a dedicated team in place, including executives, country managers, and community teams who have experience in each of the key markets, which are Malaysia, Indonesia, Vietnam, Thailand, and Singapore. Here is a look at global blockchain traffic in 2021 according to : Image via DappRadar It is pretty interesting to see that the traffic from the Southeast Asian region is on par with those countries around the world with higher populations. YGG SEA will achieve localization to further the growth of the P2E scholarship model in 3 key ways: Southeast Asia is defined as 11 countries as per ASEAN: Brunei, Cambodia, Indonesia, Laos, Malaysia, Myanmar, Philippines, Singapore, Timor Leste, Thailand, and Vietnam. The region is home to over 700 million people, speaking 11 recognized languages within the defined region and up to 700 local languages with at least 12 religions. The median age is 30.2 years old, and the nominal GDP per capita is an average of $4,849 per year, with Cambodia coming in as low as $1,720 per year. According to the Asian Development Bank, the region has forecasted growth of 3.1% in 2022. 9.5% of the population lives below the UN’s official poverty line of $1.90 per day. Timor and Laos have the highest incidences with 21.03% and 9.35%, respectively. The age group taking the highest level of interest in blockchain globally are users between 25-34, followed closely by under 25’s and a surprisingly steep drop off for over 35. Image via DappRadar With regards to crypto and gaming: Thailand and Malaysia have the second and third largest percentage of internet users who own NFTs after the Philippines, at 27% and 24%, respectively. According to a  from Coursera, both Thailand and Indonesia rank higher than the Philippines in terms of technological skills, showing that there is still massive potential to further blockchain gaming and Web3 activity in the region. YGG SEA has a symbiotic relationship with YGG, which is one of their key competitive advantages. With YGG SEA forming stronger local partnerships, increasing local user acquisition, and deploying retention strategies, YGG SEA will contribute to the broader YGG ecosystem as its presence grows. Image via This will place both YGG and YGG SEA in a stronger position in the industry while optimizing asset allocation and rewards for scholars, providing on and off-ramp support to help users convert crypto to fiat more efficiently, and providing greater regulatory representation. The participation and support from the YGG community is essential to the expansion of the DAO. YGG SEA is going to incentivize community participation with specially designed reward structures. Those who act early will be eligible for special Legendary buffs that will only be available to obtain after the SEA token launch on Copper. Legendary buffs will have long-term value for the owner by giving them access to the full range of games that YGG SEA partners with as long as they maintain their status. The long-term reward structure for YGG SEA is divided into Community Rewards and Liquidity Rewards. This dual rewards system allows for the incentivization of greater community participation while also rewarding liquidity providers. There will also, of course, be staking rewards for SEA token holders. Image via YGG SEA medium 25% of SEA tokens have been reserved for Community Rewards, which will drive guild growth. This will reward users who join the YGG SEA guilds and guilds for onboarding new members. Aside from onboarding, upskilling players who deepen their engagement with YGG SEA will also be rewarded if they participate in things like gaming tournaments and events. YGG SEA players will also be incentivized with rewards to try new games and become early participants. Lastly, participation in the DAO will be encouraged through activities like bounty programs and rewards schemes for active participation in the DAO 10% of the total YGG SEA token allocation will be reserved for Liquidity Rewards. This will incentivize the community to perform yield-farming within the ecosystem. The YGG SEA team has specifically formulated a range of rewards to ensure contributors at all levels will receive benefits from participating in the launch. YGG SEA is offering rewards for users participating in single-sided staking and for users who provide liquidity on . A YGG SEA staking interface will be created for users to claim the rewards. Whether users choose single-sided staking or staking Uniswap LP tokens, the YGG SEA staking interface allows users to stake the tokens through either flexible or locked options. A Look at the YGG SEA Staking Platform Image via YGG SEA Medium Apart from earning staking rewards in YGG SEA tokens, there will be additional benefits from their Play-to-Earn gaming partners. When users stake SEA tokens, users will not just earn SEA tokens but will also earn a basket of other Play-to-Earn tokens, diversifying the rewards that the community can benefit from while providing additional exposure to the space. The SEA token allocation of 1 billion has been designed to balance community involvement, upfront development requirements, and the long-term stability of the DAO. As the governance token of YGG SEA, $SEA gives community members the right to vote on governance proposals, ecosystem rewards allocations and desired features and reward models, as well as whitelist opportunities for NFTs. The breakdown of token distribution is as follows: Image via YGG SEA The token distribution looks quite healthy with the majority of the funds going to the community, treasury, public, and held for rewards. The healthy distribution and enforcement of a strict vesting schedule for early investors will help ensure the SEA token is unlikely to experience sudden and intense sell pressure and should assist in helping the SEA token achieve price appreciation over time. The total allocation of 1 billion SEA tokens will enter into circulation over a 6-year period. It is important to note that the final token distribution schedule of community rewards may be altered by vote of the DAO. Here is a look at the YGG SEA token release lifecycle: Image via YGG SEA YGG SEA has announced the initial DEX Offering (IDO) of its $SEA token will begin on May 9th, 2022, at 11 am EST and it will run until May 14th on the . The IDO will offer community members the opportunity to stake a total of 75 million tokens, representing 7.5% of the total supply of one billion tokens. The starting price is set at $0.50. The Token Launch Auction (TLA) on Copper allows for real-time price discovery, open and permission-less participation and fair distribution of tokens. YGG SEA Co-founder Irene Umar had this to say about the Token Launch: “The IDO is a once-in-a-lifetime opportunity to appreciate our community’s unconditional support. We are where we are because of the community and we would like the community to own a piece of YGG SEA through the IDO. DYOR, all I can say: what you see today is just the beginning of what will unfold in the coming months.” Here are the key details for the launch: What you need to participate: You can find the full token launch details and “how-to” guide on the  page. After the token launch auction, look for the SEA token on . The YGG SEA core team is made up of industry veterans with gaming, crypto, economics and traditional financial backgrounds who are on a mission to foster crypto inclusivity in the SEA region. Image via medium/ CEO – Evan Spytma Evan is a veteran in the video game industry, enjoying a career that spanned over 20 years and held top executive positions within Unity Technologies, Electronic Arts, and PopCap games. He is the mastermind behind driving key strategy components and pushing the industry in Southeast Asia to ensure further success. Co-Founder and Indonesia Country Manager – Irene Umar Irene started her career in corporate finance and banking, working in Indonesia, UAE, India, and Singapore. Irene left corporate finance in 2016 to jump into the world of gaming when she started the first gaming VC in the region, focused on investing in companies within the gaming ecosystem in Southeast Asia and beyond. Head of Investments – Dan Wang Dan graduated from Princeton University with a degree in economics, which likely means he is one smart cookie. Princeton University acceptance is no small feat, and have you ever tried to read an economics textbook? To me, it makes about as much sense as trying to eat soup with a fork. Dan is also an angel investor with a focus on sustainability and entertainment and is a venture partner at Infinity Ventures Crypto (IVC). Dan has held international leadership roles in the Finance and Tech industries before getting into gaming in 2013. He joined Riot Games and first led international publishing, then infrastructure and global expansion teams before heading up operations. You can find out more information about the team from Thanks to their relationship with gaming guild giant YGG, there is no shortage of backers and supporters for YGG SEA. Since forming in November of 2020, YGG has secured support from the likes of Delphi Digital, Bitkraft, and 16z, making YGG one of the first Asian investments in the latest Andreessen Horowitz Crypto fund. Then of course there are also the likes of Animoca Brands, Crypto.com, Poloniex, Polygon, and OKX Blockchain Ventures to name a few. Here is a look at the all-star line-up of some of the investors behind the project: Image via YGG SEA Yup, a lot of big names and backers behind this expansion project. With the success of the initial YGG, it is easy to understand why. Yield Guild Games have created a phenomenon in the Play-to-Earn gaming space and have opened up opportunities for global participation in NFT and blockchain gaming that otherwise would not have been accessible to millions of players worldwide. I don’t know if anyone was truly prepared for, or expected the sudden and massive growth experienced by YGG in such a short amount of time; it is truly awe-inspiring to see how the team has evolved and what they have accomplished. As YGG has become a massive global entity, I feel like the creation of a regional subDAO like YGG SEA was a brilliant move that just makes sense as it will provide local and specialized experience that can only be achieved by those with in-depth local experience. There is an interesting history if you want to check it out about the colossal failure of the first Starbucks coffee shop that attempted to open in China in 1999. The critical failure on their part was not doing their research and understanding the traditions, wants, and needs of the local demographic. The Starbucks corporation had assumed that just because Starbucks was loved by many in the west, that it would be welcomed with open arms in the Chinese market. Image via Instead of deploying a local team or seeking advisory services to understand the local market in more depth, their assumptions and likely overconfidence led to the brand’s initial failure and financial losses for the first 9 years of operations in the region. Many investors felt that hiring an American manager to manage Chinese operations was probably the first mistake, and it was noted after the failure that most of the local population had no idea what a cappuccino was, and most of the locals had preferred tea for hundreds of years. What YGG is doing by creating a local subDAO makes the organization more manageable as a whole, and is allowing flexibility and an understanding in the local area, not making the same mistake as Starbucks who tried to pound a square peg into a round hole. Not only is this better for the organization, but the local Southeast Asian population of users as now there is an opportunity for the DAO to create storylines, games, and provide rewards that are desired by the people in that area.  We all like to interact with things that we are familiar with, look no further than simple video game sales themselves. FIFA video games are massive sellers in Europe, but not many North Americans play video games about Football (Soccer), conversely, NFL and Ice Hockey games sell well in North America but sell very poorly in Asian countries. Providing an opportunity to locally manage a DAO, network with local businesses and entrepreneurs, and build a community by locals, for locals, while separating operations to manageable levels, will help ensure a better experience and likely a higher level of success for everyone involved. I am very eager to follow closely and see how else YGG is going to expand their global presence. Solid Team Proven Successful Track Record Scalable and Sustainable project Slight barrier to entry No major exchange support as of yet",
        "metadata": {
            "source": "coinbureau",
            "readtime": "23 min read",
            "category": "AdoptionReview"
        }
    },
    {
        "postid": 9,
        "date": "May 11, 2022",
        "title": "Crypto Exchange KuCoin Valued at $10 Billion In Latest Capital Raise",
        "url": "https://www.coinbureau.com/news/crypto-exchange-kucoin-valued-at-10-billion-in-latest-capital-raise/",
        "article": " Seychelles-based crypto exchange KuCoin has reached a  in its latest fundraise, led by industry titan Jump Trading. Besides Jump, the funding round was joined by IDG Capital, Matrix Partners, and stablecoin giant Circle Ventures. Already known for having a big selection filled with “,” KuCoin CEO Johnny Lyu said that the exchange plans to use the funding to expand its portfolio of crypto wallets, GameFi, DeFi, NFTs, and DAOs. “As you can see, KuCoin, as the home of hidden gems, not only keeps track of real-time hot sectors in the industry but also deeply researches potential projects in various sectors all the way, even if it is a small or mid-cap token at a certain stage,” he said. “For example, we have listed many new projects in the world premiere way no matter through the normal listing or KuCoin Spotlight, KuCoin BurningDrop, in which many projects are turned out to be very high-quality and potential after a period of development. The premise of guaranteeing its huge potential and quality is that we have professional, all-around, and strict related processes.” Image via Shutterstock Lyu said that while demand for centralized crypto services has risen in recent years, the exchange still wants to put focus on accommodating users who prefer decentralized exchanges () and other decentralized services, he goes on to say: “We noticed that some users would prefer to use DEX because it can be directly integrated with the wider crypto native ecosystem. Actually, we are exploring and developing decentralized products like the NFT marketplace – Windvane. In addition, KCC, jointly built by members of the KuCoin community and KCS fans, will also be an important aspect for KuCoin to build a decentralized ecosystem, with DEX and other protocols such as lending and stablecoins are building on it. We also have a P2P service for users who wish to convert fiat currencies to digital assets with the lowest fees and a high level of security” According to CoinMarketCap, KuCoin is the fifth biggest crypto exchange in the world in terms of 24-hour volume in USD ($4.07 billion). It has 686 cryptocurrencies currently listed. For comparison, Coinbase has 175 and Binance has 395. The Coin Bureau has an in-depth  if you would like to learn more about the exchange features and services. ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "2 min read",
            "category": "News"
        }
    },
    {
        "postid": 10,
        "date": "May 11, 2022",
        "title": "US Treasury Secretary Janet Yellen Urges for Stablecoin Regulation Following UST Debacle",
        "url": "https://www.coinbureau.com/news/us-treasury-secretary-janet-yellen-urges-for-stablecoin-regulation-following-ust-debacle/",
        "article": " US Treasury Secretary Janet Yellen has used the TerraUSD (UST) debacle to call for more  regulation in a recent speech. “A stablecoin known as TerraUSD experienced a run and decline in value. I think that this simply illustrates that this is a rapidly growing product and there are rapidly growing risks.” On Monday, Terra’s UST stablecoin lost its peg to the US dollar following a dramatic market correction and a loss of its collateral. Yellen  that she thinks it would be” ​​very appropriate” to pass regulation, preferably by the end of this year. Last month, the former Fed chair made similar statements regarding stablecoins in  on digital assets. “Already, the Treasury has worked with the President’s Working Group on Financial Markets, the FDIC, and OCC to study stablecoins, a type of cryptocurrency pegged to a stable source of value, often the US dollar,” Yellen said. Image via Shutterstock “Stablecoins raise policy concerns, including those related to illicit finance, user protection, and systemic risk. And, they are currently subject to inconsistent and fragmented oversight. To peg their stablecoin to a dollar, most issuers say they back their coins with traditional assets that are safe and liquid. This way, whenever you want to trade your stablecoin back into a dollar, the company has the money to make the exchange. But, right now, no one can assure you that will happen. In times of stress, this uncertainty could lead to a run.” Like other federal officials in the US, Yellen wants central bank digital currencies () to act as the safer alternative to privately issued stablecoins. In the same remarks, Yellen said part of President Biden’s recent executive order on digital assets calls for an examination of how CBDCs might connect or interact with stabecoins. “How might a US CBDC interact with existing national currencies, foreign CBDCs or private stablecoins?” she asked, adding “We need to consider these important questions in the context of the central role the dollar plays in the world economy.” Yellen said the Treasury plans on releasing a “comprehensive report” on cryptocurrencies and stablecoins shortly, as part of a request from the President’s Working Group on Financial Markets (PWG). ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "2 min read",
            "category": "News"
        }
    },
    {
        "postid": 11,
        "date": "May 10, 2022",
        "title": "Sudden Surge In Crypto Funds Looking to Invest In DASH: Report",
        "url": "https://www.coinbureau.com/news/sudden-surge-in-crypto-funds-looking-to-invest-in-dash-report/",
        "article": " New research suggests a sudden surge in crypto investment firms taking an interest in payments and privacy-focused altcoin . A  from Cointelegraph Research found that out of 200 crypto funds surveyed, 19 funds hold , and over 40 funds plan to invest in Dash in the next 12 months. The 19 funds that hold Dash include Digital Capital Management, Liquibit Limited, BN Capital, Postera Capital, Blockwall Capital, Hilbert Capital, Smart Block Laboratory, Asymmetry Asset Management, Resilience AG, Pecun.io, All Blue Capital, INDX Capital, EZCAMG, Plutus21Capital, How2Ventures, Block Ventures, Parallax Digital, and Bohr Arbitrage Crypto Fund. According to the report, the funds holding Dash all gave similar answers as to why. “The Dash community is actively trying to become a medium of exchange. Real-world use drives organic demand for the asset as opposed to only speculative demand associated with many other cryptocurrencies. As one respondent succinctly stated, ‘Bitcoin is digital gold and Dash is digital cash.’” Cointelegraph Research The report also notes that Dash is held in many trusts, including the Valkyrie Dash Trust, which aims to get an annual yield of ​​2.5%–4% via staking. “Dash is a well-known, respected name in the payments space in many areas of the world, and has an engaged, loyal following,”  Valkyrie Investments CEO Leah Wald. “One of our goals at Valkyrie is to enable those underserved by traditional financial firms to have access to financial services, and expanding investment into the Dash ecosystem is part of that mission.” The researchers highlight the need for a high-throughput, fast, low-cost system as blockchains scale higher, and this is something institutions may have their eye on as well, even if the timing is still unclear. “As more people adopt cryptocurrencies, more transactions need to be processed per second,” they said, adding “More traffic on a blockchain network often leads to increased transaction fees. The 2017 bull market increased on-chain transaction volume and led to an increase in transaction fees in Bitcoin and Ethereum.” DASH, which outperformed BTC in 2021 by about 10%, was created in 2014 to focus on the “digital cash” aspect of the Bitcoin whitepaper. It features InstantSend, which lets users transfer DASH without waiting for the transaction to be confirmed on the Dash blockchain by sending the crypto to “Masternodes” that lock the funds before recording them in the next block. Dash’s PrivateSend allows users to send transactions with a built-in mixer that can obfuscate the transaction without the need for a traditional mixer like Tornado or Blender. Over the last few years, Dash has faded a bit into the “legacy coin” category, but the latest research could suggest a potential trend change. ",
        "metadata": {
            "source": "coinbureau",
            "readtime": "3 min read",
            "category": "News"
        }
    }
]