[
    {
        "postid": 0,
        "date": "2 hours ago",
        "title": "The Next Luna And UST? Crypto Market Now Braced For Another Earthquake After Bitcoin, Ethereum, BNB, XRP, Solana, Cardano, Avalanche And Polkadot Price Crash",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/16/the-next-luna-and-ust-crypto-market-now-braced-for-another-earthquake-after-bitcoin-ethereum-bnb-xrp-solana-cardano-avalanche-and-polkadot-price-crash/",
        "article": " Bitcoin     , ethereum and cryptocurrency prices have been left reeling from the collapse of the terraUSD (UST) stablecoin and its support coin luna this week—.  The bitcoin price has crashed 25% over the last month, dragging down other major cryptocurrencies including ethereum, BNB     , XRP     , solana, cardano, avalanche and polkadot, with . Now, traders are nervously watching the price of crypto lender Celsius' cel cryptocurrency which has collapsed by almost 70% over the last month as panicked sellers offload the coin—forcing Celsius chief executive Alex Mashinsky to reassure the market. PROMOTED — Bitcoin, ethereum and cryptocurrency prices have been hard hit in recent weeks, putting those that ... [+] provide crypto-related services under pressure. \"All funds are safe,\" Mashinsky  to Twitter in response to rumors that Celsisus, which allows investors to earn interest on their crypto holdings as well as using it as collateral for loans, was in trouble. \"Notwithstanding the extreme market volatility, Celsius has not experienced any significant losses and all funds are safe.\" Celsius  in its weekly transparency report that recorded outflows of $1.1 billion between May 6 and May 12, described by Mashinsky in his Friday  as a \"tough week\" in which Celsius \"took quite a beating.\" But, \"anyone who wanted to withdraw funds was able to do so,\" Mashinsky told viewers. Earlier, Mashinsky defended cel in a YouTube  with InvestAnswers. \"[Cel'’s] not connected [to the business], we don't protect the cel token, it has its own life,\" said Mashinsky. \"If too many people show up to sell and not enough people show up to buy, cel will go down in price. In the last drawdown, cel behaved almost like a stablecoin despite the downturn but that just meant there was not enough buyers for sellers.\" Last year, as the bitcoin and wider crypto market went into meltdown following China's expulsion of crypto miners and traders, the cel price remained stable. Explaining cel's \"unique mechanism of self-correction,\" Mashinsky described how Celsius supports the cryptocurrency by buying more of it every week to meet demand. \"Our flywheel is more users who bring more assets, which means more yield, which means we have to buy more cel. So when we earn that yield on bitcoin, ethereum and so on and those people chose to earn and sell, [Celsius] has to buy more cel tokens.\" This week, blockchain analysis by  revealed Celsius had put $500 million into terra’s high-yield Anchor Protocol in recent months, managing to withdraw it ahead of the complete collapse of luna, UST and the terra ecosystem. Meanwhile, the Financial Times  Celsius reduced its borrowings of the tether USDT stablecoin ahead of the latest market volatility, reducing it by half to 500 million in recent months, citing an anonymous source. Tether     , by far the largest stablecoin that's generally regarded as the grease that keeps the crypto market turning, faced extreme scrutiny last week as it struggled to maintain its peg to the U.S. dollar. Tether's circulating supply has dropped to around $75 billion, down from $83 billion earlier this week according to CoinMarketCap data, suggesting the company's been hit by around $8 billion in redemptions over the course of the week. Recent bitcoin and crypto price volatility has been blamed on the Federal Reserve embarking on a tough program of interest rate hikes in an attempt to drive down runaway inflation—.  The price of Celsius' cel coin has crashed by almost 90% since this time last year, falling far ... [+] harder than the price of bitcoin, ethereum and other major cryptocurrencies. \"The crypto market is a small market,\" said Mashinsky, speaking on the InvestAnswers YouTube channel. \"It's basically attached to the hip to the stock market ... and the stock market is attached by the hip to the Fed and whatever the Fed does, the stock market will react in a positive or negative way.\" Mashinsky warned that soaring inflation, which has been steering the Fed in recent months, along with the Cboe Volatility Index, or VIX, are the \"first dominos,\" signaling market fluctuations. \"I have no idea if the [bitcoin] price will go up or down,\" Cory Klippsten, the chief executive of bitcoin-buying app Swan Bitcoin, said in a Telegram message. \"Bitcoin feels cheap to me at these levels, but it always feels cheap to me. In general, high volatility is great for exchange volumes, including Swan. We've seen elevated purchase levels, three to four times higher than usual, since the Luna      and UST collapse began a week ago.\" Mashinsky and Celsius did not return a request for comment when contacted.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "2,007",
            "summary": "Traders are nervously watching the price of crypto lender Celsius' cel cryptocurrency which has collapsed by almost 70% over the last month as panicked sellers offload the coin..."
        }
    },
    {
        "postid": 1,
        "date": "May 15, 2022",
        "title": "Biden ‘Endorsed’ Fed ‘Shock Therapy’—Why The $1 Trillion Bitcoin, Ethereum And Crypto Price Crash Could Be Just Getting Started",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/15/biden-endorsed-the-feds-shock-therapy-why-the-1-trillion-bitcoin-ethereum-and-crypto-price-crash-could-be-just-getting-started/",
        "article": " Bitcoin      and cryptocurrency prices have been hit by an almighty sell-off this month, wiping around $1 trillion from the crypto market since early April—.  The bitcoin price has dropped to lows not seen since the pandemic crypto rally began in late 2020 after a perfect storm of Federal Reserve interest rate hikes, the scaling back of its huge $9 trillion balance sheet and a huge $18 billion stablecoin meltdown (). Now, one widely-respected analyst has warned the Federal Reserve, \"endorsed\" by U.S. president Joe Biden, will pursue a program of \"shock therapy\" in order to drive down demand and \"slay\" inflation—with — Federal Reserve chair Jerome Powell was this week confirmed for a second four-year term by the U.S. ... [+] Senate after being renominated by U.S. president Joe Biden. \"Volatility is like napalm for risk assets,\" Zoltan Pozsar, the global head of Credit Suisse’s short-term interest rate strategy, wrote in  that was widely shared on social media this week. \"Consider at least the possibility that the extreme volatility and lack of liquidity you see in markets is by design, and the Fed will not be deterred by it, but rather that it will be emboldened by it in its singular pursuit of price stability. If an asset price correction is a desired outcome of hikes, and a big slowdown in growth is necessary to slay inflation, the more the curve inverts on the Fed, the harder it will push back against it.\" Data this week showed U.S. consumer prices rose at an annual pace of 8.3% in April, outpacing expectations and remaining stubbornly at a four-decade high. Earlier this month, the Fed hiked interest rates by half a percentage point—the largest rate increase in 22 years. Since then, Fed chair Jerome Powell, who was this week confirmed for a second four-year term, has signaled more similar-sized rate hikes are on the way while the Fed will also begin winding down its $9 trillion balance sheet that's ballooned through the pandemic era. \"I agree with what Powell said last week, that the number one threat [to] the strength that we build is inflation,\" president Biden said this week in comments interpreted by Pozsar to mean Biden \"announced the end of the Fed put, and endorsed the Fed call to slay inflation.\" \"The message is quite clear,\" Pozsar wrote. \"Quantitative easing overstayed its welcome; we need a round of negative wealth effects; we need 'shock therapy.' The Fed, on a singular mission to slay inflation, won’t rest in its pursuit of tighter financial conditions until yields shift higher, stocks fall more, and housing turns as well. The crypto sell-off is just an unexpected bonus.\"  The bitcoin price has lost 36% since this time last year and is down more than 50% from its all-time ... [+] high, with the Federal Reserve sparking a wider ethereum and crypto crash. As well as a brutal crypto crash that's wiped out bitcoin's and ethereum's gains over the last year, the S&P 500 is currently down more than 16% since the beginning of 2022 and the tech-heavy Nasdaq 100 is down 25%. The Dow's lost 12% since January. \"The Fed is now in the business of writing a call option on risk assets—not just stocks, but housing and crypto as well,\" wrote Pozsar. For some, the crypto crash has eclipsed the stock market sell-off, with volatility expected for the \"foreseeable future.\" \"The real story ... has to be the crypto rout,\" Danni Hewson, an analyst at London-based brokerage AJ Bell, wrote in emailed comments. \"There’s plenty of talk about increasing regulation of the space, but for those who’ve lost what they couldn’t afford to lose it comes too late. Market volatility is expected to remain for the foreseeable future and it’s hard not to make knee jerk moves but history teaches that up follows down and sometimes the right move is not to move.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "32,374",
            "summary": "One widely-respected analyst has warned the Federal Reserve, endorsed by U.S. president Joe Biden, will pursue a program of \"shock therapy\" in order to drive down demand and \"slay\" inflation—with the crypto crash \"an unexpected bonus\"..."
        }
    },
    {
        "postid": 2,
        "date": "May 14, 2022",
        "title": "‘Revival Plan’ Boosts ‘Essentially Zero’ Luna Price By 1,000% Amid Bitcoin, Ethereum And Crypto Crash",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/14/revival-plan-boosts-essentially-zero-luna-price-by-1000-amid-bitcoin-ethereum-and-crypto-crash/",
        "article": " Luna     , the collapsed cryptocurrency that was designed to support the terraUSD (UST     ) stablecoin, has rocketed higher over the last 24 hours despite falling to near zero this week—.  The luna price, which was trading as high as $100 per luna just last month, crashed to near zero this week—causing the algorithmic stablecoin UST to completely lose its peg to the U.S. dollar—amid a $1 trillion crypto crash that sent the bitcoin price down by over 20%. Now, the chief executive of UST and luna developer Terraform Labs, Do Kwon, has pitched a revival plan that could see ownership in the network distributed across UST and luna holders—causing the luna price to surge over 1,000% as traders bet the project could recover. PROMOTED — The chief executive of Terraform Labs Do Kwon pitched a \"revival plan\" for luna and the algorithmic ... [+] stablecoin UST following the blockchain ecosystem's collapse. \"While UST has been the central narrative of Terra’s growth story over the last year, the Terra ecosystem and its community is what is worth preserving,\" Kwon wrote in a  on a Terra discussion forum, adding the Terra community \"must reconstitute the chain to preserve the community and the developer ecosystem.\" The reconstitute—effectively a restart of the terra blockchain—would create 1 billion tokens to be distributed among various community stakeholders, with 40% going to luna holders before the UST de-pegging, 40% to go to UST holders \"pro-rata at the time of the new network upgrade,\" 10% to luna holders before the chain halt, and 10% to the \"Community Pool to fund future development.\" The blockchain underpinning luna and UST was shut down multiple times  to \"prevent governance attacks\" following \"severe [luna] inflation.\" Terraform Labs and the Luna Foundation Guard, tasked with supporting UST, this week printed several billion luna tokens—increasing the luna supply from 340 million last week to 6.5 trillion—in a failed attempt to maintain the UST peg to the dollar.  The luna price has fallen by almost 100% over the last week, sparking a bitcoin and crypto crisis. \"Terra needs a community to continue to grow and make its blockspace valuable again—the only way to do this is to make sure that token holders before the attack commenced, the most loyal community members and builders, stick around to keep providing value,\" Kwon wrote, adding, the ecosystem will not survive \"in its current state.\" In a follow-up , Kwon said he's \"heartbroken\" about the collapse of luna and UST but said he's confident the \"community will form consensus around the best path forward for itself and find a way to rise again.\" Others in the crypto community have also suggested the project could still survive in some form with Binance chief executive Changpeng Zhao, often known simply as CZ, saying there has been \"progress\" made. \"Luna blockchain resumed, no more minting,\" CZ  to Twitter. \"And deposits, withdrawals and trading resumed. Trading is important for existing holders.\" The luna and UST collapse this week came amid a bitcoin, ethereum and wider crypto market downturn that made UST vulnerable, with some speculating there may have been an orchestrated attack on the stablecoin. \"The pullback in general markets created the conditions for an attack on UST, which was inherently fragile,\" Cory Klippsten, the founder and CEO of bitcoin-buying app Swan Bitcoin, said in a Telegram message, adding, \"the effects of the unwind are wide reaching, and the ultimate magnitude still unknowable.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "266,074",
            "summary": "Luna﻿, the collapsed cryptocurrency that was designed to support the terraUSD (UST﻿﻿) stablecoin, has rocketed higher over the last 24 hours despite falling to near zero this week..."
        }
    },
    {
        "postid": 3,
        "date": "May 13, 2022",
        "title": "Still Has ‘Potential As A Currency’—Elon Musk Gives Surprise Dogecoin Signal After Huge Bitcoin, Ethereum And Crypto Price Crash",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/13/still-has-potential-as-a-currency-elon-musk-gives-surprise-dogecoin-signal-after-huge-bitcoin-ethereum-and-crypto-price-crash/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have bounced back over the last 24 following a devastating .  Bitcoin has added around 10% since falling to lows not see for more than a year, climbing back over $30,000. Meanwhile, ethereum and its biggest rivals have each added between 15% and 25%. Now, Tesla      billionaire and  has once again signalled his support for the meme-based bitcoin rival helping it's price to bounce by around 20%—. — Tesla billionaire Elon Musk has helped the price of the meme-based bitcoin rival dogecoin soar since ... [+] early 2021. \"[Dogecoin] has potential as a currency,\" Musk  to Twitter, replying to dogecoin co-creator Billy Markus who had written, \"the reason I like dogecoin is because it knows it is stupid.\" \"I enjoy that something stupid could also have utility and be successful,\" Markus added. The dogecoin price has rallied over recent weeks following news of Musk's $44 billion bid to take Twitter private, soaring on expectations Musk could move to embed dogecoin into Twitter, potentially using it for payments on the platform. However, dogecoin has fallen almost 90% since it reached an all time high of over 70 cents amid a Musk and high-profile investor fueled rally last year. Last month, Musk said he'd target crypto scams and bots if he does manage to take Twitter private and also .  The dogecoin price has bounced 20% over the last 24 hours following a massive crypto crash that ... [+] tanked the price of bitcoin, ethereum and other major cryptocurrencies. Dogecoin, now once again a top ten cryptocurrency, according to CoinMarketCap data, had crashed this week along with bitcoin, ethereum and other cryptocurrencies as a perfect storm of Federal Reserve interest rate hikes, the Fed beginning to shrink its yawning $9 trillion balance sheet and a major stablecoin meltdown sent cryptocurrencies in a tailspin. Panic spread like wildfire through crypto traders and investors after the $18 billion algorithmic stablecoin terraUSD (UST     ) lost its peg to the U.S. dollar, wiping out the price of its support coin luna which has now lost almost more than 99% of its value. Amid the carnage, the largest stablecoin tether also appeard to briefly lose its $1 value, sparking fears the bitcoin and crypto crash could spiral out of control.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "39,274",
            "summary": "Tesla﻿ billionaire and long-time dogecoin supporter Elon Musk has once again signalled his support for the meme-based bitcoin rival helping it's price to bounce by around 20%..."
        }
    },
    {
        "postid": 4,
        "date": "May 12, 2022",
        "title": "$1 Trillion Crypto Meltdown—Huge Crash Wipes Out The Price Of Bitcoin, Ethereum, BNB, XRP, Cardano, Solana, Terra’s Luna And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/12/1-trillion-crypto-meltdown-huge-crash-wipes-out-the-price-of-bitcoin-ethereum-bnb-xrp-cardano-solana-terras-luna-and-avalanche/",
        "article": " Bitcoin and cryptocurrencies have crashed further overnight, dropping to levels not seen since the crypto market began surging in late 2020 and wiping away almost $1 trillion worth of value in a month as .  The bitcoin price has dropped to around $27,000 per bitcoin, down 12% on the last 24 hours, and dragging down the wider crypto market with other top ten coins ethereum, BNB     , XRP     , solana, cardano, and avalanche recording even steeper loses. Ethereum has crashed 22% since this time yesterday, with BNB, XRP, solana, cardano and avalanche all lossing between 25% and 33%. The sell-off comes after the $18 billion algorithmic stablecoin terraUSD (UST) lost its peg to the U.S. dollar, wiping out the price of its support coin luna which has now lost almost 99% of its value—and . — The bitcoin price has crashed to levels not seen since late 2020 with ethereum, BNB, XRP, solana, ... [+] cardano, avalanche, and Terra's luna tanking. \"Bitcoin continued to slide and closed below $30,000 for the first time since last July, although the fall did not trigger a large sell off and the price is trying to recover $30,000 in the Thursday Tokyo session,\" Yuya Hasegawa, a crypto market analyst at Bitbank, wrote in an emailed note. \"The price of bitcoin, however, could still fall due to the UST situation and worsening technical sentiment, but if the U.S. inflation continues to slow down, the macro environment will likely improve and the price will bottom out.\" On Wednesday, markets were broadly hit by the latest U.S. inflation data that showed the consumer price index continued to run hot in April. \"U.S. CPI was a mixed result: even though it exceeded market expectations, it showed a sign of slowing down thanks to lower energy prices,\" wrote Hasegawa. \"The result was not enough to completely wipe out the possibility of faster monetary tightening, but it was also not enough to strengthen that possibility as well. The market inclines to sell on that kind of uncertainty and that is why stocks and crypto fell, but there is also a hope that inflation in the U.S. will continue to alleviate.\"  The bitcoin price has lost over 30% of its value in a week, crashing alongside the price of ... [+] ethereum, BNB, XRP, solana, cardano, avalanche and Terra's luna. The tech-heavy Nasdaq led markets lower on Wednesday, recording a 3.2% decline, with iPhone-maker Apple dethroned as the world's most valuable publicly traded company by oil major Saudi Aramco. \"The past week has seen turmoil has spread across markets globally as the reality of hawkish central bank policy and widespread inflation is realised,\" Will Hamilton, head of trading and research at asset management and technology company Trovio, said in emailed comments. \"Market drawdowns led by the tech heavy NASDAQ      spread across digital asset markets as investors continue their withdrawal from risk assets.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "380,423",
            "summary": "Bitcoin and cryptocurrencies have crashed further overnight, dropping to levels not seen since the crypto market began surging in late 2020..."
        }
    },
    {
        "postid": 5,
        "date": "May 11, 2022",
        "title": "Going ‘To Zero’—Panic Is Sweeping Crypto Markets, Hitting The Price Of Bitcoin, Ethereum, BNB, XRP, Cardano, Solana, Terra’s Luna And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/11/going-to-zero-panic-is-sweeping-crypto-markets-hitting-the-price-of-bitcoin-ethereum-bnb-xrp-cardano-solana-terras-luna-and-avalanche/",
        "article": " Bitcoin      and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg ().  The bitcoin price has dipped back toward $30,000 per bitcoin after plunging under the closely-watched level earlier this week. Ethereum and its major rivals BNB     , solana, cardano and avalanche have also crashed. Solana      and avalanche are leading the major market lower with a 10% and 20% decline respectively. Terra's luna, a cryptocurrency designed to support UST's one-to-one peg with the U.S. dollar, has lost almost 90% of its value over the last week as traders offload the cryptocurrency. — The bitcoin and crypto market has gone into free fall this week, with the price of ethereum, BNB, ... [+] XRP, solana, cardano and avalanche collapsing along with Terra's stablecoin UST and its luna cryptocurrency. \"Crypto markets have been under pressure given macro events (tighter monetary policy, surging inflation, Russia’s invasion of Ukraine) and the correlation between bitcoin and global equities is high,\" Jaime Baeza, the chief executive of Miami-based crypto hedge fund ANB Investments, said in emailed comments. \"However, the most recent fall in crypto prices is more due to the de-peg of the UST.\" UST, which was the biggest algorithmic stablecoin by market value, had a market capitalization of around $18 billion last week. It started to lose its peg to the dollar on Saturday, and on Monday traded as low as 60 cents. This morning it has dipped to around 30 cents. The Luna Foundation Guard, a group created to support the UST dollar peg, has said it will defend its price by selling its $3 billion bitcoin reserves. \"This accelerated the selloff of the broader crypto market as panic spread, and a more black swan systemic-risk event loomed closer,\" Baeza said. UST is designed so traders can exchange 1 UST for $1 worth of luna, no matter the price of UST. The Luna Foundation Guard was in the process of building up a $10 billion bitcoin-based crypto reserve when the crash happened.  The price of Terra's luna has fallen sharply, dragging down the price of bitcoin, ethereum, BNB, ... [+] XRP, solana, cardano and avalanche. Do Kown, the creator of UST and luna developer Terra Labs, has promised another bailout is imminent. On Tuesday, Kwon said he was \"getting close\" to \"announcing a recovery plan for UST,\" helping the price to rally but it has since fallen back. \"With the [UST] peg gone, luna will go to zero by design (as arbitrageurs buy UST and sell luna) unless parity and trust are restored, which can only be done by means of a significant cash infusion and changes in the protocol,\" trader Alex Krüger  to Twitter. UST began to lose its dollar peg last week amid a broader asset crash that hit bitcoin, crypto prices, including luna, and stock markets. Some have speculated a seller was flooding the market with UST over the weekend to attack the stablecoin. Meanwhile, around $5 billion worth of UST was drained out of the luna-based decentralized finance lending application Anchor.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "389,027",
            "summary": "Bitcoin﻿ and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg..."
        }
    },
    {
        "postid": 6,
        "date": "May 9, 2022",
        "title": "Serious ‘Ripple’ Warning After Massive $400 Billion Crypto Crash Suddenly Plunges Bitcoin, Ethereum, BNB, XRP, Solana, Cardano, Terra’s Luna And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/serious-ripple-warning-after-massive-400-billion-crypto-crash-suddenly-plunges-bitcoin-ethereum-bnb-xrp-solana-cardano-terras-luna-and-avalanche-into-free-fall/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday.  The bitcoin price has fallen dramatically toward $30,000 per bitcoin, down 20% from over $40,000 last week. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche had fallen even more steeply, each losing between 15% and 20%. Ripple's XRP      is also down around 15%. The brutal bitcoin and crypto price crash was triggered , also crashing stock markets, and then exacerbated by the fast-growing algorithmic stablecoin TerraUSD (UST) struggling to maintain its $1 peg as its support cryptocurrency luna leads market lower with a blistering 30% plummet. — The bitcoin price has been trending down over the last month but has recently crashed, dragging down ... [+] the price of ethereum, BNB, solana, cardano, XRP, luna, and avalanche. “In highly volatile markets, all asset classes will move in lockstep,\" Michael Safai, managing partner at crypto trading firm Dexterity Capital, said in emailed comments, pointing to soaring inflation and fears over more Fed monetary tightening worrying investors. Safai warned that if the bitcoin price crashes under $30,000 fears over \"ripple effects\" will spread. \"Enthusiasm for what’s being built in crypto hasn’t faded, but if we go further below $30,000, the market will naturally be worried about the ripple effects, such as miners turning their machines off as they move out of profitability. $25,000 isn’t a worst-case scenario here, and the market may be bracing itself for that reality.\" Other bitcoin and crypto market watchers have also warned over sell-off \"momentum\" building. \"Investors exiting positions may be adding some momentum to the protracted sell-off that we’ve witnessed over the past few days,\" analysts at Bitfinex wrote in an emailed note. That momentum was partly driven by , falling further today even after Do Kwon, the founder of the project's developer Terra Labs,  to \"deploy more capital\" to help maintain the UST price.  The bitcoin price has crashed to just over $30,000 per bitcoin over the last month, losing almost ... [+] 30% from its total value amid a broader crypto crash that's tanked ethereum, BNB, XRP, solana, cardano and avalanche. However, some have pointed to this week's U.S. inflation data, due Wednesday, as potentially offering some relief to both crypto and stock markets. \"All is not lost for bitcoin yet,\" Yuya Hasegawa, crypto market analyst at Bitbank, wrote in emailed comments. \"April’s U.S. consumer price index (CPI), which will be the main event for the week, could be a turning point for the price. If the CPI shows no sign of slowing down, it will add to the fear of faster monetary tightening, but other inflation metrics are starting to slow down and the April CPI could follow suit, which in turn will likely alleviate the market’s concern and help recover its risk sentiment.\" The president of El Salvador, who has spearheaded the country's adoption and accumulation of bitcoin over the last year, remains bullish on bitcoin,  he's \"bought the dip\" by adding 500 bitcoins at an average price of around $30,744 to El Salvador's stash.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "102,457",
            "summary": "Bitcoin﻿, ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday..."
        }
    },
    {
        "postid": 7,
        "date": "May 9, 2022",
        "title": "CryptoCodex: Crypto Now Braced For A Coinbase Bombshell After Bitcoin And Ethereum Price Collapse",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/cryptocodex-crypto-now-braced-for-coinbase-bombshell-after-bitcoin-and-ethereum-price-collapse/",
        "article": " The following is an excerpt from the daily CryptoCodex email newsletter. Cryptocurrency prices have moved sharply lower , falling to lows not seen since last summer. Microsoft      billionaire Bill Gates yesterday warned rising interest rates will probably cause a global economic recession, telling CNN a combination of rate hikes and soaring commodity prices mean \"the bears on this one have a pretty strong argument that concerns me a lot.\" The  price has this morning dropped to under $33,000, down more than 20% over the last 30 days.  and other major cryptocurrencies are faring even worse, with ether falling 7% since this time yesterday and its biggest rivals    , ,  and  all dropping between 8% and 12%. Terra's  is struggling despite moves from the Luna      Guard Foundation and Terra Labs to shore up the coin, itself designed to support the algorithmic stablecoin TerraUSD      (UST). See below for details.  Do Kwon, co-founder and chief executive officer of Terraform Labs, pictured at the company's office ... [+] in Seoul in April. After Terra's algorithmic stablecoin TerraUSD (UST) briefly lost its dollar peg over the weekend, the Luna Foundation Guard (LFG) has announced this morning it will lend out hundreds of millions of dollars worth of bitcoin and the stablecoin UST in order to maintain it. The Singapore-based LFG said it would loan $750 million worth of bitcoin to trading companies as well as $750 million in UST to accumulate bitcoin in an attempt to stabilize the market. It's thought UST struggled to maintain its dollar peg due to large quantities of UST being withdrawn from liquidity pools on decentralized exchange Curve, while $192 million of UST was dumped. In a now-deleted tweet Do Kwon, the founder of the project's developer Terra Labs, seemed to hint that the sell-off may have been an orchestrated effort to make UST lose its peg. Kwon later sought to reassure the community, posting to Twitter the loans shouldn't be seen as LFG trying to exit its bitcoin position but rather increasing the liquidity around the UST peg. \"As markets recover, we plan to have the [UST] loan redeemed to us in bitcoin, increasing the size of our total reserves,\" Kwon . Some aren't keen on the plan, with bitcoin podcaster Peter McCormack  it \"smells like the Fed buying U.S. bonds in crypto land.\" The price of Terra's luna, designed to help UST maintain that dollar peg, has collapsed over the last week, crashing 25% and plunging the total value of luna coins to just $20 billion—a mere $1.4 billion more than the UST market capitalization. UST relies on luna to keep its price of a dollar via a set of on-chain mint and burn mechanisms. Both UST and luna have surged into the CoinMarketCap crypto top ten over recent months and UST is one of the largest algorithmic stablecoins. LFG is non-profit group that was formed in January to support the Terra ecosystem as well as \"the sustainability and stability of Terra’s algorithmic stablecoins\" and plans to accumulate a $10 billion bitcoin-based reserve intended to serve as a support mechanism for UST's peg. So far, it's bought up around $3 billion worth of bitcoin. LFG's governing council includes some of the biggest names in decentralized finance (DeFi), such as Jump Crypto president Kanav Kariya.  📑 Coinbase, arguably the most important crypto exchange and platform, will report its first-quarter earnings tomorrow and  (despite bullish predictions from ). Coinbase stock has crashed along with the bitcoin and crypto market over the last few months and is now down 70% from its market debut. 📉 Desktop and mobile-web traffic has plunged 26% in the first quarter from a year earlier, according to data collected by analytics company Similarweb. Mobile app installs in March were down 67% from April 2021, the month the company went public. 🏷️ Meanwhile, reaction to Coinbase's new non-fungible token (NFT) marketplace has been broadly negative. Nick Tomaino of crypto investment firm 1confirmation, who's also former Coinbase employee, launched a scathing attack on the company via , saying the current Coinbase's current NFT platform \"is not it\" and promising to sell all his Coinbase shares \"if the company doesn't make a strong move in NFTs in the next year.\"  👀 Look out for these cryptocurrency and crypto-related events this week. 🤳 Today, Facebook parent company Meta will open its first , a \"physical retail space\" on its campus in Burlingame, California. Over the weekend, Coindesk  Meta’s Instagram will support NFTs from ethereum, polygon, solana and flow. - 🪙 Tomorrow, major U.S. crypto exchange Coinbase will post its first-quarter results amid a severe market downturn. 🎈 Wednesday brings the latest U.S. inflation data in the form of the consumer price index (CPI). The data is expected inflation peaked last month at 8.5%. - 👨‍💻 Also Wednesday, Google's      annual I/O developer conference gets underway. - 🛡️ On Thursday, Microsoft's Security Summit kicks off, featuring tech demos and discussions on the modern-day cyber threat landscape. ",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "37,854",
            "summary": "The following is an excerpt from the daily CryptoCodex email newsletter. Sign up now for free here..."
        }
    },
    {
        "postid": 8,
        "date": "May 8, 2022",
        "title": "‘Extreme Fear’ Crypto Crash Suddenly Wipes $200 Billion From The Price Of Bitcoin, Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/08/extreme-fear-crypto-crash-suddenly-wipes-200-billion-from-the-price-of-bitcoin-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days ().  The bitcoin price has dropped to under $35,000, its lowest since July last year, as \"extreme fear\" grips traders in the aftermath of . Ethereum and other top ten cryptocurrencies BNB     , XRP     , luna, solana, cardano and avalanche are also struggling with market sentiment falling to lows not seen since January. — The bitcoin price has lost 10% from its price this last week, dragging down the price of ethereum, ... [+] BNB, XRP, solana, cardano, luna and avalanche. This week's bitcoin and crypto crash has triggered a sharp fall in market sentiment, as measured by the Bitcoin Fear and Green Index which collects data from social media posts, surveys, volatility and trading volume. The gauge has now fallen into \"extreme fear\" territory, dropping further after trending lower through April. Stock markets have also lost ground this week with the Nasdaq recording its longest weekly losing streak since 2012. \"The correlation between cryptocurrency and equities has been discussed fairly extensively after bitcoin and the tech-heavy Nasdaq displayed a higher positive correlation than was initially expected,\" Tammy Da Costa, an analyst at DailyFX, wrote in emailed comments, noting that predictions made before Russia's war in Ukraine were made under the assumption that once interest rates began to rise, supply and demand would meet. \"Over the past week, fundamentals have included interest rate expectations and nobody can ignore the ongoing war which continues to place pressure on supply constraints, particularly for commodities.\" Market pressure, weighing on both crypto and equities, includes concerns over soaring inflation, an increasingly hawkish Federal Reserve and fears over a consumer spending pullback.  The bitcoin price has been trending downward for the past month, mirrored by the price of other ... [+] major cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Smaller cryptocurrencies that have outpaced the likes of bitcoin and ethereum in recent months have fallen harder during this latest crash. \"The future of individual coins or tokens remains dubious, the law remains in control of such solicitations and the approval of social media giants such as Elon Musk,\" added Da Costa. Terra's luna, used to stabilize the price of the protocol's stablecoins, has crashed more than 20% in the last week alone even as the Luna      Foundation Guard bought $1.5 billion in bitcoin to bolster the reserves of its most popular stablecoin UST     . Some have  a \"massive UST sell-off\" on the decentralized exchange Curve sparked rumors UST could lose its peg to the dollar, in turn causing the price of luna to fall further. The rumors were dismissed by Terra creator Do Kwon on .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "89,532",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days."
        }
    },
    {
        "postid": 9,
        "date": "May 7, 2022",
        "title": "‘A De Facto Ban’—Serious Bitcoin Warning Issued As Price Crash Hits Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/07/a-de-facto-ban-serious-bitcoin-warning-issued-as-price-crash-hits-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply this week as a broad asset price crash tanks markets ().  The bitcoin price has lost around 10% over the last few days, crashing to levels not seen since January. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche have plunged, with Ripple's XRP      and Terra's luna also falling—. Ahead of , the chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned that governments are going to try to ban bitcoin and other cryptocurrencies. — The bitcoin and crypto market has gone into free fall, with the price of ethereum, BNB, XRP, solana, ... [+] cardano, luna and avalanche dropping sharply. \"What we're seeing around the world, which is really concerning to me, is using the attack on proof-of-work, and in particular, bitcoin's energy usage, as a way to implement a de facto ban on bitcoin without saying it,\" said Demirors, speaking during the Crypto Bahamas conference it was reported by . Proof-of-work is the name for bitcoin's decentralized consensus mechanism that lets so-called bitcoin miners secure the network and validate transactions in return for new coins. Some newer cryptocurrencies, such as ethereum rivals solana and cardano, have adopted a less energy-intensive consensus mechanism called proof-of-stake. Ethereum is trying to transition to proof-of-stake to better scale and reduce its carbon footprint. Bitcoin, by far the largest cryptocurrency by value, has been widely criticized for its eye-watering energy demands, by some estimates thought to use as much electricity per year as some small countries. In recent years, as the soaring bitcoin price has caused an influx of miners, lawmakers and regulators around the world have begun weighing whether to ban proof-of-work crypto mining. Last year, a crypto crackdown in China resulted in a miner mass exodus from the country, with many relocating to the U.S. and Europe. \"Governments are going to try to ban bitcoin, they're going to try to attack bitcoin because it's really difficult to do otherwise,\" Demirors said. This week, the state of New York has come  to an effective bitcoin mining ban with a bill calling for a two-year moratorium on proof-of-work cryptocurrency mining operations unless the company uses 100% renewable energy and until the state can complete an impact study progressing through the State Assembly.  The bitcoin price has swung wildly over the last year, losing around 40% from its peak of almost ... [+] $70,000 per bitcoin and dragging down the price of ethereum, BNB, XRP, solana, cardano, luna, and avalanche. Last month, —and their desire to \"protect\" the likes of ethereum. Earlier, environmental activist organization Greenpeace launched a lobbying campaign, funded by the billionaire co-founder of XRP developer Ripple, urging the bitcoin community to consider switching to proof-of-stake. \"A lot of the information [lawmakers are] getting is from other protocols lobbying for this,\" Demirors added. Speaking alongside Demirors, Elizabeth Stark, the chief executive of bitcoin payments developer Lighting Labs, echoed her concerns. \"I believe there are a lot of actors out there that are intentionally trying to attack bitcoin because there's no CEO,\" said Stark.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "51,219",
            "summary": "The chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned governments are going to try to ban bitcoin and other cryptocurrencies..."
        }
    },
    {
        "postid": 10,
        "date": "May 5, 2022",
        "title": "$100 Billion Crypto Crash Sends The Price Of Bitcoin, Ethereum, XRP, Luna, Solana, Cardano And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/05/100-billion-crypto-crash-sends-bitcoin-ethereum-xrp-luna-solana-cardano-and-avalanche-into-free-fall/",
        "article": " Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes ().  The bitcoin price is down around 5% over the last 24 hours, with the ethereum price seeing a similar decline. Ethereum rivals solana, cardano, and avalanche are all down around 3% while Ripple's XRP      and Terra's luna are leading the major crypto market lower. The sudden crash comes amid a technology company-led stock market sell-off in the aftermath of . — A huge crypto price sell-off has wiped around $100 billion worth of value from the market as the ... [+] price of bitcoin, ethereum, XRP, solana, cardano, luna and avalanche suddenly tank. \"Bitcoin’s struggle is by no means in isolation–the S&P 500 [has fallen] to a new record low for the year,\" Sam Kopelman, the U.K. manager for bitcoin and crypto exchange Luno, said in emailed comments and warning bitcoin could \"slip back into the previously found $36,000-$37,000 support range.\" However, Kopelman is upbeat about the bitcoin price but less positive about other major coins such as ethereum, XRP, solana, cardano, luna and avalanche. \"Overall, 2022 has generally seen crypto market participants climbing down the risk ladder, selling their smaller coins for blue-chip coins like bitcoin,\" said Kopelman.  The bitcoin price has suddenly dropped under its recent $38,000 per bitcoin support level. The market has had a delayed response to the Federal Reserve's biggest rate hike since 2000, first spiking on Wednesday's news and leading market watchers to believe the potentially \"bearish event\" to have been \"priced in.\" \"The market clearly priced in this bearish event during the weeks leading up to the FOMC meeting, where we saw significant sell pressure,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, said in emailed comments following the Fed's decision. Earlier this week, .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "81,511",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes..."
        }
    },
    {
        "postid": 11,
        "date": "May 4, 2022",
        "title": "Coinbase CEO Issues Stunning Crypto Prediction As The Price Of Bitcoin And Ethereum Suddenly Soar",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/04/coinbase-ceo-issues-stunning-crypto-prediction-as-the-price-of-bitcoin-and-ethereum-suddenly-soar/",
        "article": " Bitcoin      and ethereum, the two largest cryptocurrencies by a considerable margin, boast hundreds of millions of users around the world after a huge price explosion in recent years.  The bitcoin price soared to almost $70,000 per bitcoin late last year, up from under $10,000 two years ago, while the ethereum price has seen a similar rise. Both are down by around 40% from their all-time highs, however. Now, Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade—forecasting 1 billion people will have used crypto by 2032. — Coinbase chief executive Brian Armstrong is one of the most influential voices in the world of ... [+] bitcoin, ethereum and crypto. \"My guess is that in 10-20 years, we’ll see a substantial portion of GDP happening in the crypto economy,\" said Armstrong, speaking at the Milken Institute Global Conference this week in comments first reported by . Coinbase, based in San Francisco, currently has almost 90 million verified users across 100 countries. The \"crypto economy\" has grown rapidly over the last few years as businesses and services spring up around bitcoin, ethereum and other cryptocurrencies. Decentralized finance (DeFi)—the idea that crypto technology can replace lenders and insurers—and blockchain-based digital collectibles known as non-fungible tokens (NFTs) have both become multi-billion dollar markets in just a couple of years. Some of the world's largest technology companies, including Facebook's parent Meta and Elon Musk's electric car company Tesla     , have begun adopting crypto. Meta, under chief executive Mark Zuckerberg, is looking to expand into the so-called metaverse digital world where NFTs are expected to play a significant role. Tesla has added bitcoin to its corporate balance sheet and has begun experimenting with crypto payments. Financial giants on Wall Street have also slowly started to roll out crypto services to clients. Speaking alongside Armstrong, Ark Investment Management's chief executive, Cathie Wood, one of the biggest backers of web3—a name for the crypto and blockchain-based next-generation of the internet that some think could succeed the current Silicon Valley-centric model—warned financial companies not to fall behind. \"In the case of DeFi and next-generation internet, we are seeing a lot of financial companies losing talent to crypto,\" Wood said, according to Bloomberg. \"So they have to take it seriously, or else they are going to be hollowed out.\"  The bitcoin price has rocketed higher in recent years, adding many thousands of percent and helping ... [+] the ethereum price to surge. Meanwhile, the crypto industry is feeling upbeat about the evolving regulatory landscape following a Biden administration executive order directing federal agencies to collaborate on a rule book for blockchain businesses. \"It’s been harder and harder to meet a true crypto skeptic in D.C.,\" Armstrong added, speculating that around half of people in Washington are now pro-crypto. Crypto industry lobbying has exploded along with the bitcoin price over the last couple of years, research has found. The price of bitcoin, ethereum and other major cryptocurrencies have rallied this week, climbing on the back of a closely-telegraphed Federal Reserve interest rate hike that some had feared could be more hawkish than anticipated and following several positive global bitcoin and crypto developments. \"An increasing number of countries are legalizing bitcoin as a currency, embracing its ability to strengthen financial infrastructure, facilitate wealth creation, and afford direct access to financial resources,\" Matt Senter, chief technology officer at bitcoin rewards app Lolli, said in emailed comments. \"With the devaluation of the U.S. dollar due to inflation, we are now finding ourselves in the perfect storm catalyzing global mainstream adoption of bitcoin as an anti-inflationary, disintermediated alternative to our legacy financial system in crisis.”",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "231,357",
            "summary": "Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade..."
        }
    },
    {
        "postid": 12,
        "date": "May 3, 2022",
        "title": "Crypto Price Alert: Fed Triggers Stark $10,000 Bitcoin Crash Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/crypto-price-alert-fed-triggers-stark-10000-bitcoin-warning/",
        "article": " Bitcoin      and cryptocurrency prices have been stuck in a holding pattern ahead of the .  as central bank monetary tightening squeezes assets across the board. The Fed is widely expected to hike rates by 50 basis points—the biggest rate increase in 22 years—in order to temper soaring inflation. Now, a veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price—despite historical data suggesting May could be . — Federal Reserve chairman Jerome Powell will hold a press conference after the Wednesday interest ... [+] rate decision is released. Fears of Fed tightening have weighed on the bitcoin price and stock markets. \"The completion of a bear channel typically results in a decline equal to the width of the channel, or in this case a hard test of $32,000 or so—my guess is $28,000,\" Peter Brandt, the chief executive of trading service Factor,  to Twitter alongside a chart showing the bitcoin price trending downward. While bitcoin, cryptocurrencies and stock markets are on high alert ahead of the Fed's interest rate decision, traders are even more closely attuned to comments from Fed chair Jerome Powell who will speak at a press conference following the 2pm ET release of the statement. \"Fed meetings always signal uncertainty and volatility, which may impact not only digital assets but also broad markets as a whole,\" Eric Chen, chief executive of decentralized exchange protocol injective developer Injective Labs, said in emailed comments. \"But crypto markets are more attached to the underlying technology and value behind the projects and larger market trends over time have only proven that fact.\" Looking back over recent trends, the month of May has historically been the fourth-best month for bitcoin, analysis by Coindesk showed, with the bitcoin price making gains in seven of the past 11 years.  The bitcoin price has crashed back from its all-time high of almost $70,000 per bitcoin set in ... [+] November last year. \"In terms of seasonality, May is considered a relative success for BTC. Over the past 11 years, bitcoin has ended the month up seven times and down four times,\" Alex Kuptsikevich, senior market analyst at FxPro, said in emailed comments. The bitcoin price has found a floor in recent weeks, repeatedly hitting support at around $38,000 as positive bitcoin and crypto developments roll in. Central African Republic has followed El Salvador in adopting bitcoin as legal tender, while Panama has signaled it's increasingly interested in crypto. Wall Street giant Goldman Sachs last week offered its first-ever lending facility backed by bitcoin, called a \"significant step\" by . \"I still believe crypto is the most optimal hedge against these macroeconomic issues which is why institutional interest in the industry has only continued to grow,\" added Chen. \"Both venture capital funding and fund deployments into crypto are soaring at one of the fastest levels since the inception of bitcoin.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "54,077",
            "summary": "A veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price..."
        }
    },
    {
        "postid": 13,
        "date": "May 3, 2022",
        "title": "Huge 2022 Ethereum Price Prediction Comes With A Serious BNB, Solana, Cardano, Avalanche And Polkadot Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/huge-2022-ethereum-price-prediction-comes-with-a-serious-bnb-solana-cardano-avalanche-and-polkadot-warning/",
        "article": " Ethereum, the second-largest cryptocurrency after bitcoin, has seen its price swing wildly over the last year—.  The ethereum price has lost around 43% since its peak of almost $5,000 per ether set late last year. Meanwhile, smart contract rivals BNB     , solana, cardano, avalanche and polkadot have seen similar volatility. Now, a panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800. — The ethereum price has dropped over the last year as rivals such as Binance's BNB, solana, cardano, ... [+] avalanche and polkadot win market share. The panel, made up of 36 people from the world of crypto and put together by financial comparison website , has returned a lower average ethereum price prediction for the end of 2022 than it did in January, revising down the year-end price target by just over 10% due to emerging competition from rival blockchains such as BNB, solana, cardano, avalanche and polkadot. \"Ethereum is at a very uncertain place in its journey at the moment,\" Keegan Francis, Finder's cryptocurrency editor, said in a statement. \"Ethereum is currently losing DeFi market share to its competitors, although it still remains dominant by a huge margin ... I don't think ethereum will be the second cryptocurrency forever.\" The ethereum price has rocketed over the last two years in part due to soaring interest in so-called decentralized finance (DeFi)—using crypto technology to recreate traditional financial services without the need for a bank—and the ongoing non-fungible token (NFT) craze that has been adopted by the world's of music, sport and gaming and is largely built on the ethereum blockchain. However, a long-awaited ethereum upgrade, designed to help the network scale, reduce its sky-high fees and ease its carbon footprint, has again been pushed back—now due for late 2022.  The ethereum price has seen extreme volatility over the last 12 months though bullish price ... [+] predictions continue to forecast a recovery even as BNB, solana, cardano, avalanche and polkadot steal attention. \"People have been waiting for [ethereum's merge upgrade] for years,\" said panel memeber and Thomson Reuters      technologist, Joseph Raczynski. \"It should be far more secure, 99% more energy-efficient, and deflationary. If that isn't the trifecta of potential, as a leading blockchain, I don't know what would be.\" Looking further ahead, the panel returned an ethereum price prediction of almost $12,000 by 2025, around four-fold its current price. \"Until ethereum upgrades its systems and fulfills its promises to scale, I do not have long-term confidence in the network,\" said Francis, but adding, \"I still think people will buy the token out of hype, promise and potential.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "139,665",
            "summary": "A panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800..."
        }
    },
    {
        "postid": 14,
        "date": "May 1, 2022",
        "title": "Bitcoin And Crypto Now Braced For A $9 Trillion Fed Earthquake As The Price Of Ethereum, BNB, Solana, Cardano, XRP, Terra’s Luna And Avalanche Crater",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/01/bitcoin-and-crypto-braced-for-a-9-trillion-earthquake-as-the-price-of-ethereum-bnb-solana-cardano-xrp-terras-luna-and-avalanche-crater/",
        "article": " Bitcoin      and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve ().  The bitcoin price has lost around 40% from its peak of almost $70,000 per bitcoin late last year with the ethereum price also down by nearly half. Other major coins—including Binance's BNB     , Ripple's XRP     , solana, cardano, Terra's luna and avalanche—have also plunged, wiping $1.2 trillion from the combined crypto market in a matter of months. Now, after Federal Reserve chair Jerome Powell signaled a half percentage point interest rate hike is on the table at next week's meeting, the market is braced for the central bank to begin shrinking its huge $9 trillion asset portfolio as it battles soaring inflation. — Federal Reserve chair Jerome Powell has signaled the central bank was likely to raise interest rates ... [+] by a half percentage point at its upcoming meeting, putting bitcoin, crypto and stock prices under pressure. \"Macro uncertainty has driven all risk-on assets downwards over the last few months, including bitcoin,\" Joe Haggenmiller, head of markets at leading crypto finance company XBTO Group, said in emailed comments. \"Price volatility in the bitcoin market over the last few weeks can be attributed largely to its correlation to other risk assets, which in general have been moving in reaction to conflict in Ukraine, supply chain issues due to rising Covid cases in China, and ongoing interest rate hikes and future balance sheet machinations by the Federal Reserve.\" Early in the Covid-19 pandemic, the Federal Reserve began an unprecedented stimulus program that saw its balance sheet double and interest rates fall to historic lows as it flooded markets with cash in an effort to offset the economic damage of Covid-19 and lockdowns. As the pandemic has begun to recede and inflation has spiked, the Fed has pivoted to trying to cool the economy. \"It is appropriate in my view to be moving a little more quickly [than the Fed has recently],\" Powell said last week, speaking after a panel discussion with European Central Bank President Christine Lagarde hosted by the International Monetary Fund, adding he thinks \"there’s something in the idea of front-end loading\" those moves. However, economic data has this week shown the U.S. economy shrank in the first three months of the year, contracting by 0.4% in the first quarter, its weakest quarter since the early days of the pandemic. \"This is bullish for risk assets like bitcoin and equities in my opinion, as the Federal Reserve may become less hawkish to avoid a recession,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, wrote in an emailed note. Bitcoin, crypto and stock market traders are watching carefully for any sign the Fed will stray from its telegraphed move when it meets this week. \"An increase higher than 50 basis points, deviating from the current consensus, may lead to a drop in risk markets including bitcoin,\" added Haggenmiller. \"Regardless, the bitcoin market has proved to be relatively resilient in the long term throughout periods of uncertainty.\"  The bitcoin price has fallen sharply from its all-time high, dragging down the price of other top ... [+] ten cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Meanwhile, the bitcoin and crypto community has cheered a series of positive developments this week, including Central African Republic becoming the second country after El Salvador to adopt bitcoin as legal tender and investment giant Fidelity announcing the launch of 401k bitcoin accounts. \"Recently, bitcoin has reached a new phase of mainstream adoption: companies and countries are now integrating bitcoin without waiting for bitcoin’s price to skyrocket,\" Alex Adelman, the chief executive of bitcoin rewards app Lolli. \"This lack of correlation between price moves and increasing mainstream adoption demonstrates that more institutions are grasping bitcoin’s immense utility as a currency and store of value and its inevitable, powerful role in our financial future.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "1,038,186",
            "summary": "Bitcoin﻿ and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve..."
        }
    },
    {
        "postid": 15,
        "date": "May 11, 2022",
        "title": "Going ‘To Zero’—Panic Is Sweeping Crypto Markets, Hitting The Price Of Bitcoin, Ethereum, BNB, XRP, Cardano, Solana, Terra’s Luna And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/11/going-to-zero-panic-is-sweeping-crypto-markets-hitting-the-price-of-bitcoin-ethereum-bnb-xrp-cardano-solana-terras-luna-and-avalanche/",
        "article": " Bitcoin      and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg ().  The bitcoin price has dipped back toward $30,000 per bitcoin after plunging under the closely-watched level earlier this week. Ethereum and its major rivals BNB     , solana, cardano and avalanche have also crashed. Solana      and avalanche are leading the major market lower with a 10% and 20% decline respectively. Terra's luna, a cryptocurrency designed to support UST's one-to-one peg with the U.S. dollar, has lost almost 90% of its value over the last week as traders offload the cryptocurrency. — The bitcoin and crypto market has gone into free fall this week, with the price of ethereum, BNB, ... [+] XRP, solana, cardano and avalanche collapsing along with Terra's stablecoin UST and its luna cryptocurrency. \"Crypto markets have been under pressure given macro events (tighter monetary policy, surging inflation, Russia’s invasion of Ukraine) and the correlation between bitcoin and global equities is high,\" Jaime Baeza, the chief executive of Miami-based crypto hedge fund ANB Investments, said in emailed comments. \"However, the most recent fall in crypto prices is more due to the de-peg of the UST.\" UST, which was the biggest algorithmic stablecoin by market value, had a market capitalization of around $18 billion last week. It started to lose its peg to the dollar on Saturday, and on Monday traded as low as 60 cents. This morning it has dipped to around 30 cents. The Luna Foundation Guard, a group created to support the UST dollar peg, has said it will defend its price by selling its $3 billion bitcoin reserves. \"This accelerated the selloff of the broader crypto market as panic spread, and a more black swan systemic-risk event loomed closer,\" Baeza said. UST is designed so traders can exchange 1 UST for $1 worth of luna, no matter the price of UST. The Luna Foundation Guard was in the process of building up a $10 billion bitcoin-based crypto reserve when the crash happened.  The price of Terra's luna has fallen sharply, dragging down the price of bitcoin, ethereum, BNB, ... [+] XRP, solana, cardano and avalanche. Do Kown, the creator of UST and luna developer Terra Labs, has promised another bailout is imminent. On Tuesday, Kwon said he was \"getting close\" to \"announcing a recovery plan for UST,\" helping the price to rally but it has since fallen back. \"With the [UST] peg gone, luna will go to zero by design (as arbitrageurs buy UST and sell luna) unless parity and trust are restored, which can only be done by means of a significant cash infusion and changes in the protocol,\" trader Alex Krüger  to Twitter. UST began to lose its dollar peg last week amid a broader asset crash that hit bitcoin, crypto prices, including luna, and stock markets. Some have speculated a seller was flooding the market with UST over the weekend to attack the stablecoin. Meanwhile, around $5 billion worth of UST was drained out of the luna-based decentralized finance lending application Anchor.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "389,027",
            "summary": "Bitcoin﻿ and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg..."
        }
    },
    {
        "postid": 16,
        "date": "May 9, 2022",
        "title": "Serious ‘Ripple’ Warning After Massive $400 Billion Crypto Crash Suddenly Plunges Bitcoin, Ethereum, BNB, XRP, Solana, Cardano, Terra’s Luna And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/serious-ripple-warning-after-massive-400-billion-crypto-crash-suddenly-plunges-bitcoin-ethereum-bnb-xrp-solana-cardano-terras-luna-and-avalanche-into-free-fall/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday.  The bitcoin price has fallen dramatically toward $30,000 per bitcoin, down 20% from over $40,000 last week. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche had fallen even more steeply, each losing between 15% and 20%. Ripple's XRP      is also down around 15%. The brutal bitcoin and crypto price crash was triggered , also crashing stock markets, and then exacerbated by the fast-growing algorithmic stablecoin TerraUSD (UST) struggling to maintain its $1 peg as its support cryptocurrency luna leads market lower with a blistering 30% plummet. — The bitcoin price has been trending down over the last month but has recently crashed, dragging down ... [+] the price of ethereum, BNB, solana, cardano, XRP, luna, and avalanche. “In highly volatile markets, all asset classes will move in lockstep,\" Michael Safai, managing partner at crypto trading firm Dexterity Capital, said in emailed comments, pointing to soaring inflation and fears over more Fed monetary tightening worrying investors. Safai warned that if the bitcoin price crashes under $30,000 fears over \"ripple effects\" will spread. \"Enthusiasm for what’s being built in crypto hasn’t faded, but if we go further below $30,000, the market will naturally be worried about the ripple effects, such as miners turning their machines off as they move out of profitability. $25,000 isn’t a worst-case scenario here, and the market may be bracing itself for that reality.\" Other bitcoin and crypto market watchers have also warned over sell-off \"momentum\" building. \"Investors exiting positions may be adding some momentum to the protracted sell-off that we’ve witnessed over the past few days,\" analysts at Bitfinex wrote in an emailed note. That momentum was partly driven by , falling further today even after Do Kwon, the founder of the project's developer Terra Labs,  to \"deploy more capital\" to help maintain the UST price.  The bitcoin price has crashed to just over $30,000 per bitcoin over the last month, losing almost ... [+] 30% from its total value amid a broader crypto crash that's tanked ethereum, BNB, XRP, solana, cardano and avalanche. However, some have pointed to this week's U.S. inflation data, due Wednesday, as potentially offering some relief to both crypto and stock markets. \"All is not lost for bitcoin yet,\" Yuya Hasegawa, crypto market analyst at Bitbank, wrote in emailed comments. \"April’s U.S. consumer price index (CPI), which will be the main event for the week, could be a turning point for the price. If the CPI shows no sign of slowing down, it will add to the fear of faster monetary tightening, but other inflation metrics are starting to slow down and the April CPI could follow suit, which in turn will likely alleviate the market’s concern and help recover its risk sentiment.\" The president of El Salvador, who has spearheaded the country's adoption and accumulation of bitcoin over the last year, remains bullish on bitcoin,  he's \"bought the dip\" by adding 500 bitcoins at an average price of around $30,744 to El Salvador's stash.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "102,457",
            "summary": "Bitcoin﻿, ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday..."
        }
    },
    {
        "postid": 17,
        "date": "May 9, 2022",
        "title": "CryptoCodex: Crypto Now Braced For A Coinbase Bombshell After Bitcoin And Ethereum Price Collapse",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/cryptocodex-crypto-now-braced-for-coinbase-bombshell-after-bitcoin-and-ethereum-price-collapse/",
        "article": " The following is an excerpt from the daily CryptoCodex email newsletter. Cryptocurrency prices have moved sharply lower , falling to lows not seen since last summer. Microsoft      billionaire Bill Gates yesterday warned rising interest rates will probably cause a global economic recession, telling CNN a combination of rate hikes and soaring commodity prices mean \"the bears on this one have a pretty strong argument that concerns me a lot.\" The  price has this morning dropped to under $33,000, down more than 20% over the last 30 days.  and other major cryptocurrencies are faring even worse, with ether falling 7% since this time yesterday and its biggest rivals    , ,  and  all dropping between 8% and 12%. Terra's  is struggling despite moves from the Luna      Guard Foundation and Terra Labs to shore up the coin, itself designed to support the algorithmic stablecoin TerraUSD      (UST). See below for details. PROMOTED  Do Kwon, co-founder and chief executive officer of Terraform Labs, pictured at the company's office ... [+] in Seoul in April. After Terra's algorithmic stablecoin TerraUSD (UST) briefly lost its dollar peg over the weekend, the Luna Foundation Guard (LFG) has announced this morning it will lend out hundreds of millions of dollars worth of bitcoin and the stablecoin UST in order to maintain it. The Singapore-based LFG said it would loan $750 million worth of bitcoin to trading companies as well as $750 million in UST to accumulate bitcoin in an attempt to stabilize the market. It's thought UST struggled to maintain its dollar peg due to large quantities of UST being withdrawn from liquidity pools on decentralized exchange Curve, while $192 million of UST was dumped. In a now-deleted tweet Do Kwon, the founder of the project's developer Terra Labs, seemed to hint that the sell-off may have been an orchestrated effort to make UST lose its peg. Kwon later sought to reassure the community, posting to Twitter the loans shouldn't be seen as LFG trying to exit its bitcoin position but rather increasing the liquidity around the UST peg. \"As markets recover, we plan to have the [UST] loan redeemed to us in bitcoin, increasing the size of our total reserves,\" Kwon . Some aren't keen on the plan, with bitcoin podcaster Peter McCormack  it \"smells like the Fed buying U.S. bonds in crypto land.\" The price of Terra's luna, designed to help UST maintain that dollar peg, has collapsed over the last week, crashing 25% and plunging the total value of luna coins to just $20 billion—a mere $1.4 billion more than the UST market capitalization. UST relies on luna to keep its price of a dollar via a set of on-chain mint and burn mechanisms. Both UST and luna have surged into the CoinMarketCap crypto top ten over recent months and UST is one of the largest algorithmic stablecoins. LFG is non-profit group that was formed in January to support the Terra ecosystem as well as \"the sustainability and stability of Terra’s algorithmic stablecoins\" and plans to accumulate a $10 billion bitcoin-based reserve intended to serve as a support mechanism for UST's peg. So far, it's bought up around $3 billion worth of bitcoin. LFG's governing council includes some of the biggest names in decentralized finance (DeFi), such as Jump Crypto president Kanav Kariya.  📑 Coinbase, arguably the most important crypto exchange and platform, will report its first-quarter earnings tomorrow and  (despite bullish predictions from ). Coinbase stock has crashed along with the bitcoin and crypto market over the last few months and is now down 70% from its market debut. 📉 Desktop and mobile-web traffic has plunged 26% in the first quarter from a year earlier, according to data collected by analytics company Similarweb. Mobile app installs in March were down 67% from April 2021, the month the company went public. 🏷️ Meanwhile, reaction to Coinbase's new non-fungible token (NFT) marketplace has been broadly negative. Nick Tomaino of crypto investment firm 1confirmation, who's also former Coinbase employee, launched a scathing attack on the company via , saying the current Coinbase's current NFT platform \"is not it\" and promising to sell all his Coinbase shares \"if the company doesn't make a strong move in NFTs in the next year.\"  👀 Look out for these cryptocurrency and crypto-related events this week. 🤳 Today, Facebook parent company Meta will open its first , a \"physical retail space\" on its campus in Burlingame, California. Over the weekend, Coindesk  Meta’s Instagram will support NFTs from ethereum, polygon, solana and flow. - 🪙 Tomorrow, major U.S. crypto exchange Coinbase will post its first-quarter results amid a severe market downturn. 🎈 Wednesday brings the latest U.S. inflation data in the form of the consumer price index (CPI). The data is expected inflation peaked last month at 8.5%. - 👨‍💻 Also Wednesday, Google's      annual I/O developer conference gets underway. - 🛡️ On Thursday, Microsoft's Security Summit kicks off, featuring tech demos and discussions on the modern-day cyber threat landscape. ",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "37,854",
            "summary": "The following is an excerpt from the daily CryptoCodex email newsletter. Sign up now for free here..."
        }
    },
    {
        "postid": 18,
        "date": "May 8, 2022",
        "title": "‘Extreme Fear’ Crypto Crash Suddenly Wipes $200 Billion From The Price Of Bitcoin, Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/08/extreme-fear-crypto-crash-suddenly-wipes-200-billion-from-the-price-of-bitcoin-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days ().  The bitcoin price has dropped to under $35,000, its lowest since July last year, as \"extreme fear\" grips traders in the aftermath of . Ethereum and other top ten cryptocurrencies BNB     , XRP     , luna, solana, cardano and avalanche are also struggling with market sentiment falling to lows not seen since January. — The bitcoin price has lost 10% from its price this last week, dragging down the price of ethereum, ... [+] BNB, XRP, solana, cardano, luna and avalanche. This week's bitcoin and crypto crash has triggered a sharp fall in market sentiment, as measured by the Bitcoin Fear and Green Index which collects data from social media posts, surveys, volatility and trading volume. The gauge has now fallen into \"extreme fear\" territory, dropping further after trending lower through April. Stock markets have also lost ground this week with the Nasdaq recording its longest weekly losing streak since 2012. \"The correlation between cryptocurrency and equities has been discussed fairly extensively after bitcoin and the tech-heavy Nasdaq displayed a higher positive correlation than was initially expected,\" Tammy Da Costa, an analyst at DailyFX, wrote in emailed comments, noting that predictions made before Russia's war in Ukraine were made under the assumption that once interest rates began to rise, supply and demand would meet. \"Over the past week, fundamentals have included interest rate expectations and nobody can ignore the ongoing war which continues to place pressure on supply constraints, particularly for commodities.\" Market pressure, weighing on both crypto and equities, includes concerns over soaring inflation, an increasingly hawkish Federal Reserve and fears over a consumer spending pullback.  The bitcoin price has been trending downward for the past month, mirrored by the price of other ... [+] major cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Smaller cryptocurrencies that have outpaced the likes of bitcoin and ethereum in recent months have fallen harder during this latest crash. \"The future of individual coins or tokens remains dubious, the law remains in control of such solicitations and the approval of social media giants such as Elon Musk,\" added Da Costa. Terra's luna, used to stabilize the price of the protocol's stablecoins, has crashed more than 20% in the last week alone even as the Luna      Foundation Guard bought $1.5 billion in bitcoin to bolster the reserves of its most popular stablecoin UST     . Some have  a \"massive UST sell-off\" on the decentralized exchange Curve sparked rumors UST could lose its peg to the dollar, in turn causing the price of luna to fall further. The rumors were dismissed by Terra creator Do Kwon on .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "89,532",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days."
        }
    },
    {
        "postid": 19,
        "date": "May 7, 2022",
        "title": "‘A De Facto Ban’—Serious Bitcoin Warning Issued As Price Crash Hits Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/07/a-de-facto-ban-serious-bitcoin-warning-issued-as-price-crash-hits-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply this week as a broad asset price crash tanks markets ().  The bitcoin price has lost around 10% over the last few days, crashing to levels not seen since January. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche have plunged, with Ripple's XRP      and Terra's luna also falling—. Ahead of , the chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned that governments are going to try to ban bitcoin and other cryptocurrencies. — The bitcoin and crypto market has gone into free fall, with the price of ethereum, BNB, XRP, solana, ... [+] cardano, luna and avalanche dropping sharply. \"What we're seeing around the world, which is really concerning to me, is using the attack on proof-of-work, and in particular, bitcoin's energy usage, as a way to implement a de facto ban on bitcoin without saying it,\" said Demirors, speaking during the Crypto Bahamas conference it was reported by . Proof-of-work is the name for bitcoin's decentralized consensus mechanism that lets so-called bitcoin miners secure the network and validate transactions in return for new coins. Some newer cryptocurrencies, such as ethereum rivals solana and cardano, have adopted a less energy-intensive consensus mechanism called proof-of-stake. Ethereum is trying to transition to proof-of-stake to better scale and reduce its carbon footprint. Bitcoin, by far the largest cryptocurrency by value, has been widely criticized for its eye-watering energy demands, by some estimates thought to use as much electricity per year as some small countries. In recent years, as the soaring bitcoin price has caused an influx of miners, lawmakers and regulators around the world have begun weighing whether to ban proof-of-work crypto mining. Last year, a crypto crackdown in China resulted in a miner mass exodus from the country, with many relocating to the U.S. and Europe. \"Governments are going to try to ban bitcoin, they're going to try to attack bitcoin because it's really difficult to do otherwise,\" Demirors said. This week, the state of New York has come  to an effective bitcoin mining ban with a bill calling for a two-year moratorium on proof-of-work cryptocurrency mining operations unless the company uses 100% renewable energy and until the state can complete an impact study progressing through the State Assembly.  The bitcoin price has swung wildly over the last year, losing around 40% from its peak of almost ... [+] $70,000 per bitcoin and dragging down the price of ethereum, BNB, XRP, solana, cardano, luna, and avalanche. Last month, —and their desire to \"protect\" the likes of ethereum. Earlier, environmental activist organization Greenpeace launched a lobbying campaign, funded by the billionaire co-founder of XRP developer Ripple, urging the bitcoin community to consider switching to proof-of-stake. \"A lot of the information [lawmakers are] getting is from other protocols lobbying for this,\" Demirors added. Speaking alongside Demirors, Elizabeth Stark, the chief executive of bitcoin payments developer Lighting Labs, echoed her concerns. \"I believe there are a lot of actors out there that are intentionally trying to attack bitcoin because there's no CEO,\" said Stark.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "51,219",
            "summary": "The chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned governments are going to try to ban bitcoin and other cryptocurrencies..."
        }
    },
    {
        "postid": 20,
        "date": "May 5, 2022",
        "title": "$100 Billion Crypto Crash Sends The Price Of Bitcoin, Ethereum, XRP, Luna, Solana, Cardano And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/05/100-billion-crypto-crash-sends-bitcoin-ethereum-xrp-luna-solana-cardano-and-avalanche-into-free-fall/",
        "article": " Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes ().  The bitcoin price is down around 5% over the last 24 hours, with the ethereum price seeing a similar decline. Ethereum rivals solana, cardano, and avalanche are all down around 3% while Ripple's XRP      and Terra's luna are leading the major crypto market lower. The sudden crash comes amid a technology company-led stock market sell-off in the aftermath of . — A huge crypto price sell-off has wiped around $100 billion worth of value from the market as the ... [+] price of bitcoin, ethereum, XRP, solana, cardano, luna and avalanche suddenly tank. \"Bitcoin’s struggle is by no means in isolation–the S&P 500 [has fallen] to a new record low for the year,\" Sam Kopelman, the U.K. manager for bitcoin and crypto exchange Luno, said in emailed comments and warning bitcoin could \"slip back into the previously found $36,000-$37,000 support range.\" However, Kopelman is upbeat about the bitcoin price but less positive about other major coins such as ethereum, XRP, solana, cardano, luna and avalanche. \"Overall, 2022 has generally seen crypto market participants climbing down the risk ladder, selling their smaller coins for blue-chip coins like bitcoin,\" said Kopelman.  The bitcoin price has suddenly dropped under its recent $38,000 per bitcoin support level. The market has had a delayed response to the Federal Reserve's biggest rate hike since 2000, first spiking on Wednesday's news and leading market watchers to believe the potentially \"bearish event\" to have been \"priced in.\" \"The market clearly priced in this bearish event during the weeks leading up to the FOMC meeting, where we saw significant sell pressure,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, said in emailed comments following the Fed's decision. Earlier this week, .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "81,511",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes..."
        }
    },
    {
        "postid": 21,
        "date": "May 4, 2022",
        "title": "Coinbase CEO Issues Stunning Crypto Prediction As The Price Of Bitcoin And Ethereum Suddenly Soar",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/04/coinbase-ceo-issues-stunning-crypto-prediction-as-the-price-of-bitcoin-and-ethereum-suddenly-soar/",
        "article": " Bitcoin      and ethereum, the two largest cryptocurrencies by a considerable margin, boast hundreds of millions of users around the world after a huge price explosion in recent years.  The bitcoin price soared to almost $70,000 per bitcoin late last year, up from under $10,000 two years ago, while the ethereum price has seen a similar rise. Both are down by around 40% from their all-time highs, however. Now, Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade—forecasting 1 billion people will have used crypto by 2032. — Coinbase chief executive Brian Armstrong is one of the most influential voices in the world of ... [+] bitcoin, ethereum and crypto. \"My guess is that in 10-20 years, we’ll see a substantial portion of GDP happening in the crypto economy,\" said Armstrong, speaking at the Milken Institute Global Conference this week in comments first reported by . Coinbase, based in San Francisco, currently has almost 90 million verified users across 100 countries. The \"crypto economy\" has grown rapidly over the last few years as businesses and services spring up around bitcoin, ethereum and other cryptocurrencies. Decentralized finance (DeFi)—the idea that crypto technology can replace lenders and insurers—and blockchain-based digital collectibles known as non-fungible tokens (NFTs) have both become multi-billion dollar markets in just a couple of years. Some of the world's largest technology companies, including Facebook's parent Meta and Elon Musk's electric car company Tesla     , have begun adopting crypto. Meta, under chief executive Mark Zuckerberg, is looking to expand into the so-called metaverse digital world where NFTs are expected to play a significant role. Tesla has added bitcoin to its corporate balance sheet and has begun experimenting with crypto payments. Financial giants on Wall Street have also slowly started to roll out crypto services to clients. Speaking alongside Armstrong, Ark Investment Management's chief executive, Cathie Wood, one of the biggest backers of web3—a name for the crypto and blockchain-based next-generation of the internet that some think could succeed the current Silicon Valley-centric model—warned financial companies not to fall behind. \"In the case of DeFi and next-generation internet, we are seeing a lot of financial companies losing talent to crypto,\" Wood said, according to Bloomberg. \"So they have to take it seriously, or else they are going to be hollowed out.\"  The bitcoin price has rocketed higher in recent years, adding many thousands of percent and helping ... [+] the ethereum price to surge. Meanwhile, the crypto industry is feeling upbeat about the evolving regulatory landscape following a Biden administration executive order directing federal agencies to collaborate on a rule book for blockchain businesses. \"It’s been harder and harder to meet a true crypto skeptic in D.C.,\" Armstrong added, speculating that around half of people in Washington are now pro-crypto. Crypto industry lobbying has exploded along with the bitcoin price over the last couple of years, research has found. The price of bitcoin, ethereum and other major cryptocurrencies have rallied this week, climbing on the back of a closely-telegraphed Federal Reserve interest rate hike that some had feared could be more hawkish than anticipated and following several positive global bitcoin and crypto developments. \"An increasing number of countries are legalizing bitcoin as a currency, embracing its ability to strengthen financial infrastructure, facilitate wealth creation, and afford direct access to financial resources,\" Matt Senter, chief technology officer at bitcoin rewards app Lolli, said in emailed comments. \"With the devaluation of the U.S. dollar due to inflation, we are now finding ourselves in the perfect storm catalyzing global mainstream adoption of bitcoin as an anti-inflationary, disintermediated alternative to our legacy financial system in crisis.”",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "231,357",
            "summary": "Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade..."
        }
    },
    {
        "postid": 22,
        "date": "May 3, 2022",
        "title": "Crypto Price Alert: Fed Triggers Stark $10,000 Bitcoin Crash Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/crypto-price-alert-fed-triggers-stark-10000-bitcoin-warning/",
        "article": " Bitcoin      and cryptocurrency prices have been stuck in a holding pattern ahead of the .  as central bank monetary tightening squeezes assets across the board. The Fed is widely expected to hike rates by 50 basis points—the biggest rate increase in 22 years—in order to temper soaring inflation. Now, a veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price—despite historical data suggesting May could be . — Federal Reserve chairman Jerome Powell will hold a press conference after the Wednesday interest ... [+] rate decision is released. Fears of Fed tightening have weighed on the bitcoin price and stock markets. \"The completion of a bear channel typically results in a decline equal to the width of the channel, or in this case a hard test of $32,000 or so—my guess is $28,000,\" Peter Brandt, the chief executive of trading service Factor,  to Twitter alongside a chart showing the bitcoin price trending downward. While bitcoin, cryptocurrencies and stock markets are on high alert ahead of the Fed's interest rate decision, traders are even more closely attuned to comments from Fed chair Jerome Powell who will speak at a press conference following the 2pm ET release of the statement. \"Fed meetings always signal uncertainty and volatility, which may impact not only digital assets but also broad markets as a whole,\" Eric Chen, chief executive of decentralized exchange protocol injective developer Injective Labs, said in emailed comments. \"But crypto markets are more attached to the underlying technology and value behind the projects and larger market trends over time have only proven that fact.\" Looking back over recent trends, the month of May has historically been the fourth-best month for bitcoin, analysis by Coindesk showed, with the bitcoin price making gains in seven of the past 11 years.  The bitcoin price has crashed back from its all-time high of almost $70,000 per bitcoin set in ... [+] November last year. \"In terms of seasonality, May is considered a relative success for BTC. Over the past 11 years, bitcoin has ended the month up seven times and down four times,\" Alex Kuptsikevich, senior market analyst at FxPro, said in emailed comments. The bitcoin price has found a floor in recent weeks, repeatedly hitting support at around $38,000 as positive bitcoin and crypto developments roll in. Central African Republic has followed El Salvador in adopting bitcoin as legal tender, while Panama has signaled it's increasingly interested in crypto. Wall Street giant Goldman Sachs last week offered its first-ever lending facility backed by bitcoin, called a \"significant step\" by . \"I still believe crypto is the most optimal hedge against these macroeconomic issues which is why institutional interest in the industry has only continued to grow,\" added Chen. \"Both venture capital funding and fund deployments into crypto are soaring at one of the fastest levels since the inception of bitcoin.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "54,077",
            "summary": "A veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price..."
        }
    },
    {
        "postid": 23,
        "date": "May 3, 2022",
        "title": "Huge 2022 Ethereum Price Prediction Comes With A Serious BNB, Solana, Cardano, Avalanche And Polkadot Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/huge-2022-ethereum-price-prediction-comes-with-a-serious-bnb-solana-cardano-avalanche-and-polkadot-warning/",
        "article": " Ethereum, the second-largest cryptocurrency after bitcoin, has seen its price swing wildly over the last year—.  The ethereum price has lost around 43% since its peak of almost $5,000 per ether set late last year. Meanwhile, smart contract rivals BNB     , solana, cardano, avalanche and polkadot have seen similar volatility. Now, a panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800. — The ethereum price has dropped over the last year as rivals such as Binance's BNB, solana, cardano, ... [+] avalanche and polkadot win market share. The panel, made up of 36 people from the world of crypto and put together by financial comparison website , has returned a lower average ethereum price prediction for the end of 2022 than it did in January, revising down the year-end price target by just over 10% due to emerging competition from rival blockchains such as BNB, solana, cardano, avalanche and polkadot. \"Ethereum is at a very uncertain place in its journey at the moment,\" Keegan Francis, Finder's cryptocurrency editor, said in a statement. \"Ethereum is currently losing DeFi market share to its competitors, although it still remains dominant by a huge margin ... I don't think ethereum will be the second cryptocurrency forever.\" The ethereum price has rocketed over the last two years in part due to soaring interest in so-called decentralized finance (DeFi)—using crypto technology to recreate traditional financial services without the need for a bank—and the ongoing non-fungible token (NFT) craze that has been adopted by the world's of music, sport and gaming and is largely built on the ethereum blockchain. However, a long-awaited ethereum upgrade, designed to help the network scale, reduce its sky-high fees and ease its carbon footprint, has again been pushed back—now due for late 2022.  The ethereum price has seen extreme volatility over the last 12 months though bullish price ... [+] predictions continue to forecast a recovery even as BNB, solana, cardano, avalanche and polkadot steal attention. \"People have been waiting for [ethereum's merge upgrade] for years,\" said panel memeber and Thomson Reuters      technologist, Joseph Raczynski. \"It should be far more secure, 99% more energy-efficient, and deflationary. If that isn't the trifecta of potential, as a leading blockchain, I don't know what would be.\" Looking further ahead, the panel returned an ethereum price prediction of almost $12,000 by 2025, around four-fold its current price. \"Until ethereum upgrades its systems and fulfills its promises to scale, I do not have long-term confidence in the network,\" said Francis, but adding, \"I still think people will buy the token out of hype, promise and potential.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "139,665",
            "summary": "A panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800..."
        }
    },
    {
        "postid": 24,
        "date": "May 1, 2022",
        "title": "Bitcoin And Crypto Now Braced For A $9 Trillion Fed Earthquake As The Price Of Ethereum, BNB, Solana, Cardano, XRP, Terra’s Luna And Avalanche Crater",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/01/bitcoin-and-crypto-braced-for-a-9-trillion-earthquake-as-the-price-of-ethereum-bnb-solana-cardano-xrp-terras-luna-and-avalanche-crater/",
        "article": " Bitcoin      and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve ().  The bitcoin price has lost around 40% from its peak of almost $70,000 per bitcoin late last year with the ethereum price also down by nearly half. Other major coins—including Binance's BNB     , Ripple's XRP     , solana, cardano, Terra's luna and avalanche—have also plunged, wiping $1.2 trillion from the combined crypto market in a matter of months. Now, after Federal Reserve chair Jerome Powell signaled a half percentage point interest rate hike is on the table at next week's meeting, the market is braced for the central bank to begin shrinking its huge $9 trillion asset portfolio as it battles soaring inflation. — Federal Reserve chair Jerome Powell has signaled the central bank was likely to raise interest rates ... [+] by a half percentage point at its upcoming meeting, putting bitcoin, crypto and stock prices under pressure. \"Macro uncertainty has driven all risk-on assets downwards over the last few months, including bitcoin,\" Joe Haggenmiller, head of markets at leading crypto finance company XBTO Group, said in emailed comments. \"Price volatility in the bitcoin market over the last few weeks can be attributed largely to its correlation to other risk assets, which in general have been moving in reaction to conflict in Ukraine, supply chain issues due to rising Covid cases in China, and ongoing interest rate hikes and future balance sheet machinations by the Federal Reserve.\" Early in the Covid-19 pandemic, the Federal Reserve began an unprecedented stimulus program that saw its balance sheet double and interest rates fall to historic lows as it flooded markets with cash in an effort to offset the economic damage of Covid-19 and lockdowns. As the pandemic has begun to recede and inflation has spiked, the Fed has pivoted to trying to cool the economy. \"It is appropriate in my view to be moving a little more quickly [than the Fed has recently],\" Powell said last week, speaking after a panel discussion with European Central Bank President Christine Lagarde hosted by the International Monetary Fund, adding he thinks \"there’s something in the idea of front-end loading\" those moves. However, economic data has this week shown the U.S. economy shrank in the first three months of the year, contracting by 0.4% in the first quarter, its weakest quarter since the early days of the pandemic. \"This is bullish for risk assets like bitcoin and equities in my opinion, as the Federal Reserve may become less hawkish to avoid a recession,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, wrote in an emailed note. Bitcoin, crypto and stock market traders are watching carefully for any sign the Fed will stray from its telegraphed move when it meets this week. \"An increase higher than 50 basis points, deviating from the current consensus, may lead to a drop in risk markets including bitcoin,\" added Haggenmiller. \"Regardless, the bitcoin market has proved to be relatively resilient in the long term throughout periods of uncertainty.\"  The bitcoin price has fallen sharply from its all-time high, dragging down the price of other top ... [+] ten cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Meanwhile, the bitcoin and crypto community has cheered a series of positive developments this week, including Central African Republic becoming the second country after El Salvador to adopt bitcoin as legal tender and investment giant Fidelity announcing the launch of 401k bitcoin accounts. \"Recently, bitcoin has reached a new phase of mainstream adoption: companies and countries are now integrating bitcoin without waiting for bitcoin’s price to skyrocket,\" Alex Adelman, the chief executive of bitcoin rewards app Lolli. \"This lack of correlation between price moves and increasing mainstream adoption demonstrates that more institutions are grasping bitcoin’s immense utility as a currency and store of value and its inevitable, powerful role in our financial future.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "1,038,186",
            "summary": "Bitcoin﻿ and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve..."
        }
    },
    {
        "postid": 25,
        "date": "May 11, 2022",
        "title": "Going ‘To Zero’—Panic Is Sweeping Crypto Markets, Hitting The Price Of Bitcoin, Ethereum, BNB, XRP, Cardano, Solana, Terra’s Luna And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/11/going-to-zero-panic-is-sweeping-crypto-markets-hitting-the-price-of-bitcoin-ethereum-bnb-xrp-cardano-solana-terras-luna-and-avalanche/",
        "article": " Bitcoin      and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg ().  The bitcoin price has dipped back toward $30,000 per bitcoin after plunging under the closely-watched level earlier this week. Ethereum and its major rivals BNB     , solana, cardano and avalanche have also crashed. Solana      and avalanche are leading the major market lower with a 10% and 20% decline respectively. Terra's luna, a cryptocurrency designed to support UST's one-to-one peg with the U.S. dollar, has lost almost 90% of its value over the last week as traders offload the cryptocurrency. — The bitcoin and crypto market has gone into free fall this week, with the price of ethereum, BNB, ... [+] XRP, solana, cardano and avalanche collapsing along with Terra's stablecoin UST and its luna cryptocurrency. \"Crypto markets have been under pressure given macro events (tighter monetary policy, surging inflation, Russia’s invasion of Ukraine) and the correlation between bitcoin and global equities is high,\" Jaime Baeza, the chief executive of Miami-based crypto hedge fund ANB Investments, said in emailed comments. \"However, the most recent fall in crypto prices is more due to the de-peg of the UST.\" UST, which was the biggest algorithmic stablecoin by market value, had a market capitalization of around $18 billion last week. It started to lose its peg to the dollar on Saturday, and on Monday traded as low as 60 cents. This morning it has dipped to around 30 cents. The Luna Foundation Guard, a group created to support the UST dollar peg, has said it will defend its price by selling its $3 billion bitcoin reserves. \"This accelerated the selloff of the broader crypto market as panic spread, and a more black swan systemic-risk event loomed closer,\" Baeza said. UST is designed so traders can exchange 1 UST for $1 worth of luna, no matter the price of UST. The Luna Foundation Guard was in the process of building up a $10 billion bitcoin-based crypto reserve when the crash happened.  The price of Terra's luna has fallen sharply, dragging down the price of bitcoin, ethereum, BNB, ... [+] XRP, solana, cardano and avalanche. Do Kown, the creator of UST and luna developer Terra Labs, has promised another bailout is imminent. On Tuesday, Kwon said he was \"getting close\" to \"announcing a recovery plan for UST,\" helping the price to rally but it has since fallen back. \"With the [UST] peg gone, luna will go to zero by design (as arbitrageurs buy UST and sell luna) unless parity and trust are restored, which can only be done by means of a significant cash infusion and changes in the protocol,\" trader Alex Krüger  to Twitter. UST began to lose its dollar peg last week amid a broader asset crash that hit bitcoin, crypto prices, including luna, and stock markets. Some have speculated a seller was flooding the market with UST over the weekend to attack the stablecoin. Meanwhile, around $5 billion worth of UST was drained out of the luna-based decentralized finance lending application Anchor.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "389,027",
            "summary": "Bitcoin﻿ and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg..."
        }
    },
    {
        "postid": 26,
        "date": "May 9, 2022",
        "title": "Serious ‘Ripple’ Warning After Massive $400 Billion Crypto Crash Suddenly Plunges Bitcoin, Ethereum, BNB, XRP, Solana, Cardano, Terra’s Luna And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/serious-ripple-warning-after-massive-400-billion-crypto-crash-suddenly-plunges-bitcoin-ethereum-bnb-xrp-solana-cardano-terras-luna-and-avalanche-into-free-fall/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday.  The bitcoin price has fallen dramatically toward $30,000 per bitcoin, down 20% from over $40,000 last week. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche had fallen even more steeply, each losing between 15% and 20%. Ripple's XRP      is also down around 15%. The brutal bitcoin and crypto price crash was triggered , also crashing stock markets, and then exacerbated by the fast-growing algorithmic stablecoin TerraUSD (UST) struggling to maintain its $1 peg as its support cryptocurrency luna leads market lower with a blistering 30% plummet. — The bitcoin price has been trending down over the last month but has recently crashed, dragging down ... [+] the price of ethereum, BNB, solana, cardano, XRP, luna, and avalanche. “In highly volatile markets, all asset classes will move in lockstep,\" Michael Safai, managing partner at crypto trading firm Dexterity Capital, said in emailed comments, pointing to soaring inflation and fears over more Fed monetary tightening worrying investors. Safai warned that if the bitcoin price crashes under $30,000 fears over \"ripple effects\" will spread. \"Enthusiasm for what’s being built in crypto hasn’t faded, but if we go further below $30,000, the market will naturally be worried about the ripple effects, such as miners turning their machines off as they move out of profitability. $25,000 isn’t a worst-case scenario here, and the market may be bracing itself for that reality.\" Other bitcoin and crypto market watchers have also warned over sell-off \"momentum\" building. \"Investors exiting positions may be adding some momentum to the protracted sell-off that we’ve witnessed over the past few days,\" analysts at Bitfinex wrote in an emailed note. That momentum was partly driven by , falling further today even after Do Kwon, the founder of the project's developer Terra Labs,  to \"deploy more capital\" to help maintain the UST price.  The bitcoin price has crashed to just over $30,000 per bitcoin over the last month, losing almost ... [+] 30% from its total value amid a broader crypto crash that's tanked ethereum, BNB, XRP, solana, cardano and avalanche. However, some have pointed to this week's U.S. inflation data, due Wednesday, as potentially offering some relief to both crypto and stock markets. \"All is not lost for bitcoin yet,\" Yuya Hasegawa, crypto market analyst at Bitbank, wrote in emailed comments. \"April’s U.S. consumer price index (CPI), which will be the main event for the week, could be a turning point for the price. If the CPI shows no sign of slowing down, it will add to the fear of faster monetary tightening, but other inflation metrics are starting to slow down and the April CPI could follow suit, which in turn will likely alleviate the market’s concern and help recover its risk sentiment.\" The president of El Salvador, who has spearheaded the country's adoption and accumulation of bitcoin over the last year, remains bullish on bitcoin,  he's \"bought the dip\" by adding 500 bitcoins at an average price of around $30,744 to El Salvador's stash.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "102,457",
            "summary": "Bitcoin﻿, ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday..."
        }
    },
    {
        "postid": 27,
        "date": "May 9, 2022",
        "title": "CryptoCodex: Crypto Now Braced For A Coinbase Bombshell After Bitcoin And Ethereum Price Collapse",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/cryptocodex-crypto-now-braced-for-coinbase-bombshell-after-bitcoin-and-ethereum-price-collapse/",
        "article": " The following is an excerpt from the daily CryptoCodex email newsletter. Cryptocurrency prices have moved sharply lower , falling to lows not seen since last summer. Microsoft      billionaire Bill Gates yesterday warned rising interest rates will probably cause a global economic recession, telling CNN a combination of rate hikes and soaring commodity prices mean \"the bears on this one have a pretty strong argument that concerns me a lot.\" The  price has this morning dropped to under $33,000, down more than 20% over the last 30 days.  and other major cryptocurrencies are faring even worse, with ether falling 7% since this time yesterday and its biggest rivals    , ,  and  all dropping between 8% and 12%. Terra's  is struggling despite moves from the Luna      Guard Foundation and Terra Labs to shore up the coin, itself designed to support the algorithmic stablecoin TerraUSD      (UST). See below for details.  Do Kwon, co-founder and chief executive officer of Terraform Labs, pictured at the company's office ... [+] in Seoul in April. After Terra's algorithmic stablecoin TerraUSD (UST) briefly lost its dollar peg over the weekend, the Luna Foundation Guard (LFG) has announced this morning it will lend out hundreds of millions of dollars worth of bitcoin and the stablecoin UST in order to maintain it. The Singapore-based LFG said it would loan $750 million worth of bitcoin to trading companies as well as $750 million in UST to accumulate bitcoin in an attempt to stabilize the market. It's thought UST struggled to maintain its dollar peg due to large quantities of UST being withdrawn from liquidity pools on decentralized exchange Curve, while $192 million of UST was dumped. In a now-deleted tweet Do Kwon, the founder of the project's developer Terra Labs, seemed to hint that the sell-off may have been an orchestrated effort to make UST lose its peg. Kwon later sought to reassure the community, posting to Twitter the loans shouldn't be seen as LFG trying to exit its bitcoin position but rather increasing the liquidity around the UST peg. \"As markets recover, we plan to have the [UST] loan redeemed to us in bitcoin, increasing the size of our total reserves,\" Kwon . Some aren't keen on the plan, with bitcoin podcaster Peter McCormack  it \"smells like the Fed buying U.S. bonds in crypto land.\" The price of Terra's luna, designed to help UST maintain that dollar peg, has collapsed over the last week, crashing 25% and plunging the total value of luna coins to just $20 billion—a mere $1.4 billion more than the UST market capitalization. UST relies on luna to keep its price of a dollar via a set of on-chain mint and burn mechanisms. Both UST and luna have surged into the CoinMarketCap crypto top ten over recent months and UST is one of the largest algorithmic stablecoins. LFG is non-profit group that was formed in January to support the Terra ecosystem as well as \"the sustainability and stability of Terra’s algorithmic stablecoins\" and plans to accumulate a $10 billion bitcoin-based reserve intended to serve as a support mechanism for UST's peg. So far, it's bought up around $3 billion worth of bitcoin. LFG's governing council includes some of the biggest names in decentralized finance (DeFi), such as Jump Crypto president Kanav Kariya.  📑 Coinbase, arguably the most important crypto exchange and platform, will report its first-quarter earnings tomorrow and  (despite bullish predictions from ). Coinbase stock has crashed along with the bitcoin and crypto market over the last few months and is now down 70% from its market debut. 📉 Desktop and mobile-web traffic has plunged 26% in the first quarter from a year earlier, according to data collected by analytics company Similarweb. Mobile app installs in March were down 67% from April 2021, the month the company went public. 🏷️ Meanwhile, reaction to Coinbase's new non-fungible token (NFT) marketplace has been broadly negative. Nick Tomaino of crypto investment firm 1confirmation, who's also former Coinbase employee, launched a scathing attack on the company via , saying the current Coinbase's current NFT platform \"is not it\" and promising to sell all his Coinbase shares \"if the company doesn't make a strong move in NFTs in the next year.\"  👀 Look out for these cryptocurrency and crypto-related events this week. 🤳 Today, Facebook parent company Meta will open its first , a \"physical retail space\" on its campus in Burlingame, California. Over the weekend, Coindesk  Meta’s Instagram will support NFTs from ethereum, polygon, solana and flow. - 🪙 Tomorrow, major U.S. crypto exchange Coinbase will post its first-quarter results amid a severe market downturn. 🎈 Wednesday brings the latest U.S. inflation data in the form of the consumer price index (CPI). The data is expected inflation peaked last month at 8.5%. - 👨‍💻 Also Wednesday, Google's      annual I/O developer conference gets underway. - 🛡️ On Thursday, Microsoft's Security Summit kicks off, featuring tech demos and discussions on the modern-day cyber threat landscape. ",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "37,854",
            "summary": "The following is an excerpt from the daily CryptoCodex email newsletter. Sign up now for free here..."
        }
    },
    {
        "postid": 28,
        "date": "May 8, 2022",
        "title": "‘Extreme Fear’ Crypto Crash Suddenly Wipes $200 Billion From The Price Of Bitcoin, Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/08/extreme-fear-crypto-crash-suddenly-wipes-200-billion-from-the-price-of-bitcoin-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days ().  The bitcoin price has dropped to under $35,000, its lowest since July last year, as \"extreme fear\" grips traders in the aftermath of . Ethereum and other top ten cryptocurrencies BNB     , XRP     , luna, solana, cardano and avalanche are also struggling with market sentiment falling to lows not seen since January. — The bitcoin price has lost 10% from its price this last week, dragging down the price of ethereum, ... [+] BNB, XRP, solana, cardano, luna and avalanche. This week's bitcoin and crypto crash has triggered a sharp fall in market sentiment, as measured by the Bitcoin Fear and Green Index which collects data from social media posts, surveys, volatility and trading volume. The gauge has now fallen into \"extreme fear\" territory, dropping further after trending lower through April. Stock markets have also lost ground this week with the Nasdaq recording its longest weekly losing streak since 2012. \"The correlation between cryptocurrency and equities has been discussed fairly extensively after bitcoin and the tech-heavy Nasdaq displayed a higher positive correlation than was initially expected,\" Tammy Da Costa, an analyst at DailyFX, wrote in emailed comments, noting that predictions made before Russia's war in Ukraine were made under the assumption that once interest rates began to rise, supply and demand would meet. \"Over the past week, fundamentals have included interest rate expectations and nobody can ignore the ongoing war which continues to place pressure on supply constraints, particularly for commodities.\" Market pressure, weighing on both crypto and equities, includes concerns over soaring inflation, an increasingly hawkish Federal Reserve and fears over a consumer spending pullback.  The bitcoin price has been trending downward for the past month, mirrored by the price of other ... [+] major cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Smaller cryptocurrencies that have outpaced the likes of bitcoin and ethereum in recent months have fallen harder during this latest crash. \"The future of individual coins or tokens remains dubious, the law remains in control of such solicitations and the approval of social media giants such as Elon Musk,\" added Da Costa. Terra's luna, used to stabilize the price of the protocol's stablecoins, has crashed more than 20% in the last week alone even as the Luna      Foundation Guard bought $1.5 billion in bitcoin to bolster the reserves of its most popular stablecoin UST     . Some have  a \"massive UST sell-off\" on the decentralized exchange Curve sparked rumors UST could lose its peg to the dollar, in turn causing the price of luna to fall further. The rumors were dismissed by Terra creator Do Kwon on .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "89,532",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days."
        }
    },
    {
        "postid": 29,
        "date": "May 7, 2022",
        "title": "‘A De Facto Ban’—Serious Bitcoin Warning Issued As Price Crash Hits Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/07/a-de-facto-ban-serious-bitcoin-warning-issued-as-price-crash-hits-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply this week as a broad asset price crash tanks markets ().  The bitcoin price has lost around 10% over the last few days, crashing to levels not seen since January. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche have plunged, with Ripple's XRP      and Terra's luna also falling—. Ahead of , the chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned that governments are going to try to ban bitcoin and other cryptocurrencies. PROMOTED — The bitcoin and crypto market has gone into free fall, with the price of ethereum, BNB, XRP, solana, ... [+] cardano, luna and avalanche dropping sharply. \"What we're seeing around the world, which is really concerning to me, is using the attack on proof-of-work, and in particular, bitcoin's energy usage, as a way to implement a de facto ban on bitcoin without saying it,\" said Demirors, speaking during the Crypto Bahamas conference it was reported by . Proof-of-work is the name for bitcoin's decentralized consensus mechanism that lets so-called bitcoin miners secure the network and validate transactions in return for new coins. Some newer cryptocurrencies, such as ethereum rivals solana and cardano, have adopted a less energy-intensive consensus mechanism called proof-of-stake. Ethereum is trying to transition to proof-of-stake to better scale and reduce its carbon footprint. Bitcoin, by far the largest cryptocurrency by value, has been widely criticized for its eye-watering energy demands, by some estimates thought to use as much electricity per year as some small countries. In recent years, as the soaring bitcoin price has caused an influx of miners, lawmakers and regulators around the world have begun weighing whether to ban proof-of-work crypto mining. Last year, a crypto crackdown in China resulted in a miner mass exodus from the country, with many relocating to the U.S. and Europe. \"Governments are going to try to ban bitcoin, they're going to try to attack bitcoin because it's really difficult to do otherwise,\" Demirors said. This week, the state of New York has come  to an effective bitcoin mining ban with a bill calling for a two-year moratorium on proof-of-work cryptocurrency mining operations unless the company uses 100% renewable energy and until the state can complete an impact study progressing through the State Assembly.  The bitcoin price has swung wildly over the last year, losing around 40% from its peak of almost ... [+] $70,000 per bitcoin and dragging down the price of ethereum, BNB, XRP, solana, cardano, luna, and avalanche. Last month, —and their desire to \"protect\" the likes of ethereum. Earlier, environmental activist organization Greenpeace launched a lobbying campaign, funded by the billionaire co-founder of XRP developer Ripple, urging the bitcoin community to consider switching to proof-of-stake. \"A lot of the information [lawmakers are] getting is from other protocols lobbying for this,\" Demirors added. Speaking alongside Demirors, Elizabeth Stark, the chief executive of bitcoin payments developer Lighting Labs, echoed her concerns. \"I believe there are a lot of actors out there that are intentionally trying to attack bitcoin because there's no CEO,\" said Stark.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "51,219",
            "summary": "The chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned governments are going to try to ban bitcoin and other cryptocurrencies..."
        }
    },
    {
        "postid": 30,
        "date": "May 5, 2022",
        "title": "$100 Billion Crypto Crash Sends The Price Of Bitcoin, Ethereum, XRP, Luna, Solana, Cardano And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/05/100-billion-crypto-crash-sends-bitcoin-ethereum-xrp-luna-solana-cardano-and-avalanche-into-free-fall/",
        "article": " Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes ().  The bitcoin price is down around 5% over the last 24 hours, with the ethereum price seeing a similar decline. Ethereum rivals solana, cardano, and avalanche are all down around 3% while Ripple's XRP      and Terra's luna are leading the major crypto market lower. The sudden crash comes amid a technology company-led stock market sell-off in the aftermath of . — A huge crypto price sell-off has wiped around $100 billion worth of value from the market as the ... [+] price of bitcoin, ethereum, XRP, solana, cardano, luna and avalanche suddenly tank. \"Bitcoin’s struggle is by no means in isolation–the S&P 500 [has fallen] to a new record low for the year,\" Sam Kopelman, the U.K. manager for bitcoin and crypto exchange Luno, said in emailed comments and warning bitcoin could \"slip back into the previously found $36,000-$37,000 support range.\" However, Kopelman is upbeat about the bitcoin price but less positive about other major coins such as ethereum, XRP, solana, cardano, luna and avalanche. \"Overall, 2022 has generally seen crypto market participants climbing down the risk ladder, selling their smaller coins for blue-chip coins like bitcoin,\" said Kopelman.  The bitcoin price has suddenly dropped under its recent $38,000 per bitcoin support level. The market has had a delayed response to the Federal Reserve's biggest rate hike since 2000, first spiking on Wednesday's news and leading market watchers to believe the potentially \"bearish event\" to have been \"priced in.\" \"The market clearly priced in this bearish event during the weeks leading up to the FOMC meeting, where we saw significant sell pressure,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, said in emailed comments following the Fed's decision. Earlier this week, .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "81,511",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes..."
        }
    },
    {
        "postid": 31,
        "date": "May 4, 2022",
        "title": "Coinbase CEO Issues Stunning Crypto Prediction As The Price Of Bitcoin And Ethereum Suddenly Soar",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/04/coinbase-ceo-issues-stunning-crypto-prediction-as-the-price-of-bitcoin-and-ethereum-suddenly-soar/",
        "article": " Bitcoin      and ethereum, the two largest cryptocurrencies by a considerable margin, boast hundreds of millions of users around the world after a huge price explosion in recent years.  The bitcoin price soared to almost $70,000 per bitcoin late last year, up from under $10,000 two years ago, while the ethereum price has seen a similar rise. Both are down by around 40% from their all-time highs, however. Now, Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade—forecasting 1 billion people will have used crypto by 2032. — Coinbase chief executive Brian Armstrong is one of the most influential voices in the world of ... [+] bitcoin, ethereum and crypto. \"My guess is that in 10-20 years, we’ll see a substantial portion of GDP happening in the crypto economy,\" said Armstrong, speaking at the Milken Institute Global Conference this week in comments first reported by . Coinbase, based in San Francisco, currently has almost 90 million verified users across 100 countries. The \"crypto economy\" has grown rapidly over the last few years as businesses and services spring up around bitcoin, ethereum and other cryptocurrencies. Decentralized finance (DeFi)—the idea that crypto technology can replace lenders and insurers—and blockchain-based digital collectibles known as non-fungible tokens (NFTs) have both become multi-billion dollar markets in just a couple of years. Some of the world's largest technology companies, including Facebook's parent Meta and Elon Musk's electric car company Tesla     , have begun adopting crypto. Meta, under chief executive Mark Zuckerberg, is looking to expand into the so-called metaverse digital world where NFTs are expected to play a significant role. Tesla has added bitcoin to its corporate balance sheet and has begun experimenting with crypto payments. Financial giants on Wall Street have also slowly started to roll out crypto services to clients. Speaking alongside Armstrong, Ark Investment Management's chief executive, Cathie Wood, one of the biggest backers of web3—a name for the crypto and blockchain-based next-generation of the internet that some think could succeed the current Silicon Valley-centric model—warned financial companies not to fall behind. \"In the case of DeFi and next-generation internet, we are seeing a lot of financial companies losing talent to crypto,\" Wood said, according to Bloomberg. \"So they have to take it seriously, or else they are going to be hollowed out.\"  The bitcoin price has rocketed higher in recent years, adding many thousands of percent and helping ... [+] the ethereum price to surge. Meanwhile, the crypto industry is feeling upbeat about the evolving regulatory landscape following a Biden administration executive order directing federal agencies to collaborate on a rule book for blockchain businesses. \"It’s been harder and harder to meet a true crypto skeptic in D.C.,\" Armstrong added, speculating that around half of people in Washington are now pro-crypto. Crypto industry lobbying has exploded along with the bitcoin price over the last couple of years, research has found. The price of bitcoin, ethereum and other major cryptocurrencies have rallied this week, climbing on the back of a closely-telegraphed Federal Reserve interest rate hike that some had feared could be more hawkish than anticipated and following several positive global bitcoin and crypto developments. \"An increasing number of countries are legalizing bitcoin as a currency, embracing its ability to strengthen financial infrastructure, facilitate wealth creation, and afford direct access to financial resources,\" Matt Senter, chief technology officer at bitcoin rewards app Lolli, said in emailed comments. \"With the devaluation of the U.S. dollar due to inflation, we are now finding ourselves in the perfect storm catalyzing global mainstream adoption of bitcoin as an anti-inflationary, disintermediated alternative to our legacy financial system in crisis.”",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "231,357",
            "summary": "Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade..."
        }
    },
    {
        "postid": 32,
        "date": "May 3, 2022",
        "title": "Crypto Price Alert: Fed Triggers Stark $10,000 Bitcoin Crash Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/crypto-price-alert-fed-triggers-stark-10000-bitcoin-warning/",
        "article": " Bitcoin      and cryptocurrency prices have been stuck in a holding pattern ahead of the .  as central bank monetary tightening squeezes assets across the board. The Fed is widely expected to hike rates by 50 basis points—the biggest rate increase in 22 years—in order to temper soaring inflation. Now, a veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price—despite historical data suggesting May could be . — Federal Reserve chairman Jerome Powell will hold a press conference after the Wednesday interest ... [+] rate decision is released. Fears of Fed tightening have weighed on the bitcoin price and stock markets. \"The completion of a bear channel typically results in a decline equal to the width of the channel, or in this case a hard test of $32,000 or so—my guess is $28,000,\" Peter Brandt, the chief executive of trading service Factor,  to Twitter alongside a chart showing the bitcoin price trending downward. While bitcoin, cryptocurrencies and stock markets are on high alert ahead of the Fed's interest rate decision, traders are even more closely attuned to comments from Fed chair Jerome Powell who will speak at a press conference following the 2pm ET release of the statement. \"Fed meetings always signal uncertainty and volatility, which may impact not only digital assets but also broad markets as a whole,\" Eric Chen, chief executive of decentralized exchange protocol injective developer Injective Labs, said in emailed comments. \"But crypto markets are more attached to the underlying technology and value behind the projects and larger market trends over time have only proven that fact.\" Looking back over recent trends, the month of May has historically been the fourth-best month for bitcoin, analysis by Coindesk showed, with the bitcoin price making gains in seven of the past 11 years.  The bitcoin price has crashed back from its all-time high of almost $70,000 per bitcoin set in ... [+] November last year. \"In terms of seasonality, May is considered a relative success for BTC. Over the past 11 years, bitcoin has ended the month up seven times and down four times,\" Alex Kuptsikevich, senior market analyst at FxPro, said in emailed comments. The bitcoin price has found a floor in recent weeks, repeatedly hitting support at around $38,000 as positive bitcoin and crypto developments roll in. Central African Republic has followed El Salvador in adopting bitcoin as legal tender, while Panama has signaled it's increasingly interested in crypto. Wall Street giant Goldman Sachs last week offered its first-ever lending facility backed by bitcoin, called a \"significant step\" by . \"I still believe crypto is the most optimal hedge against these macroeconomic issues which is why institutional interest in the industry has only continued to grow,\" added Chen. \"Both venture capital funding and fund deployments into crypto are soaring at one of the fastest levels since the inception of bitcoin.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "54,077",
            "summary": "A veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price..."
        }
    },
    {
        "postid": 33,
        "date": "May 3, 2022",
        "title": "Huge 2022 Ethereum Price Prediction Comes With A Serious BNB, Solana, Cardano, Avalanche And Polkadot Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/huge-2022-ethereum-price-prediction-comes-with-a-serious-bnb-solana-cardano-avalanche-and-polkadot-warning/",
        "article": " Ethereum, the second-largest cryptocurrency after bitcoin, has seen its price swing wildly over the last year—.  The ethereum price has lost around 43% since its peak of almost $5,000 per ether set late last year. Meanwhile, smart contract rivals BNB     , solana, cardano, avalanche and polkadot have seen similar volatility. Now, a panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800. — The ethereum price has dropped over the last year as rivals such as Binance's BNB, solana, cardano, ... [+] avalanche and polkadot win market share. The panel, made up of 36 people from the world of crypto and put together by financial comparison website , has returned a lower average ethereum price prediction for the end of 2022 than it did in January, revising down the year-end price target by just over 10% due to emerging competition from rival blockchains such as BNB, solana, cardano, avalanche and polkadot. \"Ethereum is at a very uncertain place in its journey at the moment,\" Keegan Francis, Finder's cryptocurrency editor, said in a statement. \"Ethereum is currently losing DeFi market share to its competitors, although it still remains dominant by a huge margin ... I don't think ethereum will be the second cryptocurrency forever.\" The ethereum price has rocketed over the last two years in part due to soaring interest in so-called decentralized finance (DeFi)—using crypto technology to recreate traditional financial services without the need for a bank—and the ongoing non-fungible token (NFT) craze that has been adopted by the world's of music, sport and gaming and is largely built on the ethereum blockchain. However, a long-awaited ethereum upgrade, designed to help the network scale, reduce its sky-high fees and ease its carbon footprint, has again been pushed back—now due for late 2022.  The ethereum price has seen extreme volatility over the last 12 months though bullish price ... [+] predictions continue to forecast a recovery even as BNB, solana, cardano, avalanche and polkadot steal attention. \"People have been waiting for [ethereum's merge upgrade] for years,\" said panel memeber and Thomson Reuters      technologist, Joseph Raczynski. \"It should be far more secure, 99% more energy-efficient, and deflationary. If that isn't the trifecta of potential, as a leading blockchain, I don't know what would be.\" Looking further ahead, the panel returned an ethereum price prediction of almost $12,000 by 2025, around four-fold its current price. \"Until ethereum upgrades its systems and fulfills its promises to scale, I do not have long-term confidence in the network,\" said Francis, but adding, \"I still think people will buy the token out of hype, promise and potential.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "139,665",
            "summary": "A panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800..."
        }
    },
    {
        "postid": 34,
        "date": "May 1, 2022",
        "title": "Bitcoin And Crypto Now Braced For A $9 Trillion Fed Earthquake As The Price Of Ethereum, BNB, Solana, Cardano, XRP, Terra’s Luna And Avalanche Crater",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/01/bitcoin-and-crypto-braced-for-a-9-trillion-earthquake-as-the-price-of-ethereum-bnb-solana-cardano-xrp-terras-luna-and-avalanche-crater/",
        "article": " Bitcoin      and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve ().  The bitcoin price has lost around 40% from its peak of almost $70,000 per bitcoin late last year with the ethereum price also down by nearly half. Other major coins—including Binance's BNB     , Ripple's XRP     , solana, cardano, Terra's luna and avalanche—have also plunged, wiping $1.2 trillion from the combined crypto market in a matter of months. Now, after Federal Reserve chair Jerome Powell signaled a half percentage point interest rate hike is on the table at next week's meeting, the market is braced for the central bank to begin shrinking its huge $9 trillion asset portfolio as it battles soaring inflation. — Federal Reserve chair Jerome Powell has signaled the central bank was likely to raise interest rates ... [+] by a half percentage point at its upcoming meeting, putting bitcoin, crypto and stock prices under pressure. \"Macro uncertainty has driven all risk-on assets downwards over the last few months, including bitcoin,\" Joe Haggenmiller, head of markets at leading crypto finance company XBTO Group, said in emailed comments. \"Price volatility in the bitcoin market over the last few weeks can be attributed largely to its correlation to other risk assets, which in general have been moving in reaction to conflict in Ukraine, supply chain issues due to rising Covid cases in China, and ongoing interest rate hikes and future balance sheet machinations by the Federal Reserve.\" Early in the Covid-19 pandemic, the Federal Reserve began an unprecedented stimulus program that saw its balance sheet double and interest rates fall to historic lows as it flooded markets with cash in an effort to offset the economic damage of Covid-19 and lockdowns. As the pandemic has begun to recede and inflation has spiked, the Fed has pivoted to trying to cool the economy. \"It is appropriate in my view to be moving a little more quickly [than the Fed has recently],\" Powell said last week, speaking after a panel discussion with European Central Bank President Christine Lagarde hosted by the International Monetary Fund, adding he thinks \"there’s something in the idea of front-end loading\" those moves. However, economic data has this week shown the U.S. economy shrank in the first three months of the year, contracting by 0.4% in the first quarter, its weakest quarter since the early days of the pandemic. \"This is bullish for risk assets like bitcoin and equities in my opinion, as the Federal Reserve may become less hawkish to avoid a recession,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, wrote in an emailed note. Bitcoin, crypto and stock market traders are watching carefully for any sign the Fed will stray from its telegraphed move when it meets this week. \"An increase higher than 50 basis points, deviating from the current consensus, may lead to a drop in risk markets including bitcoin,\" added Haggenmiller. \"Regardless, the bitcoin market has proved to be relatively resilient in the long term throughout periods of uncertainty.\"  The bitcoin price has fallen sharply from its all-time high, dragging down the price of other top ... [+] ten cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Meanwhile, the bitcoin and crypto community has cheered a series of positive developments this week, including Central African Republic becoming the second country after El Salvador to adopt bitcoin as legal tender and investment giant Fidelity announcing the launch of 401k bitcoin accounts. \"Recently, bitcoin has reached a new phase of mainstream adoption: companies and countries are now integrating bitcoin without waiting for bitcoin’s price to skyrocket,\" Alex Adelman, the chief executive of bitcoin rewards app Lolli. \"This lack of correlation between price moves and increasing mainstream adoption demonstrates that more institutions are grasping bitcoin’s immense utility as a currency and store of value and its inevitable, powerful role in our financial future.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "1,038,186",
            "summary": "Bitcoin﻿ and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve..."
        }
    },
    {
        "postid": 35,
        "date": "May 11, 2022",
        "title": "Going ‘To Zero’—Panic Is Sweeping Crypto Markets, Hitting The Price Of Bitcoin, Ethereum, BNB, XRP, Cardano, Solana, Terra’s Luna And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/11/going-to-zero-panic-is-sweeping-crypto-markets-hitting-the-price-of-bitcoin-ethereum-bnb-xrp-cardano-solana-terras-luna-and-avalanche/",
        "article": " Bitcoin      and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg ().  The bitcoin price has dipped back toward $30,000 per bitcoin after plunging under the closely-watched level earlier this week. Ethereum and its major rivals BNB     , solana, cardano and avalanche have also crashed. Solana      and avalanche are leading the major market lower with a 10% and 20% decline respectively. Terra's luna, a cryptocurrency designed to support UST's one-to-one peg with the U.S. dollar, has lost almost 90% of its value over the last week as traders offload the cryptocurrency. — The bitcoin and crypto market has gone into free fall this week, with the price of ethereum, BNB, ... [+] XRP, solana, cardano and avalanche collapsing along with Terra's stablecoin UST and its luna cryptocurrency. \"Crypto markets have been under pressure given macro events (tighter monetary policy, surging inflation, Russia’s invasion of Ukraine) and the correlation between bitcoin and global equities is high,\" Jaime Baeza, the chief executive of Miami-based crypto hedge fund ANB Investments, said in emailed comments. \"However, the most recent fall in crypto prices is more due to the de-peg of the UST.\" UST, which was the biggest algorithmic stablecoin by market value, had a market capitalization of around $18 billion last week. It started to lose its peg to the dollar on Saturday, and on Monday traded as low as 60 cents. This morning it has dipped to around 30 cents. The Luna Foundation Guard, a group created to support the UST dollar peg, has said it will defend its price by selling its $3 billion bitcoin reserves. \"This accelerated the selloff of the broader crypto market as panic spread, and a more black swan systemic-risk event loomed closer,\" Baeza said. UST is designed so traders can exchange 1 UST for $1 worth of luna, no matter the price of UST. The Luna Foundation Guard was in the process of building up a $10 billion bitcoin-based crypto reserve when the crash happened.  The price of Terra's luna has fallen sharply, dragging down the price of bitcoin, ethereum, BNB, ... [+] XRP, solana, cardano and avalanche. Do Kown, the creator of UST and luna developer Terra Labs, has promised another bailout is imminent. On Tuesday, Kwon said he was \"getting close\" to \"announcing a recovery plan for UST,\" helping the price to rally but it has since fallen back. \"With the [UST] peg gone, luna will go to zero by design (as arbitrageurs buy UST and sell luna) unless parity and trust are restored, which can only be done by means of a significant cash infusion and changes in the protocol,\" trader Alex Krüger  to Twitter. UST began to lose its dollar peg last week amid a broader asset crash that hit bitcoin, crypto prices, including luna, and stock markets. Some have speculated a seller was flooding the market with UST over the weekend to attack the stablecoin. Meanwhile, around $5 billion worth of UST was drained out of the luna-based decentralized finance lending application Anchor.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "389,027",
            "summary": "Bitcoin﻿ and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg..."
        }
    },
    {
        "postid": 36,
        "date": "May 9, 2022",
        "title": "Serious ‘Ripple’ Warning After Massive $400 Billion Crypto Crash Suddenly Plunges Bitcoin, Ethereum, BNB, XRP, Solana, Cardano, Terra’s Luna And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/serious-ripple-warning-after-massive-400-billion-crypto-crash-suddenly-plunges-bitcoin-ethereum-bnb-xrp-solana-cardano-terras-luna-and-avalanche-into-free-fall/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday.  The bitcoin price has fallen dramatically toward $30,000 per bitcoin, down 20% from over $40,000 last week. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche had fallen even more steeply, each losing between 15% and 20%. Ripple's XRP      is also down around 15%. The brutal bitcoin and crypto price crash was triggered , also crashing stock markets, and then exacerbated by the fast-growing algorithmic stablecoin TerraUSD (UST) struggling to maintain its $1 peg as its support cryptocurrency luna leads market lower with a blistering 30% plummet. — The bitcoin price has been trending down over the last month but has recently crashed, dragging down ... [+] the price of ethereum, BNB, solana, cardano, XRP, luna, and avalanche. “In highly volatile markets, all asset classes will move in lockstep,\" Michael Safai, managing partner at crypto trading firm Dexterity Capital, said in emailed comments, pointing to soaring inflation and fears over more Fed monetary tightening worrying investors. Safai warned that if the bitcoin price crashes under $30,000 fears over \"ripple effects\" will spread. \"Enthusiasm for what’s being built in crypto hasn’t faded, but if we go further below $30,000, the market will naturally be worried about the ripple effects, such as miners turning their machines off as they move out of profitability. $25,000 isn’t a worst-case scenario here, and the market may be bracing itself for that reality.\" Other bitcoin and crypto market watchers have also warned over sell-off \"momentum\" building. \"Investors exiting positions may be adding some momentum to the protracted sell-off that we’ve witnessed over the past few days,\" analysts at Bitfinex wrote in an emailed note. That momentum was partly driven by , falling further today even after Do Kwon, the founder of the project's developer Terra Labs,  to \"deploy more capital\" to help maintain the UST price.  The bitcoin price has crashed to just over $30,000 per bitcoin over the last month, losing almost ... [+] 30% from its total value amid a broader crypto crash that's tanked ethereum, BNB, XRP, solana, cardano and avalanche. However, some have pointed to this week's U.S. inflation data, due Wednesday, as potentially offering some relief to both crypto and stock markets. \"All is not lost for bitcoin yet,\" Yuya Hasegawa, crypto market analyst at Bitbank, wrote in emailed comments. \"April’s U.S. consumer price index (CPI), which will be the main event for the week, could be a turning point for the price. If the CPI shows no sign of slowing down, it will add to the fear of faster monetary tightening, but other inflation metrics are starting to slow down and the April CPI could follow suit, which in turn will likely alleviate the market’s concern and help recover its risk sentiment.\" The president of El Salvador, who has spearheaded the country's adoption and accumulation of bitcoin over the last year, remains bullish on bitcoin,  he's \"bought the dip\" by adding 500 bitcoins at an average price of around $30,744 to El Salvador's stash.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "102,457",
            "summary": "Bitcoin﻿, ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday..."
        }
    },
    {
        "postid": 37,
        "date": "May 9, 2022",
        "title": "CryptoCodex: Crypto Now Braced For A Coinbase Bombshell After Bitcoin And Ethereum Price Collapse",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/cryptocodex-crypto-now-braced-for-coinbase-bombshell-after-bitcoin-and-ethereum-price-collapse/",
        "article": " The following is an excerpt from the daily CryptoCodex email newsletter. Cryptocurrency prices have moved sharply lower , falling to lows not seen since last summer. Microsoft      billionaire Bill Gates yesterday warned rising interest rates will probably cause a global economic recession, telling CNN a combination of rate hikes and soaring commodity prices mean \"the bears on this one have a pretty strong argument that concerns me a lot.\" The  price has this morning dropped to under $33,000, down more than 20% over the last 30 days.  and other major cryptocurrencies are faring even worse, with ether falling 7% since this time yesterday and its biggest rivals    , ,  and  all dropping between 8% and 12%. Terra's  is struggling despite moves from the Luna      Guard Foundation and Terra Labs to shore up the coin, itself designed to support the algorithmic stablecoin TerraUSD      (UST). See below for details.  Do Kwon, co-founder and chief executive officer of Terraform Labs, pictured at the company's office ... [+] in Seoul in April. After Terra's algorithmic stablecoin TerraUSD (UST) briefly lost its dollar peg over the weekend, the Luna Foundation Guard (LFG) has announced this morning it will lend out hundreds of millions of dollars worth of bitcoin and the stablecoin UST in order to maintain it. The Singapore-based LFG said it would loan $750 million worth of bitcoin to trading companies as well as $750 million in UST to accumulate bitcoin in an attempt to stabilize the market. It's thought UST struggled to maintain its dollar peg due to large quantities of UST being withdrawn from liquidity pools on decentralized exchange Curve, while $192 million of UST was dumped. In a now-deleted tweet Do Kwon, the founder of the project's developer Terra Labs, seemed to hint that the sell-off may have been an orchestrated effort to make UST lose its peg. Kwon later sought to reassure the community, posting to Twitter the loans shouldn't be seen as LFG trying to exit its bitcoin position but rather increasing the liquidity around the UST peg. \"As markets recover, we plan to have the [UST] loan redeemed to us in bitcoin, increasing the size of our total reserves,\" Kwon . Some aren't keen on the plan, with bitcoin podcaster Peter McCormack  it \"smells like the Fed buying U.S. bonds in crypto land.\" The price of Terra's luna, designed to help UST maintain that dollar peg, has collapsed over the last week, crashing 25% and plunging the total value of luna coins to just $20 billion—a mere $1.4 billion more than the UST market capitalization. UST relies on luna to keep its price of a dollar via a set of on-chain mint and burn mechanisms. Both UST and luna have surged into the CoinMarketCap crypto top ten over recent months and UST is one of the largest algorithmic stablecoins. LFG is non-profit group that was formed in January to support the Terra ecosystem as well as \"the sustainability and stability of Terra’s algorithmic stablecoins\" and plans to accumulate a $10 billion bitcoin-based reserve intended to serve as a support mechanism for UST's peg. So far, it's bought up around $3 billion worth of bitcoin. LFG's governing council includes some of the biggest names in decentralized finance (DeFi), such as Jump Crypto president Kanav Kariya.  📑 Coinbase, arguably the most important crypto exchange and platform, will report its first-quarter earnings tomorrow and  (despite bullish predictions from ). Coinbase stock has crashed along with the bitcoin and crypto market over the last few months and is now down 70% from its market debut. 📉 Desktop and mobile-web traffic has plunged 26% in the first quarter from a year earlier, according to data collected by analytics company Similarweb. Mobile app installs in March were down 67% from April 2021, the month the company went public. 🏷️ Meanwhile, reaction to Coinbase's new non-fungible token (NFT) marketplace has been broadly negative. Nick Tomaino of crypto investment firm 1confirmation, who's also former Coinbase employee, launched a scathing attack on the company via , saying the current Coinbase's current NFT platform \"is not it\" and promising to sell all his Coinbase shares \"if the company doesn't make a strong move in NFTs in the next year.\"  👀 Look out for these cryptocurrency and crypto-related events this week. 🤳 Today, Facebook parent company Meta will open its first , a \"physical retail space\" on its campus in Burlingame, California. Over the weekend, Coindesk  Meta’s Instagram will support NFTs from ethereum, polygon, solana and flow. - 🪙 Tomorrow, major U.S. crypto exchange Coinbase will post its first-quarter results amid a severe market downturn. 🎈 Wednesday brings the latest U.S. inflation data in the form of the consumer price index (CPI). The data is expected inflation peaked last month at 8.5%. - 👨‍💻 Also Wednesday, Google's      annual I/O developer conference gets underway. - 🛡️ On Thursday, Microsoft's Security Summit kicks off, featuring tech demos and discussions on the modern-day cyber threat landscape. ",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "37,854",
            "summary": "The following is an excerpt from the daily CryptoCodex email newsletter. Sign up now for free here..."
        }
    },
    {
        "postid": 38,
        "date": "May 8, 2022",
        "title": "‘Extreme Fear’ Crypto Crash Suddenly Wipes $200 Billion From The Price Of Bitcoin, Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/08/extreme-fear-crypto-crash-suddenly-wipes-200-billion-from-the-price-of-bitcoin-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days ().  The bitcoin price has dropped to under $35,000, its lowest since July last year, as \"extreme fear\" grips traders in the aftermath of . Ethereum and other top ten cryptocurrencies BNB     , XRP     , luna, solana, cardano and avalanche are also struggling with market sentiment falling to lows not seen since January. — The bitcoin price has lost 10% from its price this last week, dragging down the price of ethereum, ... [+] BNB, XRP, solana, cardano, luna and avalanche. This week's bitcoin and crypto crash has triggered a sharp fall in market sentiment, as measured by the Bitcoin Fear and Green Index which collects data from social media posts, surveys, volatility and trading volume. The gauge has now fallen into \"extreme fear\" territory, dropping further after trending lower through April. Stock markets have also lost ground this week with the Nasdaq recording its longest weekly losing streak since 2012. \"The correlation between cryptocurrency and equities has been discussed fairly extensively after bitcoin and the tech-heavy Nasdaq displayed a higher positive correlation than was initially expected,\" Tammy Da Costa, an analyst at DailyFX, wrote in emailed comments, noting that predictions made before Russia's war in Ukraine were made under the assumption that once interest rates began to rise, supply and demand would meet. \"Over the past week, fundamentals have included interest rate expectations and nobody can ignore the ongoing war which continues to place pressure on supply constraints, particularly for commodities.\" Market pressure, weighing on both crypto and equities, includes concerns over soaring inflation, an increasingly hawkish Federal Reserve and fears over a consumer spending pullback.  The bitcoin price has been trending downward for the past month, mirrored by the price of other ... [+] major cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Smaller cryptocurrencies that have outpaced the likes of bitcoin and ethereum in recent months have fallen harder during this latest crash. \"The future of individual coins or tokens remains dubious, the law remains in control of such solicitations and the approval of social media giants such as Elon Musk,\" added Da Costa. Terra's luna, used to stabilize the price of the protocol's stablecoins, has crashed more than 20% in the last week alone even as the Luna      Foundation Guard bought $1.5 billion in bitcoin to bolster the reserves of its most popular stablecoin UST     . Some have  a \"massive UST sell-off\" on the decentralized exchange Curve sparked rumors UST could lose its peg to the dollar, in turn causing the price of luna to fall further. The rumors were dismissed by Terra creator Do Kwon on .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "89,532",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days."
        }
    },
    {
        "postid": 39,
        "date": "May 7, 2022",
        "title": "‘A De Facto Ban’—Serious Bitcoin Warning Issued As Price Crash Hits Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/07/a-de-facto-ban-serious-bitcoin-warning-issued-as-price-crash-hits-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply this week as a broad asset price crash tanks markets ().  The bitcoin price has lost around 10% over the last few days, crashing to levels not seen since January. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche have plunged, with Ripple's XRP      and Terra's luna also falling—. Ahead of , the chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned that governments are going to try to ban bitcoin and other cryptocurrencies. — The bitcoin and crypto market has gone into free fall, with the price of ethereum, BNB, XRP, solana, ... [+] cardano, luna and avalanche dropping sharply. \"What we're seeing around the world, which is really concerning to me, is using the attack on proof-of-work, and in particular, bitcoin's energy usage, as a way to implement a de facto ban on bitcoin without saying it,\" said Demirors, speaking during the Crypto Bahamas conference it was reported by . Proof-of-work is the name for bitcoin's decentralized consensus mechanism that lets so-called bitcoin miners secure the network and validate transactions in return for new coins. Some newer cryptocurrencies, such as ethereum rivals solana and cardano, have adopted a less energy-intensive consensus mechanism called proof-of-stake. Ethereum is trying to transition to proof-of-stake to better scale and reduce its carbon footprint. Bitcoin, by far the largest cryptocurrency by value, has been widely criticized for its eye-watering energy demands, by some estimates thought to use as much electricity per year as some small countries. In recent years, as the soaring bitcoin price has caused an influx of miners, lawmakers and regulators around the world have begun weighing whether to ban proof-of-work crypto mining. Last year, a crypto crackdown in China resulted in a miner mass exodus from the country, with many relocating to the U.S. and Europe. \"Governments are going to try to ban bitcoin, they're going to try to attack bitcoin because it's really difficult to do otherwise,\" Demirors said. This week, the state of New York has come  to an effective bitcoin mining ban with a bill calling for a two-year moratorium on proof-of-work cryptocurrency mining operations unless the company uses 100% renewable energy and until the state can complete an impact study progressing through the State Assembly.  The bitcoin price has swung wildly over the last year, losing around 40% from its peak of almost ... [+] $70,000 per bitcoin and dragging down the price of ethereum, BNB, XRP, solana, cardano, luna, and avalanche. Last month, —and their desire to \"protect\" the likes of ethereum. Earlier, environmental activist organization Greenpeace launched a lobbying campaign, funded by the billionaire co-founder of XRP developer Ripple, urging the bitcoin community to consider switching to proof-of-stake. \"A lot of the information [lawmakers are] getting is from other protocols lobbying for this,\" Demirors added. Speaking alongside Demirors, Elizabeth Stark, the chief executive of bitcoin payments developer Lighting Labs, echoed her concerns. \"I believe there are a lot of actors out there that are intentionally trying to attack bitcoin because there's no CEO,\" said Stark.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "51,219",
            "summary": "The chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned governments are going to try to ban bitcoin and other cryptocurrencies..."
        }
    },
    {
        "postid": 40,
        "date": "May 5, 2022",
        "title": "$100 Billion Crypto Crash Sends The Price Of Bitcoin, Ethereum, XRP, Luna, Solana, Cardano And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/05/100-billion-crypto-crash-sends-bitcoin-ethereum-xrp-luna-solana-cardano-and-avalanche-into-free-fall/",
        "article": " Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes ().  The bitcoin price is down around 5% over the last 24 hours, with the ethereum price seeing a similar decline. Ethereum rivals solana, cardano, and avalanche are all down around 3% while Ripple's XRP      and Terra's luna are leading the major crypto market lower. The sudden crash comes amid a technology company-led stock market sell-off in the aftermath of . — A huge crypto price sell-off has wiped around $100 billion worth of value from the market as the ... [+] price of bitcoin, ethereum, XRP, solana, cardano, luna and avalanche suddenly tank. \"Bitcoin’s struggle is by no means in isolation–the S&P 500 [has fallen] to a new record low for the year,\" Sam Kopelman, the U.K. manager for bitcoin and crypto exchange Luno, said in emailed comments and warning bitcoin could \"slip back into the previously found $36,000-$37,000 support range.\" However, Kopelman is upbeat about the bitcoin price but less positive about other major coins such as ethereum, XRP, solana, cardano, luna and avalanche. \"Overall, 2022 has generally seen crypto market participants climbing down the risk ladder, selling their smaller coins for blue-chip coins like bitcoin,\" said Kopelman.  The bitcoin price has suddenly dropped under its recent $38,000 per bitcoin support level. The market has had a delayed response to the Federal Reserve's biggest rate hike since 2000, first spiking on Wednesday's news and leading market watchers to believe the potentially \"bearish event\" to have been \"priced in.\" \"The market clearly priced in this bearish event during the weeks leading up to the FOMC meeting, where we saw significant sell pressure,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, said in emailed comments following the Fed's decision. Earlier this week, .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "81,511",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes..."
        }
    },
    {
        "postid": 41,
        "date": "May 4, 2022",
        "title": "Coinbase CEO Issues Stunning Crypto Prediction As The Price Of Bitcoin And Ethereum Suddenly Soar",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/04/coinbase-ceo-issues-stunning-crypto-prediction-as-the-price-of-bitcoin-and-ethereum-suddenly-soar/",
        "article": " Bitcoin      and ethereum, the two largest cryptocurrencies by a considerable margin, boast hundreds of millions of users around the world after a huge price explosion in recent years.  The bitcoin price soared to almost $70,000 per bitcoin late last year, up from under $10,000 two years ago, while the ethereum price has seen a similar rise. Both are down by around 40% from their all-time highs, however. Now, Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade—forecasting 1 billion people will have used crypto by 2032. — Coinbase chief executive Brian Armstrong is one of the most influential voices in the world of ... [+] bitcoin, ethereum and crypto. \"My guess is that in 10-20 years, we’ll see a substantial portion of GDP happening in the crypto economy,\" said Armstrong, speaking at the Milken Institute Global Conference this week in comments first reported by . Coinbase, based in San Francisco, currently has almost 90 million verified users across 100 countries. The \"crypto economy\" has grown rapidly over the last few years as businesses and services spring up around bitcoin, ethereum and other cryptocurrencies. Decentralized finance (DeFi)—the idea that crypto technology can replace lenders and insurers—and blockchain-based digital collectibles known as non-fungible tokens (NFTs) have both become multi-billion dollar markets in just a couple of years. Some of the world's largest technology companies, including Facebook's parent Meta and Elon Musk's electric car company Tesla     , have begun adopting crypto. Meta, under chief executive Mark Zuckerberg, is looking to expand into the so-called metaverse digital world where NFTs are expected to play a significant role. Tesla has added bitcoin to its corporate balance sheet and has begun experimenting with crypto payments. Financial giants on Wall Street have also slowly started to roll out crypto services to clients. Speaking alongside Armstrong, Ark Investment Management's chief executive, Cathie Wood, one of the biggest backers of web3—a name for the crypto and blockchain-based next-generation of the internet that some think could succeed the current Silicon Valley-centric model—warned financial companies not to fall behind. \"In the case of DeFi and next-generation internet, we are seeing a lot of financial companies losing talent to crypto,\" Wood said, according to Bloomberg. \"So they have to take it seriously, or else they are going to be hollowed out.\"  The bitcoin price has rocketed higher in recent years, adding many thousands of percent and helping ... [+] the ethereum price to surge. Meanwhile, the crypto industry is feeling upbeat about the evolving regulatory landscape following a Biden administration executive order directing federal agencies to collaborate on a rule book for blockchain businesses. \"It’s been harder and harder to meet a true crypto skeptic in D.C.,\" Armstrong added, speculating that around half of people in Washington are now pro-crypto. Crypto industry lobbying has exploded along with the bitcoin price over the last couple of years, research has found. The price of bitcoin, ethereum and other major cryptocurrencies have rallied this week, climbing on the back of a closely-telegraphed Federal Reserve interest rate hike that some had feared could be more hawkish than anticipated and following several positive global bitcoin and crypto developments. \"An increasing number of countries are legalizing bitcoin as a currency, embracing its ability to strengthen financial infrastructure, facilitate wealth creation, and afford direct access to financial resources,\" Matt Senter, chief technology officer at bitcoin rewards app Lolli, said in emailed comments. \"With the devaluation of the U.S. dollar due to inflation, we are now finding ourselves in the perfect storm catalyzing global mainstream adoption of bitcoin as an anti-inflationary, disintermediated alternative to our legacy financial system in crisis.”",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "231,357",
            "summary": "Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade..."
        }
    },
    {
        "postid": 42,
        "date": "May 3, 2022",
        "title": "Crypto Price Alert: Fed Triggers Stark $10,000 Bitcoin Crash Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/crypto-price-alert-fed-triggers-stark-10000-bitcoin-warning/",
        "article": " Bitcoin      and cryptocurrency prices have been stuck in a holding pattern ahead of the .  as central bank monetary tightening squeezes assets across the board. The Fed is widely expected to hike rates by 50 basis points—the biggest rate increase in 22 years—in order to temper soaring inflation. Now, a veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price—despite historical data suggesting May could be . — Federal Reserve chairman Jerome Powell will hold a press conference after the Wednesday interest ... [+] rate decision is released. Fears of Fed tightening have weighed on the bitcoin price and stock markets. \"The completion of a bear channel typically results in a decline equal to the width of the channel, or in this case a hard test of $32,000 or so—my guess is $28,000,\" Peter Brandt, the chief executive of trading service Factor,  to Twitter alongside a chart showing the bitcoin price trending downward. While bitcoin, cryptocurrencies and stock markets are on high alert ahead of the Fed's interest rate decision, traders are even more closely attuned to comments from Fed chair Jerome Powell who will speak at a press conference following the 2pm ET release of the statement. \"Fed meetings always signal uncertainty and volatility, which may impact not only digital assets but also broad markets as a whole,\" Eric Chen, chief executive of decentralized exchange protocol injective developer Injective Labs, said in emailed comments. \"But crypto markets are more attached to the underlying technology and value behind the projects and larger market trends over time have only proven that fact.\" Looking back over recent trends, the month of May has historically been the fourth-best month for bitcoin, analysis by Coindesk showed, with the bitcoin price making gains in seven of the past 11 years.  The bitcoin price has crashed back from its all-time high of almost $70,000 per bitcoin set in ... [+] November last year. \"In terms of seasonality, May is considered a relative success for BTC. Over the past 11 years, bitcoin has ended the month up seven times and down four times,\" Alex Kuptsikevich, senior market analyst at FxPro, said in emailed comments. The bitcoin price has found a floor in recent weeks, repeatedly hitting support at around $38,000 as positive bitcoin and crypto developments roll in. Central African Republic has followed El Salvador in adopting bitcoin as legal tender, while Panama has signaled it's increasingly interested in crypto. Wall Street giant Goldman Sachs last week offered its first-ever lending facility backed by bitcoin, called a \"significant step\" by . \"I still believe crypto is the most optimal hedge against these macroeconomic issues which is why institutional interest in the industry has only continued to grow,\" added Chen. \"Both venture capital funding and fund deployments into crypto are soaring at one of the fastest levels since the inception of bitcoin.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "54,077",
            "summary": "A veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price..."
        }
    },
    {
        "postid": 43,
        "date": "May 3, 2022",
        "title": "Huge 2022 Ethereum Price Prediction Comes With A Serious BNB, Solana, Cardano, Avalanche And Polkadot Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/huge-2022-ethereum-price-prediction-comes-with-a-serious-bnb-solana-cardano-avalanche-and-polkadot-warning/",
        "article": " Ethereum, the second-largest cryptocurrency after bitcoin, has seen its price swing wildly over the last year—.  The ethereum price has lost around 43% since its peak of almost $5,000 per ether set late last year. Meanwhile, smart contract rivals BNB     , solana, cardano, avalanche and polkadot have seen similar volatility. Now, a panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800. — The ethereum price has dropped over the last year as rivals such as Binance's BNB, solana, cardano, ... [+] avalanche and polkadot win market share. The panel, made up of 36 people from the world of crypto and put together by financial comparison website , has returned a lower average ethereum price prediction for the end of 2022 than it did in January, revising down the year-end price target by just over 10% due to emerging competition from rival blockchains such as BNB, solana, cardano, avalanche and polkadot. \"Ethereum is at a very uncertain place in its journey at the moment,\" Keegan Francis, Finder's cryptocurrency editor, said in a statement. \"Ethereum is currently losing DeFi market share to its competitors, although it still remains dominant by a huge margin ... I don't think ethereum will be the second cryptocurrency forever.\" The ethereum price has rocketed over the last two years in part due to soaring interest in so-called decentralized finance (DeFi)—using crypto technology to recreate traditional financial services without the need for a bank—and the ongoing non-fungible token (NFT) craze that has been adopted by the world's of music, sport and gaming and is largely built on the ethereum blockchain. However, a long-awaited ethereum upgrade, designed to help the network scale, reduce its sky-high fees and ease its carbon footprint, has again been pushed back—now due for late 2022.  The ethereum price has seen extreme volatility over the last 12 months though bullish price ... [+] predictions continue to forecast a recovery even as BNB, solana, cardano, avalanche and polkadot steal attention. \"People have been waiting for [ethereum's merge upgrade] for years,\" said panel memeber and Thomson Reuters      technologist, Joseph Raczynski. \"It should be far more secure, 99% more energy-efficient, and deflationary. If that isn't the trifecta of potential, as a leading blockchain, I don't know what would be.\" Looking further ahead, the panel returned an ethereum price prediction of almost $12,000 by 2025, around four-fold its current price. \"Until ethereum upgrades its systems and fulfills its promises to scale, I do not have long-term confidence in the network,\" said Francis, but adding, \"I still think people will buy the token out of hype, promise and potential.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "139,665",
            "summary": "A panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800..."
        }
    },
    {
        "postid": 44,
        "date": "May 1, 2022",
        "title": "Bitcoin And Crypto Now Braced For A $9 Trillion Fed Earthquake As The Price Of Ethereum, BNB, Solana, Cardano, XRP, Terra’s Luna And Avalanche Crater",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/01/bitcoin-and-crypto-braced-for-a-9-trillion-earthquake-as-the-price-of-ethereum-bnb-solana-cardano-xrp-terras-luna-and-avalanche-crater/",
        "article": " Bitcoin      and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve ().  The bitcoin price has lost around 40% from its peak of almost $70,000 per bitcoin late last year with the ethereum price also down by nearly half. Other major coins—including Binance's BNB     , Ripple's XRP     , solana, cardano, Terra's luna and avalanche—have also plunged, wiping $1.2 trillion from the combined crypto market in a matter of months. Now, after Federal Reserve chair Jerome Powell signaled a half percentage point interest rate hike is on the table at next week's meeting, the market is braced for the central bank to begin shrinking its huge $9 trillion asset portfolio as it battles soaring inflation. — Federal Reserve chair Jerome Powell has signaled the central bank was likely to raise interest rates ... [+] by a half percentage point at its upcoming meeting, putting bitcoin, crypto and stock prices under pressure. \"Macro uncertainty has driven all risk-on assets downwards over the last few months, including bitcoin,\" Joe Haggenmiller, head of markets at leading crypto finance company XBTO Group, said in emailed comments. \"Price volatility in the bitcoin market over the last few weeks can be attributed largely to its correlation to other risk assets, which in general have been moving in reaction to conflict in Ukraine, supply chain issues due to rising Covid cases in China, and ongoing interest rate hikes and future balance sheet machinations by the Federal Reserve.\" Early in the Covid-19 pandemic, the Federal Reserve began an unprecedented stimulus program that saw its balance sheet double and interest rates fall to historic lows as it flooded markets with cash in an effort to offset the economic damage of Covid-19 and lockdowns. As the pandemic has begun to recede and inflation has spiked, the Fed has pivoted to trying to cool the economy. \"It is appropriate in my view to be moving a little more quickly [than the Fed has recently],\" Powell said last week, speaking after a panel discussion with European Central Bank President Christine Lagarde hosted by the International Monetary Fund, adding he thinks \"there’s something in the idea of front-end loading\" those moves. However, economic data has this week shown the U.S. economy shrank in the first three months of the year, contracting by 0.4% in the first quarter, its weakest quarter since the early days of the pandemic. \"This is bullish for risk assets like bitcoin and equities in my opinion, as the Federal Reserve may become less hawkish to avoid a recession,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, wrote in an emailed note. Bitcoin, crypto and stock market traders are watching carefully for any sign the Fed will stray from its telegraphed move when it meets this week. \"An increase higher than 50 basis points, deviating from the current consensus, may lead to a drop in risk markets including bitcoin,\" added Haggenmiller. \"Regardless, the bitcoin market has proved to be relatively resilient in the long term throughout periods of uncertainty.\"  The bitcoin price has fallen sharply from its all-time high, dragging down the price of other top ... [+] ten cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Meanwhile, the bitcoin and crypto community has cheered a series of positive developments this week, including Central African Republic becoming the second country after El Salvador to adopt bitcoin as legal tender and investment giant Fidelity announcing the launch of 401k bitcoin accounts. \"Recently, bitcoin has reached a new phase of mainstream adoption: companies and countries are now integrating bitcoin without waiting for bitcoin’s price to skyrocket,\" Alex Adelman, the chief executive of bitcoin rewards app Lolli. \"This lack of correlation between price moves and increasing mainstream adoption demonstrates that more institutions are grasping bitcoin’s immense utility as a currency and store of value and its inevitable, powerful role in our financial future.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "1,038,186",
            "summary": "Bitcoin﻿ and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve..."
        }
    },
    {
        "postid": 45,
        "date": "May 11, 2022",
        "title": "Going ‘To Zero’—Panic Is Sweeping Crypto Markets, Hitting The Price Of Bitcoin, Ethereum, BNB, XRP, Cardano, Solana, Terra’s Luna And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/11/going-to-zero-panic-is-sweeping-crypto-markets-hitting-the-price-of-bitcoin-ethereum-bnb-xrp-cardano-solana-terras-luna-and-avalanche/",
        "article": " Bitcoin      and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg ().  The bitcoin price has dipped back toward $30,000 per bitcoin after plunging under the closely-watched level earlier this week. Ethereum and its major rivals BNB     , solana, cardano and avalanche have also crashed. Solana      and avalanche are leading the major market lower with a 10% and 20% decline respectively. Terra's luna, a cryptocurrency designed to support UST's one-to-one peg with the U.S. dollar, has lost almost 90% of its value over the last week as traders offload the cryptocurrency. — The bitcoin and crypto market has gone into free fall this week, with the price of ethereum, BNB, ... [+] XRP, solana, cardano and avalanche collapsing along with Terra's stablecoin UST and its luna cryptocurrency. \"Crypto markets have been under pressure given macro events (tighter monetary policy, surging inflation, Russia’s invasion of Ukraine) and the correlation between bitcoin and global equities is high,\" Jaime Baeza, the chief executive of Miami-based crypto hedge fund ANB Investments, said in emailed comments. \"However, the most recent fall in crypto prices is more due to the de-peg of the UST.\" UST, which was the biggest algorithmic stablecoin by market value, had a market capitalization of around $18 billion last week. It started to lose its peg to the dollar on Saturday, and on Monday traded as low as 60 cents. This morning it has dipped to around 30 cents. The Luna Foundation Guard, a group created to support the UST dollar peg, has said it will defend its price by selling its $3 billion bitcoin reserves. \"This accelerated the selloff of the broader crypto market as panic spread, and a more black swan systemic-risk event loomed closer,\" Baeza said. UST is designed so traders can exchange 1 UST for $1 worth of luna, no matter the price of UST. The Luna Foundation Guard was in the process of building up a $10 billion bitcoin-based crypto reserve when the crash happened.  The price of Terra's luna has fallen sharply, dragging down the price of bitcoin, ethereum, BNB, ... [+] XRP, solana, cardano and avalanche. Do Kown, the creator of UST and luna developer Terra Labs, has promised another bailout is imminent. On Tuesday, Kwon said he was \"getting close\" to \"announcing a recovery plan for UST,\" helping the price to rally but it has since fallen back. \"With the [UST] peg gone, luna will go to zero by design (as arbitrageurs buy UST and sell luna) unless parity and trust are restored, which can only be done by means of a significant cash infusion and changes in the protocol,\" trader Alex Krüger  to Twitter. UST began to lose its dollar peg last week amid a broader asset crash that hit bitcoin, crypto prices, including luna, and stock markets. Some have speculated a seller was flooding the market with UST over the weekend to attack the stablecoin. Meanwhile, around $5 billion worth of UST was drained out of the luna-based decentralized finance lending application Anchor.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "389,027",
            "summary": "Bitcoin﻿ and cryptocurrency markets have fallen sharply after the controversial algorithmic stablecoin TerraUSD (UST) dropped further from its dollar peg..."
        }
    },
    {
        "postid": 46,
        "date": "May 9, 2022",
        "title": "Serious ‘Ripple’ Warning After Massive $400 Billion Crypto Crash Suddenly Plunges Bitcoin, Ethereum, BNB, XRP, Solana, Cardano, Terra’s Luna And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/serious-ripple-warning-after-massive-400-billion-crypto-crash-suddenly-plunges-bitcoin-ethereum-bnb-xrp-solana-cardano-terras-luna-and-avalanche-into-free-fall/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday.  The bitcoin price has fallen dramatically toward $30,000 per bitcoin, down 20% from over $40,000 last week. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche had fallen even more steeply, each losing between 15% and 20%. Ripple's XRP      is also down around 15%. The brutal bitcoin and crypto price crash was triggered , also crashing stock markets, and then exacerbated by the fast-growing algorithmic stablecoin TerraUSD (UST) struggling to maintain its $1 peg as its support cryptocurrency luna leads market lower with a blistering 30% plummet. — The bitcoin price has been trending down over the last month but has recently crashed, dragging down ... [+] the price of ethereum, BNB, solana, cardano, XRP, luna, and avalanche. “In highly volatile markets, all asset classes will move in lockstep,\" Michael Safai, managing partner at crypto trading firm Dexterity Capital, said in emailed comments, pointing to soaring inflation and fears over more Fed monetary tightening worrying investors. Safai warned that if the bitcoin price crashes under $30,000 fears over \"ripple effects\" will spread. \"Enthusiasm for what’s being built in crypto hasn’t faded, but if we go further below $30,000, the market will naturally be worried about the ripple effects, such as miners turning their machines off as they move out of profitability. $25,000 isn’t a worst-case scenario here, and the market may be bracing itself for that reality.\" Other bitcoin and crypto market watchers have also warned over sell-off \"momentum\" building. \"Investors exiting positions may be adding some momentum to the protracted sell-off that we’ve witnessed over the past few days,\" analysts at Bitfinex wrote in an emailed note. That momentum was partly driven by , falling further today even after Do Kwon, the founder of the project's developer Terra Labs,  to \"deploy more capital\" to help maintain the UST price.  The bitcoin price has crashed to just over $30,000 per bitcoin over the last month, losing almost ... [+] 30% from its total value amid a broader crypto crash that's tanked ethereum, BNB, XRP, solana, cardano and avalanche. However, some have pointed to this week's U.S. inflation data, due Wednesday, as potentially offering some relief to both crypto and stock markets. \"All is not lost for bitcoin yet,\" Yuya Hasegawa, crypto market analyst at Bitbank, wrote in emailed comments. \"April’s U.S. consumer price index (CPI), which will be the main event for the week, could be a turning point for the price. If the CPI shows no sign of slowing down, it will add to the fear of faster monetary tightening, but other inflation metrics are starting to slow down and the April CPI could follow suit, which in turn will likely alleviate the market’s concern and help recover its risk sentiment.\" The president of El Salvador, who has spearheaded the country's adoption and accumulation of bitcoin over the last year, remains bullish on bitcoin,  he's \"bought the dip\" by adding 500 bitcoins at an average price of around $30,744 to El Salvador's stash.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "102,457",
            "summary": "Bitcoin﻿, ethereum and other major cryptocurrencies have suddenly crashed, wiping $400 billion from the combined crypto market since Friday..."
        }
    },
    {
        "postid": 47,
        "date": "May 9, 2022",
        "title": "CryptoCodex: Crypto Now Braced For A Coinbase Bombshell After Bitcoin And Ethereum Price Collapse",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/09/cryptocodex-crypto-now-braced-for-coinbase-bombshell-after-bitcoin-and-ethereum-price-collapse/",
        "article": " The following is an excerpt from the daily CryptoCodex email newsletter. Cryptocurrency prices have moved sharply lower , falling to lows not seen since last summer. Microsoft      billionaire Bill Gates yesterday warned rising interest rates will probably cause a global economic recession, telling CNN a combination of rate hikes and soaring commodity prices mean \"the bears on this one have a pretty strong argument that concerns me a lot.\" The  price has this morning dropped to under $33,000, down more than 20% over the last 30 days.  and other major cryptocurrencies are faring even worse, with ether falling 7% since this time yesterday and its biggest rivals    , ,  and  all dropping between 8% and 12%. Terra's  is struggling despite moves from the Luna      Guard Foundation and Terra Labs to shore up the coin, itself designed to support the algorithmic stablecoin TerraUSD      (UST). See below for details.  Do Kwon, co-founder and chief executive officer of Terraform Labs, pictured at the company's office ... [+] in Seoul in April. After Terra's algorithmic stablecoin TerraUSD (UST) briefly lost its dollar peg over the weekend, the Luna Foundation Guard (LFG) has announced this morning it will lend out hundreds of millions of dollars worth of bitcoin and the stablecoin UST in order to maintain it. The Singapore-based LFG said it would loan $750 million worth of bitcoin to trading companies as well as $750 million in UST to accumulate bitcoin in an attempt to stabilize the market. It's thought UST struggled to maintain its dollar peg due to large quantities of UST being withdrawn from liquidity pools on decentralized exchange Curve, while $192 million of UST was dumped. In a now-deleted tweet Do Kwon, the founder of the project's developer Terra Labs, seemed to hint that the sell-off may have been an orchestrated effort to make UST lose its peg. Kwon later sought to reassure the community, posting to Twitter the loans shouldn't be seen as LFG trying to exit its bitcoin position but rather increasing the liquidity around the UST peg. \"As markets recover, we plan to have the [UST] loan redeemed to us in bitcoin, increasing the size of our total reserves,\" Kwon . Some aren't keen on the plan, with bitcoin podcaster Peter McCormack  it \"smells like the Fed buying U.S. bonds in crypto land.\" The price of Terra's luna, designed to help UST maintain that dollar peg, has collapsed over the last week, crashing 25% and plunging the total value of luna coins to just $20 billion—a mere $1.4 billion more than the UST market capitalization. UST relies on luna to keep its price of a dollar via a set of on-chain mint and burn mechanisms. Both UST and luna have surged into the CoinMarketCap crypto top ten over recent months and UST is one of the largest algorithmic stablecoins. LFG is non-profit group that was formed in January to support the Terra ecosystem as well as \"the sustainability and stability of Terra’s algorithmic stablecoins\" and plans to accumulate a $10 billion bitcoin-based reserve intended to serve as a support mechanism for UST's peg. So far, it's bought up around $3 billion worth of bitcoin. LFG's governing council includes some of the biggest names in decentralized finance (DeFi), such as Jump Crypto president Kanav Kariya.  📑 Coinbase, arguably the most important crypto exchange and platform, will report its first-quarter earnings tomorrow and  (despite bullish predictions from ). Coinbase stock has crashed along with the bitcoin and crypto market over the last few months and is now down 70% from its market debut. 📉 Desktop and mobile-web traffic has plunged 26% in the first quarter from a year earlier, according to data collected by analytics company Similarweb. Mobile app installs in March were down 67% from April 2021, the month the company went public. 🏷️ Meanwhile, reaction to Coinbase's new non-fungible token (NFT) marketplace has been broadly negative. Nick Tomaino of crypto investment firm 1confirmation, who's also former Coinbase employee, launched a scathing attack on the company via , saying the current Coinbase's current NFT platform \"is not it\" and promising to sell all his Coinbase shares \"if the company doesn't make a strong move in NFTs in the next year.\"  👀 Look out for these cryptocurrency and crypto-related events this week. 🤳 Today, Facebook parent company Meta will open its first , a \"physical retail space\" on its campus in Burlingame, California. Over the weekend, Coindesk  Meta’s Instagram will support NFTs from ethereum, polygon, solana and flow. - 🪙 Tomorrow, major U.S. crypto exchange Coinbase will post its first-quarter results amid a severe market downturn. 🎈 Wednesday brings the latest U.S. inflation data in the form of the consumer price index (CPI). The data is expected inflation peaked last month at 8.5%. - 👨‍💻 Also Wednesday, Google's      annual I/O developer conference gets underway. - 🛡️ On Thursday, Microsoft's Security Summit kicks off, featuring tech demos and discussions on the modern-day cyber threat landscape. ",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "37,854",
            "summary": "The following is an excerpt from the daily CryptoCodex email newsletter. Sign up now for free here..."
        }
    },
    {
        "postid": 48,
        "date": "May 8, 2022",
        "title": "‘Extreme Fear’ Crypto Crash Suddenly Wipes $200 Billion From The Price Of Bitcoin, Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/08/extreme-fear-crypto-crash-suddenly-wipes-200-billion-from-the-price-of-bitcoin-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days ().  The bitcoin price has dropped to under $35,000, its lowest since July last year, as \"extreme fear\" grips traders in the aftermath of . Ethereum and other top ten cryptocurrencies BNB     , XRP     , luna, solana, cardano and avalanche are also struggling with market sentiment falling to lows not seen since January. — The bitcoin price has lost 10% from its price this last week, dragging down the price of ethereum, ... [+] BNB, XRP, solana, cardano, luna and avalanche. This week's bitcoin and crypto crash has triggered a sharp fall in market sentiment, as measured by the Bitcoin Fear and Green Index which collects data from social media posts, surveys, volatility and trading volume. The gauge has now fallen into \"extreme fear\" territory, dropping further after trending lower through April. Stock markets have also lost ground this week with the Nasdaq recording its longest weekly losing streak since 2012. \"The correlation between cryptocurrency and equities has been discussed fairly extensively after bitcoin and the tech-heavy Nasdaq displayed a higher positive correlation than was initially expected,\" Tammy Da Costa, an analyst at DailyFX, wrote in emailed comments, noting that predictions made before Russia's war in Ukraine were made under the assumption that once interest rates began to rise, supply and demand would meet. \"Over the past week, fundamentals have included interest rate expectations and nobody can ignore the ongoing war which continues to place pressure on supply constraints, particularly for commodities.\" Market pressure, weighing on both crypto and equities, includes concerns over soaring inflation, an increasingly hawkish Federal Reserve and fears over a consumer spending pullback.  The bitcoin price has been trending downward for the past month, mirrored by the price of other ... [+] major cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Smaller cryptocurrencies that have outpaced the likes of bitcoin and ethereum in recent months have fallen harder during this latest crash. \"The future of individual coins or tokens remains dubious, the law remains in control of such solicitations and the approval of social media giants such as Elon Musk,\" added Da Costa. Terra's luna, used to stabilize the price of the protocol's stablecoins, has crashed more than 20% in the last week alone even as the Luna      Foundation Guard bought $1.5 billion in bitcoin to bolster the reserves of its most popular stablecoin UST     . Some have  a \"massive UST sell-off\" on the decentralized exchange Curve sparked rumors UST could lose its peg to the dollar, in turn causing the price of luna to fall further. The rumors were dismissed by Terra creator Do Kwon on .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "89,532",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have fallen sharply, wiping around $200 billion from the crypto market in just a matter of days."
        }
    },
    {
        "postid": 49,
        "date": "May 7, 2022",
        "title": "‘A De Facto Ban’—Serious Bitcoin Warning Issued As Price Crash Hits Ethereum, BNB, XRP, Luna, Solana, Cardano And Avalanche",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/07/a-de-facto-ban-serious-bitcoin-warning-issued-as-price-crash-hits-ethereum-bnb-xrp-luna-solana-cardano-and-avalanche/",
        "article": " Bitcoin     , ethereum and other major cryptocurrencies have fallen sharply this week as a broad asset price crash tanks markets ().  The bitcoin price has lost around 10% over the last few days, crashing to levels not seen since January. Ethereum and its biggest rivals BNB     , solana, cardano and avalanche have plunged, with Ripple's XRP      and Terra's luna also falling—. Ahead of , the chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned that governments are going to try to ban bitcoin and other cryptocurrencies. — The bitcoin and crypto market has gone into free fall, with the price of ethereum, BNB, XRP, solana, ... [+] cardano, luna and avalanche dropping sharply. \"What we're seeing around the world, which is really concerning to me, is using the attack on proof-of-work, and in particular, bitcoin's energy usage, as a way to implement a de facto ban on bitcoin without saying it,\" said Demirors, speaking during the Crypto Bahamas conference it was reported by . Proof-of-work is the name for bitcoin's decentralized consensus mechanism that lets so-called bitcoin miners secure the network and validate transactions in return for new coins. Some newer cryptocurrencies, such as ethereum rivals solana and cardano, have adopted a less energy-intensive consensus mechanism called proof-of-stake. Ethereum is trying to transition to proof-of-stake to better scale and reduce its carbon footprint. Bitcoin, by far the largest cryptocurrency by value, has been widely criticized for its eye-watering energy demands, by some estimates thought to use as much electricity per year as some small countries. In recent years, as the soaring bitcoin price has caused an influx of miners, lawmakers and regulators around the world have begun weighing whether to ban proof-of-work crypto mining. Last year, a crypto crackdown in China resulted in a miner mass exodus from the country, with many relocating to the U.S. and Europe. \"Governments are going to try to ban bitcoin, they're going to try to attack bitcoin because it's really difficult to do otherwise,\" Demirors said. This week, the state of New York has come  to an effective bitcoin mining ban with a bill calling for a two-year moratorium on proof-of-work cryptocurrency mining operations unless the company uses 100% renewable energy and until the state can complete an impact study progressing through the State Assembly.  The bitcoin price has swung wildly over the last year, losing around 40% from its peak of almost ... [+] $70,000 per bitcoin and dragging down the price of ethereum, BNB, XRP, solana, cardano, luna, and avalanche. Last month, —and their desire to \"protect\" the likes of ethereum. Earlier, environmental activist organization Greenpeace launched a lobbying campaign, funded by the billionaire co-founder of XRP developer Ripple, urging the bitcoin community to consider switching to proof-of-stake. \"A lot of the information [lawmakers are] getting is from other protocols lobbying for this,\" Demirors added. Speaking alongside Demirors, Elizabeth Stark, the chief executive of bitcoin payments developer Lighting Labs, echoed her concerns. \"I believe there are a lot of actors out there that are intentionally trying to attack bitcoin because there's no CEO,\" said Stark.",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "51,219",
            "summary": "The chief strategy officer of $5 billion crypto asset manager CoinShares, Meltem Demirors, warned governments are going to try to ban bitcoin and other cryptocurrencies..."
        }
    },
    {
        "postid": 50,
        "date": "May 5, 2022",
        "title": "$100 Billion Crypto Crash Sends The Price Of Bitcoin, Ethereum, XRP, Luna, Solana, Cardano And Avalanche Into Free Fall",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/05/100-billion-crypto-crash-sends-bitcoin-ethereum-xrp-luna-solana-cardano-and-avalanche-into-free-fall/",
        "article": " Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes ().  The bitcoin price is down around 5% over the last 24 hours, with the ethereum price seeing a similar decline. Ethereum rivals solana, cardano, and avalanche are all down around 3% while Ripple's XRP      and Terra's luna are leading the major crypto market lower. The sudden crash comes amid a technology company-led stock market sell-off in the aftermath of . — A huge crypto price sell-off has wiped around $100 billion worth of value from the market as the ... [+] price of bitcoin, ethereum, XRP, solana, cardano, luna and avalanche suddenly tank. \"Bitcoin’s struggle is by no means in isolation–the S&P 500 [has fallen] to a new record low for the year,\" Sam Kopelman, the U.K. manager for bitcoin and crypto exchange Luno, said in emailed comments and warning bitcoin could \"slip back into the previously found $36,000-$37,000 support range.\" However, Kopelman is upbeat about the bitcoin price but less positive about other major coins such as ethereum, XRP, solana, cardano, luna and avalanche. \"Overall, 2022 has generally seen crypto market participants climbing down the risk ladder, selling their smaller coins for blue-chip coins like bitcoin,\" said Kopelman.  The bitcoin price has suddenly dropped under its recent $38,000 per bitcoin support level. The market has had a delayed response to the Federal Reserve's biggest rate hike since 2000, first spiking on Wednesday's news and leading market watchers to believe the potentially \"bearish event\" to have been \"priced in.\" \"The market clearly priced in this bearish event during the weeks leading up to the FOMC meeting, where we saw significant sell pressure,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, said in emailed comments following the Fed's decision. Earlier this week, .",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "81,511",
            "summary": "Bitcoin, ethereum and other major cryptocurrencies have suddenly crashed, wiping around $100 billion from the combined crypto market in mere minutes..."
        }
    },
    {
        "postid": 51,
        "date": "May 4, 2022",
        "title": "Coinbase CEO Issues Stunning Crypto Prediction As The Price Of Bitcoin And Ethereum Suddenly Soar",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/04/coinbase-ceo-issues-stunning-crypto-prediction-as-the-price-of-bitcoin-and-ethereum-suddenly-soar/",
        "article": " Bitcoin      and ethereum, the two largest cryptocurrencies by a considerable margin, boast hundreds of millions of users around the world after a huge price explosion in recent years.  The bitcoin price soared to almost $70,000 per bitcoin late last year, up from under $10,000 two years ago, while the ethereum price has seen a similar rise. Both are down by around 40% from their all-time highs, however. Now, Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade—forecasting 1 billion people will have used crypto by 2032. — Coinbase chief executive Brian Armstrong is one of the most influential voices in the world of ... [+] bitcoin, ethereum and crypto. \"My guess is that in 10-20 years, we’ll see a substantial portion of GDP happening in the crypto economy,\" said Armstrong, speaking at the Milken Institute Global Conference this week in comments first reported by . Coinbase, based in San Francisco, currently has almost 90 million verified users across 100 countries. The \"crypto economy\" has grown rapidly over the last few years as businesses and services spring up around bitcoin, ethereum and other cryptocurrencies. Decentralized finance (DeFi)—the idea that crypto technology can replace lenders and insurers—and blockchain-based digital collectibles known as non-fungible tokens (NFTs) have both become multi-billion dollar markets in just a couple of years. Some of the world's largest technology companies, including Facebook's parent Meta and Elon Musk's electric car company Tesla     , have begun adopting crypto. Meta, under chief executive Mark Zuckerberg, is looking to expand into the so-called metaverse digital world where NFTs are expected to play a significant role. Tesla has added bitcoin to its corporate balance sheet and has begun experimenting with crypto payments. Financial giants on Wall Street have also slowly started to roll out crypto services to clients. Speaking alongside Armstrong, Ark Investment Management's chief executive, Cathie Wood, one of the biggest backers of web3—a name for the crypto and blockchain-based next-generation of the internet that some think could succeed the current Silicon Valley-centric model—warned financial companies not to fall behind. \"In the case of DeFi and next-generation internet, we are seeing a lot of financial companies losing talent to crypto,\" Wood said, according to Bloomberg. \"So they have to take it seriously, or else they are going to be hollowed out.\"  The bitcoin price has rocketed higher in recent years, adding many thousands of percent and helping ... [+] the ethereum price to surge. Meanwhile, the crypto industry is feeling upbeat about the evolving regulatory landscape following a Biden administration executive order directing federal agencies to collaborate on a rule book for blockchain businesses. \"It’s been harder and harder to meet a true crypto skeptic in D.C.,\" Armstrong added, speculating that around half of people in Washington are now pro-crypto. Crypto industry lobbying has exploded along with the bitcoin price over the last couple of years, research has found. The price of bitcoin, ethereum and other major cryptocurrencies have rallied this week, climbing on the back of a closely-telegraphed Federal Reserve interest rate hike that some had feared could be more hawkish than anticipated and following several positive global bitcoin and crypto developments. \"An increasing number of countries are legalizing bitcoin as a currency, embracing its ability to strengthen financial infrastructure, facilitate wealth creation, and afford direct access to financial resources,\" Matt Senter, chief technology officer at bitcoin rewards app Lolli, said in emailed comments. \"With the devaluation of the U.S. dollar due to inflation, we are now finding ourselves in the perfect storm catalyzing global mainstream adoption of bitcoin as an anti-inflationary, disintermediated alternative to our legacy financial system in crisis.”",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "231,357",
            "summary": "Brian Armstrong, the chief executive of major bitcoin and crypto exchange Coinbase, has predicted there will be a massive influx of crypto users in the coming decade..."
        }
    },
    {
        "postid": 52,
        "date": "May 3, 2022",
        "title": "Crypto Price Alert: Fed Triggers Stark $10,000 Bitcoin Crash Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/crypto-price-alert-fed-triggers-stark-10000-bitcoin-warning/",
        "article": " Bitcoin      and cryptocurrency prices have been stuck in a holding pattern ahead of the .  as central bank monetary tightening squeezes assets across the board. The Fed is widely expected to hike rates by 50 basis points—the biggest rate increase in 22 years—in order to temper soaring inflation. Now, a veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price—despite historical data suggesting May could be . — Federal Reserve chairman Jerome Powell will hold a press conference after the Wednesday interest ... [+] rate decision is released. Fears of Fed tightening have weighed on the bitcoin price and stock markets. \"The completion of a bear channel typically results in a decline equal to the width of the channel, or in this case a hard test of $32,000 or so—my guess is $28,000,\" Peter Brandt, the chief executive of trading service Factor,  to Twitter alongside a chart showing the bitcoin price trending downward. While bitcoin, cryptocurrencies and stock markets are on high alert ahead of the Fed's interest rate decision, traders are even more closely attuned to comments from Fed chair Jerome Powell who will speak at a press conference following the 2pm ET release of the statement. \"Fed meetings always signal uncertainty and volatility, which may impact not only digital assets but also broad markets as a whole,\" Eric Chen, chief executive of decentralized exchange protocol injective developer Injective Labs, said in emailed comments. \"But crypto markets are more attached to the underlying technology and value behind the projects and larger market trends over time have only proven that fact.\" Looking back over recent trends, the month of May has historically been the fourth-best month for bitcoin, analysis by Coindesk showed, with the bitcoin price making gains in seven of the past 11 years.  The bitcoin price has crashed back from its all-time high of almost $70,000 per bitcoin set in ... [+] November last year. \"In terms of seasonality, May is considered a relative success for BTC. Over the past 11 years, bitcoin has ended the month up seven times and down four times,\" Alex Kuptsikevich, senior market analyst at FxPro, said in emailed comments. The bitcoin price has found a floor in recent weeks, repeatedly hitting support at around $38,000 as positive bitcoin and crypto developments roll in. Central African Republic has followed El Salvador in adopting bitcoin as legal tender, while Panama has signaled it's increasingly interested in crypto. Wall Street giant Goldman Sachs last week offered its first-ever lending facility backed by bitcoin, called a \"significant step\" by . \"I still believe crypto is the most optimal hedge against these macroeconomic issues which is why institutional interest in the industry has only continued to grow,\" added Chen. \"Both venture capital funding and fund deployments into crypto are soaring at one of the fastest levels since the inception of bitcoin.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "54,077",
            "summary": "A veteran trader has warned the bitcoin price could fall as low as $28,000, down $10,000 per bitcoin from its current price..."
        }
    },
    {
        "postid": 53,
        "date": "May 3, 2022",
        "title": "Huge 2022 Ethereum Price Prediction Comes With A Serious BNB, Solana, Cardano, Avalanche And Polkadot Warning",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/03/huge-2022-ethereum-price-prediction-comes-with-a-serious-bnb-solana-cardano-avalanche-and-polkadot-warning/",
        "article": " Ethereum, the second-largest cryptocurrency after bitcoin, has seen its price swing wildly over the last year—.  The ethereum price has lost around 43% since its peak of almost $5,000 per ether set late last year. Meanwhile, smart contract rivals BNB     , solana, cardano, avalanche and polkadot have seen similar volatility. Now, a panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800. — The ethereum price has dropped over the last year as rivals such as Binance's BNB, solana, cardano, ... [+] avalanche and polkadot win market share. The panel, made up of 36 people from the world of crypto and put together by financial comparison website , has returned a lower average ethereum price prediction for the end of 2022 than it did in January, revising down the year-end price target by just over 10% due to emerging competition from rival blockchains such as BNB, solana, cardano, avalanche and polkadot. \"Ethereum is at a very uncertain place in its journey at the moment,\" Keegan Francis, Finder's cryptocurrency editor, said in a statement. \"Ethereum is currently losing DeFi market share to its competitors, although it still remains dominant by a huge margin ... I don't think ethereum will be the second cryptocurrency forever.\" The ethereum price has rocketed over the last two years in part due to soaring interest in so-called decentralized finance (DeFi)—using crypto technology to recreate traditional financial services without the need for a bank—and the ongoing non-fungible token (NFT) craze that has been adopted by the world's of music, sport and gaming and is largely built on the ethereum blockchain. However, a long-awaited ethereum upgrade, designed to help the network scale, reduce its sky-high fees and ease its carbon footprint, has again been pushed back—now due for late 2022.  The ethereum price has seen extreme volatility over the last 12 months though bullish price ... [+] predictions continue to forecast a recovery even as BNB, solana, cardano, avalanche and polkadot steal attention. \"People have been waiting for [ethereum's merge upgrade] for years,\" said panel memeber and Thomson Reuters      technologist, Joseph Raczynski. \"It should be far more secure, 99% more energy-efficient, and deflationary. If that isn't the trifecta of potential, as a leading blockchain, I don't know what would be.\" Looking further ahead, the panel returned an ethereum price prediction of almost $12,000 by 2025, around four-fold its current price. \"Until ethereum upgrades its systems and fulfills its promises to scale, I do not have long-term confidence in the network,\" said Francis, but adding, \"I still think people will buy the token out of hype, promise and potential.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "139,665",
            "summary": "A panel of 36 industry experts has returned an ethereum price prediction of almost $5,800 by the end of 2022—more than double its current level of $2,800..."
        }
    },
    {
        "postid": 54,
        "date": "May 1, 2022",
        "title": "Bitcoin And Crypto Now Braced For A $9 Trillion Fed Earthquake As The Price Of Ethereum, BNB, Solana, Cardano, XRP, Terra’s Luna And Avalanche Crater",
        "url": "https://www.forbes.com/sites/billybambrough/2022/05/01/bitcoin-and-crypto-braced-for-a-9-trillion-earthquake-as-the-price-of-ethereum-bnb-solana-cardano-xrp-terras-luna-and-avalanche-crater/",
        "article": " Bitcoin      and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve ().  The bitcoin price has lost around 40% from its peak of almost $70,000 per bitcoin late last year with the ethereum price also down by nearly half. Other major coins—including Binance's BNB     , Ripple's XRP     , solana, cardano, Terra's luna and avalanche—have also plunged, wiping $1.2 trillion from the combined crypto market in a matter of months. Now, after Federal Reserve chair Jerome Powell signaled a half percentage point interest rate hike is on the table at next week's meeting, the market is braced for the central bank to begin shrinking its huge $9 trillion asset portfolio as it battles soaring inflation. — Federal Reserve chair Jerome Powell has signaled the central bank was likely to raise interest rates ... [+] by a half percentage point at its upcoming meeting, putting bitcoin, crypto and stock prices under pressure. \"Macro uncertainty has driven all risk-on assets downwards over the last few months, including bitcoin,\" Joe Haggenmiller, head of markets at leading crypto finance company XBTO Group, said in emailed comments. \"Price volatility in the bitcoin market over the last few weeks can be attributed largely to its correlation to other risk assets, which in general have been moving in reaction to conflict in Ukraine, supply chain issues due to rising Covid cases in China, and ongoing interest rate hikes and future balance sheet machinations by the Federal Reserve.\" Early in the Covid-19 pandemic, the Federal Reserve began an unprecedented stimulus program that saw its balance sheet double and interest rates fall to historic lows as it flooded markets with cash in an effort to offset the economic damage of Covid-19 and lockdowns. As the pandemic has begun to recede and inflation has spiked, the Fed has pivoted to trying to cool the economy. \"It is appropriate in my view to be moving a little more quickly [than the Fed has recently],\" Powell said last week, speaking after a panel discussion with European Central Bank President Christine Lagarde hosted by the International Monetary Fund, adding he thinks \"there’s something in the idea of front-end loading\" those moves. However, economic data has this week shown the U.S. economy shrank in the first three months of the year, contracting by 0.4% in the first quarter, its weakest quarter since the early days of the pandemic. \"This is bullish for risk assets like bitcoin and equities in my opinion, as the Federal Reserve may become less hawkish to avoid a recession,\" Marcus Sotiriou, an analyst at the U.K.-based digital asset broker GlobalBlock, wrote in an emailed note. Bitcoin, crypto and stock market traders are watching carefully for any sign the Fed will stray from its telegraphed move when it meets this week. \"An increase higher than 50 basis points, deviating from the current consensus, may lead to a drop in risk markets including bitcoin,\" added Haggenmiller. \"Regardless, the bitcoin market has proved to be relatively resilient in the long term throughout periods of uncertainty.\"  The bitcoin price has fallen sharply from its all-time high, dragging down the price of other top ... [+] ten cryptocurrencies ethereum, BNB, XRP, solana, cardano, luna and avalanche. Meanwhile, the bitcoin and crypto community has cheered a series of positive developments this week, including Central African Republic becoming the second country after El Salvador to adopt bitcoin as legal tender and investment giant Fidelity announcing the launch of 401k bitcoin accounts. \"Recently, bitcoin has reached a new phase of mainstream adoption: companies and countries are now integrating bitcoin without waiting for bitcoin’s price to skyrocket,\" Alex Adelman, the chief executive of bitcoin rewards app Lolli. \"This lack of correlation between price moves and increasing mainstream adoption demonstrates that more institutions are grasping bitcoin’s immense utility as a currency and store of value and its inevitable, powerful role in our financial future.\"",
        "metadata": {
            "source": "forbes",
            "author": "Billy Bambrough",
            "views": "1,038,186",
            "summary": "Bitcoin﻿ and cryptocurrency prices have fallen along with stock markets this year as investors brace for a more hawkish Federal Reserve..."
        }
    }
]