[
    {
        "postid": 1,
        "date": "13 May 2022",
        "title": "TerraUSD’s stablecoin meltdown holds the crypto market hostage",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/terras-stablecoin-meltdown-holds-the-crypto-market-hostage/",
        "article": " The big crypto news of the week was the rupturing of TerraUSD’s supposed peg to the US dollar. TerraUSD is a so-called algorithmic stablecoin supported by some fancy technology that was designed to maintain its value at $1. That 1:1 peg broke dramatically this week, with TerraUSD falling to $0.23 before recovering to $0.48 on Friday. TerraUSD (UST) occupies a subset within the crypto space known as stablecoins, which are a form of cryptos backed by real assets. Most are backed by fiat currencies such as the US dollar, others are linked to metals such as gold. Stablecoins have surged in popularity because their value is stable, unlike Bitcoin and other cryptos which are prone to wild speculative moves. Read: The combined value of all stablecoins hit $180 billion in March this year, in part because of a shift out of volatile cryptos not backed by real assets – such as Bitcoin and Ethereum – into more stable assets. Many traders swap their Bitcoin for stablecoins when they expect crypto prices to drop. The reason they opt for stablecoins such as UST is that it is cheaper than switching into fiat US dollars, and they harbour the belief that they are fully redeemable for USD at all times. Read: That belief has been shattered this week. Another US dollar-backed stablecoin, Tether (USDT), briefly lost its peg to the US dollar on Thursday, May 12, falling to $0.97 before rallying to $1 – where it should be. Rumours swirled that the world’s largest asset manager, Blackrock, and hedge fund giant Citadel Securities, had a role in the TerraUSD collapse – rumours that were swiftly denied by the companies. Rumors that we had a role in the collapse of UST are categorically false. In fact, BlackRock does not trade UST. — BlackRock (@BlackRock)  There was speculation that Blackrock and Citadel had borrowed 100 000 BTC from Gemini, a crypto exchange, swapped 25% of this for UST and then dumped both BTC and UST, causing both to collapse in price, in what has been likened to a George Soros-style attack by Wall Street on the crypto market. BTC crashed to a 16 month low of $28 600 following the rout, before rallying to $28 600. Read/listen:  There’s no doubt that stablecoins are here to stay, but the manner in which they are regulated will need closer attention. The largest of the stablecoins is Tether (USDT), backed 1:1 by the US dollar, and now the third largest crypto by market cap, with a total value of $81 billion. Just behind USDT is USD Coin, also backed 1:1 by the US dollar, and worth $49 billion. Then there’s Binance USD (BUSD), the seventh largest crypto by market cap, and worth $17 billion. All of the above are known a centralised stablecoins, because they operate much like their own central banks, minting and burning coins as demand rises and falls. TerraUSD is decentralised in that multiple players participate in providing liquidity. Until recently, TerraUSD was the ninth largest crypto with a total market cap of $24 billion. It’s now slipped to 17th place with a market cap of just $5.6 billion. It operated on an entirely different technology, comprising two separate cryptos: Luna and Terra. This is where the algorithm came into play. TerraUSD was theoretically always worth $1, while Luna, its sibling crypto, has no fixed price. If the value of TerraUSD exceeds $1, the equivalent value of Luna is burned. If TerraUSD dropped below $1 to say $0.98, arbitrage traders would snatch it up and sell for $1 worth of Luna. That was supposed to ensure the UST retained its peg to $1.  This is an ingenious methodology for maintaining the peg to the dollar, since it did not require the same amount of capital backing as other “centralised stablecoins”, which are audited to show that they have $1 in real assets (either in fiat currencies, treasuries or other liquid assets). In UST’s case, a piece of computer code maintains the peg. “Unfortunately, this chink in the Terra network’s design has managed to bring what was a multibillion-dollar project close to zero within days. It also caused systemic risk across DeFi (decentralised finance) and the broader crypto industry,”  Ahmen Ismail, CEO of Fluid, a DeFi liquidity aggregator. Paolo Ardoino, Tether’s chief technology officer, says the company has toyed with algorithmic stablecoins, but erred on the side of caution because of the potential for the kind of fallout that hit TerraUSD this week. “The reason we have always been careful in algorithmic stablecoins was exactly this problem, that if you have assets that are backing this stablecoin, and these assets are subject to heavy volatility, then you are (at) risk of having to liquidate your assets very quickly, and bringing the market even further down,” he told the Wolf of All Streets podcast. Tether and USDC survived the carnage, and maintained their peg to the USD, though there were arbitrage opportunities between different exchanges in recent days, where Tether was available at less than $1 on crypto exchange Kraken. These could be snapped up and sold on other exchanges for $1, making a 1-2% return for sharp-eyed traders. As stablecoins hit the $10-$20 billion value mark, the potential for rupture is ever present. Below that level, they are perhaps too small for any kind of sneak attack. Do Kwon, the CEO of Terraform Labs, the company behind TerraUSD, was reported to be working on a rescue, but it seems certain the stablecoin is doing to have to transition to a more conventional form of asset backing if it is to survive. Ismail points out that these are the growing pains of a new, and illiquid market. Cryptos are still a tiny part of the broader financial market. There will be more such events. As liquidity improves, volatility will decline. What’s needed to bring some order to this market is regulation – spelling out what a stablecoin is and is not, and where it fits into the financial eco-system, with liquidity aggregators capable of mobilising far larger gobs of capital when needed to prevent this kind of meltdown. Interested in the world of crypto? Follow Moneyweb’s Crypto Pod .    ",
        "metadata": {
            "source": "moneyweb",
            "author": "Ciaran Ryan",
            "category": "Fast News",
            "summary": "There’s red everywhere this week as TerraUSD’s peg to the US dollar snapped, dragging other cryptos with it."
        }
    },
    {
        "postid": 2,
        "date": "13 May 2022",
        "title": "Crypto-market panic subsides with prices, tether stabilising",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/crypto-market-panic-subsides-with-prices-tether-stabilising/",
        "article": " On Wednesday, the implosion of the TerraUSD stablecoin kindled wide-spread panic in the crypto space. But 24 hours later, things have calmed down significantly. Terraform Labs halted, restarted and then halted again its Terra blockchain in the wake of the collapse of TerraUSD and its related Luna token. Developers who work on the blockchain said in a tweet posted to their verified Twitter account that the second halt was intended to enable them to “come up with a plan to reconstitute” the network. Both TerraUSD (UST), the algorithmic stablecoin that lost and never regained its 1-1 peg to the US dollar, and the associated Luna token were trading near zero at the time of the second halt. But elsewhere in crypto sentiment had started to rebound. Tether, the largest stablecoin used in cryptocurrency markets to facilitate trading, recovered from an earlier mini-crash, soothing concerns that its troubles might spill into the broader market. Tokens underpinning key decentralised finance protocols also advanced. Even ApeCoin rallied, advancing more than 35% in 24 hours, according to CoinMarketCap.com. Bitcoin, meanwhile, traded above $30 000 after falling to about $25 000 in the previous day’s trading. And some alternative coins also gained, with Bitcoin Cash adding 20% at one point before paring gains. It’s a remarkably more positive picture from the havoc that overtook crypto markets on Wednesday as UST entered a “death spiral”. That day, Bitcoin had suffered a nearly 10% drop. “The fact that Tether is stabilising means that the margin calls that took place are fading,” said Matt Maley, chief market strategist at Miller Tabak + Co. “Whenever you get forced selling in anything, it overshoots. People are still nervous, but the selling has abated. Investors will be nervous for a few more days, but the supply-demand equation has stabilised again.”  Market-watchers noted that Bitcoin, which typically trades in tandem with the stock market, was able to gain on Thursday even as the S&P 500 and Nasdaq 100 sunk 0.1% and 0.2%, respectively. Treasury Secretary Janet Yellen, meanwhile, said Terra’s tumble showed the dangers of tokens that purport to be pegged to the US dollar, though she added that its implosion didn’t pose a threat to financial stability. “Crypto has little economic significance. Not that many people own much of it,” said Brian Nick, chief investment strategist at Nuveen. Still, he added that the crypto market is being swayed by the same forces that are affecting equities right now. “What gets punished when financial conditions are tightening? Anything with a high valuation and an uncertain or non-existent revenue stream,” he said by phone. “And crypto has inarguably high valuations and no revenue stream. That’s very much of a piece with what we’re seeing in growth stocks, tech. It’s correlated but obviously it’s more volatile because the market is less liquid.” Various trading desks reported business-as-usual conditions, with B2C2 saying it saw two-way flows into UST, and more buying in USDC. Stephane Ouellette, chief executive of FRNT Financial Inc., said he’d received questions about Tether, with clients wondering if its dislocation provided any arbitrage opportunities. “Last night there was a huge arb,” he said, adding that “everything at Tether and Bitfinex appears to be working as usual.” “There’s no indication there’s anything going wrong there at all besides the market move, which is now looking like it was circumstantial,” he said. Still, cryptocurrencies remain mired in a deep downturn. “The question, as always, is: now what?,” wrote Michael Purves, chief executive and founder of Tallbacken Capital Advisors. He expects further downside for Bitcoin and is looking at the coin potentially hitting $20 000 or $15 000. “A move to 15K would be a move off the January levels which would be quite consistent with the last three long term momentum reversals we have seen,” he said in a note. “However, bears should be prepared for aggressive relief rallies along the way (just as they should with equities).”",
        "metadata": {
            "source": "moneyweb",
            "author": "Vildana Hajric, Bloomberg",
            "category": "Fast News",
            "summary": "Bitcoin, meanwhile, traded above $30 000 after falling to about $25 000 in the previous day’s trading."
        }
    },
    {
        "postid": 3,
        "date": "12 May 2022",
        "title": "OneCoin cryptoqueen named among Europe’s most wanted fugitives",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/onecoin-cryptoqueen-named-among-europes-most-wanted-fugitives/",
        "article": " The founder of the OneCoin cryptocurrency was placed on the European law enforcement agency’s most wanted list for her role in the multibillion dollar fraud. Ruja Ignatova, known as the so-called cryptoqueen, “is suspected of having prompted investors worldwide to invest in this actually worthless ‘currency’,” Europol said on its website. The agency is offering a 5 000 euro ($5,217) reward for information that will lead to the arrest of 41-year-old Ignatova. OneCoin claimed to have more than 3 million members worldwide. Generating 3.4 billion euros in revenue from the fourth quarter of 2014 to the third quarter of 2016, it operated as a multilevel market network that paid commission to members worldwide for recruiting others, prosecutors told a US court in 2019. The subject of a successful BBC podcast ‘The Missing Cryptoqueen’, Ignatova created OneCoin in 2014 in Sofia, Bulgaria, and headed the organisation until she vanished from the public eye in October 2017, according to prosecutors. Her brother, Konstantin Ignatov assumed the top leadership position in the middle of 2018, they said. He pleaded guilty to fraud and money laundering.",
        "metadata": {
            "source": "moneyweb",
            "author": "Jeremy Hodges, Bloomberg",
            "category": "Fast News",
            "summary": "Europol is offering a 5 000 euro reward for information that will lead to the arrest of 41-year-old Ignatova."
        }
    },
    {
        "postid": 4,
        "date": "12 May 2022",
        "title": "More than $200bn wiped off cryptocurrency market in a day",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/more-than-200bn-wiped-off-cryptocurrency-market-in-a-day/",
        "article": " A massive sell-off in cryptocurrencies wiped over $200 billion of wealth from the market in just 24 hours, according to estimates from price-tracking website CoinMarketCap. The broad plunge in the crypto complex, driven by the collapse of the TerraUSD stablecoin, hit major tokens hard. Bitcoin plunged by as much as 10% in the last day to its lowest level since Dec. 2020, while Ethereum dropped as much as 16%. The carnage showed signs of spreading further Thursday as crypto-related stocks in Asia also cratered. Hong Kong-listed fintech firm BC Technology Group Ltd closed down 6.7%. Japan’s Monex Group Inc — which owns the TradeStation and Coincheck marketplaces — ended the day down 10%.  As central banks across the world move to aggressively tighten monetary policy to fight inflation, digital tokens have faced selling pressure amid a broader flight from risk assets. S&P 500 futures lost 0.8% Thursday, tracking losses in the benchmark MSCI Asia Pacific Index. Investors in the crypto space are no stranger to wild swings in the market, however, and Bitcoin and Ethereum pared losses quickly to trade down 4.2% and 9%, respectively, as of 4:45 p.m. Hong Kong time. © 2022 Bloomberg",
        "metadata": {
            "source": "moneyweb",
            "author": "Bloomberg News",
            "category": "Moneyweb Crypto",
            "summary": "Bitcoin and Ethereum have plunged amid a broader crypto selloff."
        }
    },
    {
        "postid": 5,
        "date": "12 May 2022",
        "title": "Terra crunch shakes foundations of crypto stablecoin complex",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/bitcoin/terra-crunch-shakes-foundations-of-crypto-stablecoin-complex/",
        "article": " Stablecoins besides TerraUSD are failing to live up to their billing as the collapse of the algorithmic token has investors pondering the implications of the tumult for the broader market. Most rival algorithmic stablecoins, which use a complex combination of computer code and trader incentives to maintain their pegs of one-to-one to the dollar, are also below that threshold – though not at the 80% extreme seen on TerraUSD on Wednesday. Read: MakerDAO’s Dai slipped 0.4% before recovering to its peg and Fei slipped 0.5%. Neutrino USD fell 20% over the same period of time, according to data from CoinMarketCap. Tether, the biggest stablecoin which claims to be backed by actual assets including dollars, was trading slightly off its dollar peg at around 97 cents at 8 a.m. in London, data compiled by Bloomberg show. USDC, the second largest, was basically holding its peg. “Algorithmic stablecoins are at an experimental stage currently, nothing more,” said Dan Liebau, chief investment officer for Modular Asset Management’s blockchain strategy. Those backed by an increasing/decreasing amount in the stablecoin’s own protocol token comprise a “particularly risky category,” he added. Read: TerraUSD, or UST, and its related token Luna, had a long way to fall. They both recently climbed into the top 10 tokens by market value after Terra founder Do Kwon established the Luna Foundation Guard, which bought billions of dollars of Bitcoin to back it up. Terra founder Do Kwon is counting on the oldest cryptocurrency as a backstop for his stablecoin, which some critics liken to a ginormous Ponzi scheme. Image: Bloomberg Investors had rushed to take advantage of yields that might reach almost 20% on Anchor Protocol, which is powered by the Terra blockchain. On Wednesday, Kwon announced measures aimed at bringing TerraUSD back to the $1 peg, which includes minting Luna at an increased pace. The total circulating supply of Luna has surged to 1.46 billion tokens from 377 million yesterday, data from researcher Messari show.  “The effects of the UST collapse will bring a bit more caution while evaluating for other algorithmic stablecoins for investment,” said Paul Veradittakit, a partner at Pantera Capital in Menlo Park, California. Also, apps built on Terra/Luna “will likely want to diversify platforms to mitigate risk and apps that are tapping into Anchor for yields will have to tap into other cryptocurrencies and liquidity protocols.” TerraUSD isn’t the first algorithmic stablecoin whose peg has blown up. Neutrino, which sought to keep at equilibrium by issuing and burning tokens, lost its peg last month. It happened to Iron Finance last June – an incident that caused Dallas Mavericks owner and crypto fan Mark Cuban to call for regulation defining what a stablecoin is, and what collateralisation is acceptable. “We do not believe that the UST situation means anything for the centralised stablecoin market,” a statement from Tether said. “They are entirely different types of assets.”    ",
        "metadata": {
            "source": "moneyweb",
            "author": "Joanna Ossinger, Bloomberg",
            "category": "Bitcoin",
            "summary": "Failing to live up to their billing as the collapse of the algorithmic token has investors pondering the implications of the tumult for the broader market."
        }
    },
    {
        "postid": 6,
        "date": "12 May 2022",
        "title": "Crypto billionaires’ vast fortunes are destroyed in weeks",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/bitcoin/crypto-billionaires-vast-fortunes-are-destroyed-in-weeks/",
        "article": " It’s been a long few weeks since the crypto crowd was partying in Miami. Coinbase Global Inc. founder Brian Armstrong had a personal fortune of $13.7 billion as recently as November and about $8 billion at the end of March. That’s now just $2.2 billion, according to the Bloomberg Billionaires Index, after a selloff in digital currencies from Bitcoin to Ether triggered a precipitous decline in the market value of Coinbase, the largest US cryptocurrency exchange. The firm’s shares have tumbled 84% since their first day of trading in April 2021, closing Wednesday at $53.72 after the company warned that trading volume and monthly transacting users were expected to be lower in the second quarter than in the first. It’s raised questions about Coinbase’s ability to withstand the sharp decline in crypto prices, forcing Armstrong to take to Twitter to defend the company. There is “no risk of bankruptcy” even amid a “black swan” event and users’ funds are safe, said Armstrong, the firm’s chief executive officer. Then there’s Michael Novogratz. The CEO of crypto merchant bank Galaxy Digital has seen his fortune plummet to $2.5 billion, from $8.5 billion in early November. He’s been a champion of TerraUSD, the algorithmic stablecoin that’s now at risk of a complete collapse amid a breakdown in the price of a crypto token in the same ecosystem, Luna. “I’m probably the only guy in the world that’s got both a Bitcoin tattoo and a Luna tattoo,” Novogratz said at the Bitcoin 2022 conference in Miami on April 6. I’m officially a Lunatic!!! Thanks  And thank you my friends at Smith Street Tattoos. — Mike Novogratz (@novogratz) Billionaire crypto fortunes that swelled over the last two years are disappearing after a selloff that began with tech stocks spilled over into digital money. Bitcoin, the most popular cryptocurrency, and Ether have both fallen more than 50% since their record highs late last year. While almost all crypto holders have suffered wealth declines, some of the biggest and most visible losses are concentrated among founders of exchanges, where traders buy and sell digital currencies. At least on paper, Changpeng Zhao, the CEO of closely held Binance, has lost an even larger fortune than Armstrong or Novogratz. He debuted on the Bloomberg wealth index in January with a net worth of $96 billion, one of the world’s largest. By Wednesday that had shrunk to $11.6 billion, using the average enterprise value to sales multiples of Coinbase and Canadian crypto firm Voyager Digital as a basis for the calculations. Crypto exchanges in the US appear to be suffering more of a downturn than their global competitors. Trading volumes at Coinbase have steadily fallen since the beginning of the year, while more internationally focused Binance saw an uptick in volume last month. Binance’s US-focused business, by comparison, experienced even steeper declines than Coinbase’s.  Tyler and Cameron Winklevoss, co-founders of rival crypto exchange Gemini, have each lost about $2.2 billion — or roughly 40% — of their wealth this year. The fortune of Sam Bankman-Fried, CEO of crypto exchange FTX, has fallen by half since the end of March to about $11.3 billion. Armstrong isn’t the only Coinbase billionaire losing money. Co-founder Fred Ehrsam, a former Goldman Sachs Group Inc. trader, is currently worth $1.1 billion, down more than 60% this year. Armstrong owns 16% of Coinbase and controls 59.5% of its voting shares, according to the company’s 2022 proxy statement, while Ehrsam has a 4.5% stake and controls 26% of its voting stock. Coinbase’s bonds have also plunged, recently trading in line with some of the riskiest junk-rated notes.",
        "metadata": {
            "source": "moneyweb",
            "author": "Scott Carpenter and Tom Maloney, Bloomberg",
            "category": "Bitcoin",
            "summary": "Billionaire crypto fortunes that swelled over the last two years are disappearing after a selloff that began with tech stocks spilled over into digital money."
        }
    },
    {
        "postid": 7,
        "date": "12 May 2022",
        "title": "Cryptocurrencies drop anew as TerraUSD’s woes cloud the outlook",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/bitcoin/cryptocurrencies-drop-anew-as-terrausds-woes-cloud-the-outlook/",
        "article": " Cryptocurrencies resumed declines as the collapse of the TerraUSD stablecoin triggers a flight from many popular digital tokens. Bitcoin shed as much as 4.9% on Thursday in Asia, falling to $27 003 and returning to levels last seen in December 2020. Tokens like Avalanche and Solana that underpin some key decentralised finance protocols also retreated. Earlier they had posted double-digit percentage gains but the rally fizzled. The TerraUSD stablecoin was still below it $1 intended peg, while the affiliated token Luna tumbled. The crypto sector overall is nursing heavy losses for the week and sentiment remains fragile. The TerraUSD algorithmic stablecoin — also known as UST — has been bouncing between 20 cents and 90 cents and was around 70 cents as of 12:28 p.m. in Singapore. Backers of the coin are trying to raise about $1.5 billion to shore up the token after it crashed from its dollar peg, according to the founder of a firm that was approached about the deal. “The downfall of the stablecoin UST has impacted the crypto market to a great extent,” said Edul Patel, chief executive officer of Mudrex, an algorithm-based crypto investment platform. While Bitcoin has often rebounded quickly from crashes in the past, this time it could have further to fall, he added.  “Is the market getting spooked by what’s happening with Terra? The answer is yes,” Craig W. Johnson, chief market technician at Piper Sandler, said by phone. “Money-market funds are important to investors and right now we’re questioning the third-largest money-market fund in crypto land. People did not think we were going to break the buck on that and that’s clearly happened.” Crypto sentiment was also hurt by elevated US inflation, which points to aggressive interest-rate hikes — an unfavorable environment for risk assets. “There is extreme fear across the crypto market,” said Marcus Sotiriou, an analyst at the UK-based digital-asset broker GlobalBlock. The area around $30 000 had been an “especially sensitive zone,” for Bitcoin, wrote James Malcolm, head of foreign exchange and crypto research at UBS. That’s where mining economics turn negative, “which could potentially lead to increased coin sales by this key cohort,” he said.  Meanwhile, Coinbase Global Inc. shares and bonds fell to new lows Wednesday, signaling investor skepticism about the prospects of the crypto exchange in a bear-market. The company reported lower-than-expected revenues yesterday, and warned trading volume and monthly transacting users in the second quarter is expected to be lower than in the first. Piper Sandler‘s Johnson says that’s another concern for crypto investors right now. “It’s the largest exchange here in the United States and they just turned a loss,” he said, adding that Terra’s troubles are all “snowballing in crypto land.” Still, a lot of crypto investors, cognizant of the fact that Bitcoin has gone through a boom-and-bust cycle before only to recoup losses over and over again, are preaching patience. “Ultimately every investor needs to size positions based on their risk level and time horizon,” said Alex Tapscott, managing director of the digital asset group at Ninepoint Partners. “We believe Bitcoin will recover and that we’re still in the early stages of this new internet of value. Keep calm and HODL.” © 2022 Bloomberg",
        "metadata": {
            "source": "moneyweb",
            "author": "Olga Kharif, Vildana Hajric and Sidhartha Shukla, Bloomberg",
            "category": "Bitcoin",
            "summary": "Bitcoin shed as much as 4.9% on Thursday in Asia, falling to $27 003 and returning to levels last seen in December 2020."
        }
    },
    {
        "postid": 8,
        "date": "11 May 2022",
        "title": "Blue-Chip NFT collections hit harder than bitcoin in crypto rout",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/bitcoin/blue-chip-nft-collections-hit-harder-than-bitcoin-in-crypto-rout/",
        "article": " Blue-chip NFT collections like Bored Ape Yacht Club, which for a while outperformed the rest of the crypto market, are being hit harder than cryptocurrencies by a deep rout that is souring sentiment across the sector. BAYC’s average sales price plummeted 29% over the last seven days in US dollar terms, while transactions have tanked by 21% and user numbers are down 27%, according to NFT watchers Price Floor and DappRadar. Until recently, the popular NFT collection has generally fared better than the rest of the crypto sphere. Its floor price hit an all-time high at the end of April, according to NFT Price Floor data. Meanwhile, Bitcoin is down by more than 50% since its all-time high in early November. “There have been substantial portfolios of NFTs built in the last six months,” said Michael Bucella, a partner at BlockTower Capital Advisors, in an interview with Bloomberg. But BAYC’s recent fall from favour seems to reflect a wider trend spreading across the marketplace for nonfungible tokens. The JPG NFT Index, which provides exposure to a broad basket of NFTs, also fell by about 26% this past week. “They are just fairly illiquid markets generally,” said Bucella. “If the market is selling off en masse, they are going to sell whatever they have.” In comparison, crypto bellwether Bitcoin tumbled 17% and Ether is down 15% over the last week, according to CoinMarketCap. Token prices were seen slipping during the recent selloff in tech stocks in traditional markets and as troubles surrounding TerraUSD, an algorithmic stablecoin meant to be pegged to the US dollar, have come to light. NFT-backed loans, which allow borrowers to put up their digital artwork as collateral in order to obtain funds, may also be contributing to the recent nosedive in NFT sales. “This could be just collateral selldowns to satisfy loan obligations,” said Bucella. “If you had folks taking some pretty significant hits on their assets, there’s a potential loan unwind.”",
        "metadata": {
            "source": "moneyweb",
            "author": "Olga Kharif, Bloomberg",
            "category": "Bitcoin",
            "summary": "Until recently, the popular NFT collection has generally fared better than the rest of the crypto sphere."
        }
    },
    {
        "postid": 9,
        "date": "11 May 2022",
        "title": "TerraUSD backers seek $1.5bn to prop up stablecoin",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/terrausd-backers-seek-1-5bn-to-prop-up-stablecoin/",
        "article": " The plunge in TerraUSD, or UST, has reignited the debate over algorithmic stablecoins, a subject of controversy within the crypto industry. It crashed to around 45 cents on Wednesday, days after breaking an intended 1-to-1 peg to the dollar, as confidence in the project evaporated. Cashaa is among prospective investors that received the proposal from the Luna Foundation Guard, Gaurav said, adding that his firm won’t participate. Investors will be subject to a one-year lockup and a monthly “linear vest” over 12 months, he added. The LFG didn’t immediately respond to requests for comment. “UST’s collapse is the biggest threat to crypto right now,” said Gaurav. “It has massive ramifications across the entire industry. If UST stays below peg for enough time, it could cause even more Luna to be minted and sold to the market, increasing the risk of UST’s solvency.” The Block reported on the fundraising plans earlier. Broader crypto markets showed few signs of getting caught up in the turmoil on Wednesday, with stablecoins like Tether holding their pegs and major tokens including Bitcoin and Ether trading higher. Read: Do Kwon, the main backer behind TerraUSD, said in a  on Wednesday that he had endorsed a proposal to increase minting capacity of UST and Luna on the Terra blockchain from $293 million to $1.2 billion, arguing that this would “allow the system to absorb the UST more quickly.” “Before anything else, the only path forward will be to absorb the stablecoin supply that wants to exit before $UST can start to repeg. There is no way around it,” he said, noting that this effort would come at “a high cost” to all holders of TerraUSD and Luna. Kwon said options are being explored to bring in outside capital, without providing details. Unlike conventional stablecoins like Tether’s USDT or Circle’s USDC that are backed by real-world highly liquid cash equivalents or dollars, algorithmic tokens are designed to maintain their peg (and investor confidence) through a combination of mathematical equations and active trading. In the case of UST, investors can exchange one unit of the token, no matter what price it’s currently trading at, for $1 worth of Luna. The embedded arbitrage trade helps keep UST at or close to $1, or so the theory goes. Members of Anchor, a lending project built on the Terra blockchain, on Wednesday proposed temporarily cutting its interest rate to a minimum of 3.5%. Anchor has been the main driver of UST demand on Terra. It previously offered an interest rate of nearly 20% to those who deposit UST on its protocol. Falling yields on Anchor may lead to “significant” outflows from UST, which in turn impacts the supply of Luna and its price, said Kunal Goel, an analyst at Messari. That creates a vicious circle by increasing pressure on UST as less funds back the stablecoin, he said. “There is not enough demand for Luna because Luna holders know they will get diluted to pay off UST holders’ debt,” Goel said. “UST holders want to exit because they understand that their debt is not supported without the demand for Luna and sufficient reserves. That’s the death spiral we’re in.” © 2022 Bloomberg L.P.",
        "metadata": {
            "source": "moneyweb",
            "author": "Suvashree Ghosh and Emily Nicolle, Bloomberg",
            "category": "Fast News",
            "summary": "Cashaa among prospective investors that received the proposal from the Luna Foundation Guard."
        }
    },
    {
        "postid": 10,
        "date": "11 May 2022",
        "title": "TerraUSD stablecoin plunges",
        "url": "https://www.moneyweb.co.za/moneyweb-crypto/terrausd-stablecoin-plunges/",
        "article": " TerraUSD, the struggling and controversial algorithmic stablecoin, plunged on Wednesday as crypto markets await a rescue led by primary backer Do Kwon. The token plunged from its intended 1-to-1 peg to the US dollar to trade at around 40 cents at 9:10 a.m. in London, data compiled by Bloomberg show.  TerraUSD, or UST, is the biggest algorithmic stablecoin by market value. Over the weekend, the token lost its intended peg to the US dollar, falling to about 99 cents. A wave of selling followed, and by Monday evening UST had hit an all-time low of 60 cents. On Tuesday, following an earlier tweet from Kwon that he was “close to announcing a recovery plan,” the token traded off the lows and rallied to a high of around 94 cents. Unlike conventional stablecoins like Tether’s USDT or Circle’s USDC that are backed by real-world highly liquid cash equivalents or dollars, algorithmic tokens are designed to maintain their peg (and investor confidence) through a combination of mathematical equations and active trading. In the case of UST, investors can exchange one unit of the token, no matter what price it’s currently trading at, for $1 worth of Luna. The embedded arbitrage trade helps keep UST at or close to $1, or so the theory goes. Kwon and a group of investors known as the Luna Foundation Guard had previously issued $1.5 billion in loans denominated in both Bitcoin and UST to external firms in an attempt to support the peg. © 2022 Bloomberg L.P.",
        "metadata": {
            "source": "moneyweb",
            "author": "Muyao Shen and Philip Lagerkranser, Bloomberg",
            "category": "Moneyweb Crypto",
            "summary": "As crypto market awaits rescue."
        }
    }
]